%% -*- mode: erlang -*-
-module(swag_client_schema).

-export([get/0]).
-export([get_raw/0]).
-export([enumerate_discriminator_children/1]).

-define(DEFINITIONS, <<"definitions">>).

-spec get() -> swag_client:object().
get() ->
    ct_expand:term(enumerate_discriminator_children(maps:with([?DEFINITIONS], get_raw()))).

-spec enumerate_discriminator_children(Schema :: map()) ->
    Schema :: map() | no_return().
enumerate_discriminator_children(Schema = #{?DEFINITIONS := Defs}) ->
    try
        Parents = enumerate_parents(Defs),
        DefsFixed = maps:fold(fun correct_definition/3, Defs, Parents),
        Schema#{?DEFINITIONS := DefsFixed}
    catch
        _:Error ->
            handle_error(Error)
    end;
enumerate_discriminator_children(_) ->
    handle_error(no_definitions).

-spec handle_error(_) ->
    no_return().
handle_error(Error) ->
    erlang:error({schema_invalid, Error}).

enumerate_parents(Definitions) ->
    maps:fold(
        fun
            (Name, #{<<"allOf">> := AllOf}, AccIn) ->
                lists:foldl(
                    fun
                        (#{<<"$ref">> := <<"#/definitions/", Parent/binary>>}, Acc) ->
                            Schema = maps:get(Parent, Definitions),
                            Discriminator = maps:get(<<"discriminator">>, Schema, undefined),
                            add_parent_child(Discriminator, Parent, Name, Acc);
                        (_Schema, Acc) ->
                            Acc
                    end,
                    AccIn,
                    AllOf
                );
            (Name, #{<<"discriminator">> := _}, Acc) ->
                add_parent(Name, Acc);
            (_Name, _Schema, AccIn) ->
                AccIn
        end,
        #{},
        Definitions
    ).

add_parent_child(undefined, _Parent, _Child, Acc) ->
    Acc;
add_parent_child(_Discriminator, Parent, Child, Acc) ->
    maps:put(Parent, [Child | maps:get(Parent, Acc, [])], Acc).

add_parent(Parent, Acc) when not is_map_key(Parent, Acc) ->
    maps:put(Parent, [], Acc);
add_parent(_Parent, Acc) ->
    Acc.

correct_definition(Parent, Children, Definitions) ->
    ParentSchema1 = maps:get(Parent, Definitions),
    Discriminator = maps:get(<<"discriminator">>, ParentSchema1),
    ParentSchema2 = deep_put([<<"properties">>, Discriminator, <<"enum">>], Children, ParentSchema1),
    maps:put(Parent, ParentSchema2, Definitions).

deep_put([K], V, M) ->
    M#{K => V};
deep_put([K | Ks], V, M) ->
    maps:put(K, deep_put(Ks, V, maps:get(K, M)), M).

-spec get_raw() -> map().
get_raw() ->
    #{
  <<"swagger">> => <<"2.0">>,
  <<"info">> => #{
    <<"description">> => <<"\n## Описание\n\nVality Payments API предназначен для мерчантов, принимающих платежи из своего пользовательского\nинтерфейса, например веб-сайта или мобильного приложения, и является единственной точкой\nвзаимодействия с системой для проведения операций оплаты товаров и услуг.\n\n## Детали взаимодействия\n\nПри любом обращении к API в заголовке `X-Request-ID` соответствующего запроса необходимо\nпередать его уникальный идентификатор:\n\n```\n X-Request-ID: 37d735d4-0f42-4f05-89fa-eaa478fb5aa9\n```\n\n### Тип содержимого и кодировка\n\nСистема принимает и возвращает данные в формате JSON и кодировке UTF-8:\n\n```\n  Content-Type: application/json; charset=utf-8\n```\n\n### Формат дат\n\nСистема принимает и возвращает значения отметок времени в формате `date-time`, описанном в\n[RFC 3339](https://datatracker.ietf.org/doc/html/rfc3339):\n\n```\n  2017-01-01T00:00:00Z\n  2017-01-01T00:00:01+00:00\n```\n\n### Максимальное время обработки запроса\n\nПри любом обращении к API в заголовке `X-Request-Deadline` соответствующего запроса можно\nпередать параметр отсечки по времени, определяющий максимальное время ожидания завершения\nоперации по запросу:\n\n```\n X-Request-Deadline: 10s\n```\n\nПо истечении указанного времени система прекращает обработку запроса. Рекомендуется указывать\nзначение не более одной минуты, но не менее трёх секунд.\n\n`X-Request-Deadline` может:\n\n* задаваться в формате `date-time` согласно\n  [RFC 3339](https://datatracker.ietf.org/doc/html/rfc3339);\n* задаваться в относительных величинах: в миллисекундах (`150000ms`), секундах (`540s`) или\n  минутах (`3.5m`).\n">>,
    <<"version">> => <<"2.0.1">>,
    <<"title">> => <<"Vality Payments API">>
  },
  <<"basePath">> => <<"/v2">>,
  <<"tags">> => [ #{
    <<"name">> => <<"Parties">>,
    <<"description">> => <<"Участник системы - совокупность данных о вашей организации, составе и условиях заключенных договоров, а также информация о связанных с организацией магазинах.\n">>,
    <<"x-displayName">> => <<"Участники">>
  }, #{
    <<"name">> => <<"Shops">>,
    <<"description">> => <<"Магазин - это отображение вашего веб-сайта или точки продаж в системе. К магазину привязываются финансовые условия, которые определяют, в частности, процент комиссии системы. Каждый магазин в системе имеет привязанные счета, на которых аккумулируются отправленные плательщиками деньги. В каждой валюте может существовать только один счет. Категория магазина определяет группы товаров или услуг, которые в нем представлены. К магазину может быть привязан банковский терминал на стороне банка-эквайера. Любые изменения данных магазинов требуют верификации на стороне системы.\nДля тестовых платежей используются магазины, созданные в тестовой категории. Первый тестовый магазин система создает автоматически при регистрации участника.\nВаш веб-сайт или точка продаж могут иметь более одного магазина, ближайшим аналогом можно представить банковские POS-терминалы на точке продаж.\n## Асинхронные уведомления\nДля любого магазина можно указать URL для получения асинхронных оповещений об изменении состояния данных при помощи установки webhook'а. Например, вы можете установить webhook, указав URL вашего приложения, на который система будет отправлять данных об изменении состояния инвойса. Для проверки подлинности присланных на URL вашего приложения данных используется соответствующий публичный ключ, который создаётся при установке этого webhook'а и получить который можно в вашем личном кабинете.\n">>,
    <<"x-displayName">> => <<"Магазины">>
  }, #{
    <<"name">> => <<"Invoices">>,
    <<"description">> => <<"Инвойс - это базовая модель для работы с системой по приему платежей. Перед\nрендерингом платежной формы, запуском транзакций на списание денег,\nхолдированием средств на карте плательщика и запуском других подобных\nбизнес-процессов, необходимо создать инвойс и узнать его идентификатор.\n\nВ общем случае, инвойс является контейнером для платежей, данных о товарах\nи магазине. Инвойсы имеют настраиваемый ограниченный срок жизни. После\nистечения срока жизни состояние инвойса изменить невозможно.\n\n\n## Состояния и статусы инвойса\n\n### Таблица состояний инвойса:\n  | Состояние  | Обозначение |  Описание                                                                                                |\n  | --         | --          | --                                                                                                       |\n  | Не оплачен | `unpaid`    | Инвойс создан, но финансовые обязательства ещё не погашены.                                              |\n  | Отменён    | `cancelled` | Инвойс отменён с указанием причины, все обязательства по нему недействительны.                           |\n  | Оплачен    | `paid`      | Финансовые обязательства по инвойсу погашены, но товары или услуги плательщику ещё не предоставлены.     |\n  | Погашен    | `fulfilled` | Все обязательства, как плательщика, так и мерчанта, погашены.                                            |\n\nВ узлах диаграммы указаны статусы инвойса, стрелки помечены процессами,\nуспешное завершение которых порождает переход из одного статуса в другой.\n\n![Invoice State diagram](wsd/img/invoice.svg)\n\n## Метаданные инвойса и платежа\n\nСистема предоставляет вам возможность заполнить и сохранить любые\nнеобходимые метаданные как в структуре инвойса, так и в структуре любого платежа.\nДанные описываются массивом JSON. В дальнейшем система предоставит\nвам эти данные при запросе данных инвойса или платежа по его идентификатору\nлибо пришлет в асинхронном режиме на webhook, установленный для соответствующего\nмагазина, если он есть.\n\n## События инвойса\n\nЛюбые изменения состояния данных в системе порождают события. Можно получить как\nполный список событий, приведших к определенному состоянию данных, так и\nпоследнее событие, описывающее текущее состояние объекта. Например, для\nтого, чтобы узнать состояние инвойса, и таким образом принять решение об\nотгрузке товара или предоставлении услуги плательщику, можно запросить у\nсистемы все события, произошедшие в рамках указанного ID инвойса, либо\nсамое последнее из них.\n\n## Authorization\n\nОперации:\n\n* создания инвойса,\n\n* отмены инвойса,\n\n* погашения инвойса,\n\n* получения *нового* токена доступа к инвойсу (уже после создания инвойса)\n\n\nавторизуются вашим API-ключом.\n\n### Токен доступа к инвойсу\n\nТокен доступа к инвойсу авторизует ограниченное количество операций,\nнеобходимых для проведения [платежей](#tag/Payments) по указанному\nинвойсу, в частности:\n\n* [токенизация](#tag/Tokens) платёжных инструментов,\n\n* создание платежей по этому и только этому инвойсу,\n\n* получение состояния и событий этого инвойса.\n\n\nСрок действия токена составляет 3 суток от момента создания, после\nистечения которого использовать его для авторизации операций будет более\nневозможно.\n\n## Распределение денежных средств\n\nВ рамках одного инвойса можно указать распределение денежных средств\nмежду несколькими магазинами. При необходимости можно добавить комиссию,\nкоторая будет начисляться магазину переданному при создании инвойса (далее магазин инвойса).\nОбщая сумма всех транзакций распределения не должна превышать сумму инвойса.\nВ распределении не должно быть больше одной транзакции для каждого магазина.\nТранзакции распределения бывают следующих типов:\n\n* С телом AllocationBodyAmount, в котором передается сумма, перечисляемая магазину.\nЧтобы добавить комиссию нужно создать транзакцию в пользу магазина инвойса.\n\n* С телом AllocationBodyTotal, в котором передается общая сумма транзакции и комиссия к ней,\nпри этом комиссия может быть следующих типов:\n  * AllocationFeeFixed или значение комиссии в пользу магазина инвойса.\n  * AllocationFeeShare или процент от общей суммы транзакции в пользу магазина инвойса.\n">>,
    <<"x-displayName">> => <<"Инвойсы">>
  }, #{
    <<"name">> => <<"InvoiceTemplates">>,
    <<"description">> => <<"Шаблоны инвойсов позволяют упростить выставление инвойсов. Шаблон инвойса привязан к конкретному магазину и содержит спецификацию, по которой можно создавать инвойсы, указывая только конкретнyю стоимость товаров и услуг и/или метаданные инвойса. В случае, если шаблон содержит фиксированную стоимость, её также можно опустить при создании инвойса. Если при создании инвойса по шаблону не указать метаданные инвойса, они будут взяты из значения в шаблоне (если шаблон содержит метаданные).\n\nCоздание, модификация и удаление шаблона инвойса не требуют верификации на стороне системы и заявок на эти изменения.\n## Authorization\nСоздание, модификация и удаление шаблона инвойса авторизуются вашим API-ключом.\n### Токен доступа к шаблону инвойса\nТокен доступа к шаблону инвойса создается в результате операции создания шаблона. Он авторизует:\n* получение шаблона инвойса по его идентификатору,\n* создание инвойса по данному шаблону.\n">>,
    <<"x-displayName">> => <<"Шаблоны инвойсов">>
  }, #{
    <<"name">> => <<"Payments">>,
    <<"description">> => <<"Реальное списание денег с плательщиков осуществляется вызовом метода создания платежа. Перед запуском платежей необходимо создать инвойс, в рамках которого система будет проводить попытки списания, а также указать токен платежного средства плательщика. Таким образом, система предоставляет вам интерфейс, позволяющий со стороны вашего серверного кода инициировать и контролировать процесс списания денег. Данный процесс может быть, как синхронным, когда вы ожидаете ответа системы, так и асинхронным, когда после запуска платежа вы ожидаете уведомлений на установленный для соответствующего магазина webhook.\n## Варианты проведения оплаты\nСистема предоставляет два метода выполнения операции оплаты: одно- и двухстадийный, PaymentFlowInstant и PaymentFlowHold.\nОдностадийная оплата (PaymentFlowInstant) выполняется вызовом одного метода API, по результатам которого проходит авторизация и последующее списание средств в пользу магазина в рамках одной транзакции.\nДвухстадийная оплата (PaymentFlowHold) подразумевает вызов двух методов: отдельно на авторизацию, отдельно на списание. После успешной авторизации сумма операции будет блокирована на счету плательщика, то есть он не сможет ей воспользоваться.\nПодтвердить списание (capturePayment) можно на равную или меньшую сумму авторизации. В случае указания меньшей суммы остаток средств будет автоматически возвращен плательщику. Подтвердить или отменить успешную авторизацию можно как вручную, вызвав соответствующий метод API (capturePayment или cancelPayment), так и автоматически, согласно выбранной стратегии onHoldExpiration. Срок ручного подтверждения устанавливается нами в настройках системы и, как правило, составляет от 3 до 7 календарных дней.\n## Платежная сессия\nСистема обеспечивает идемпотентность списания денег с платежного средства, предоставляя уникальный идентификатор платежной сессии. Данный идентификатор предоставляется в процессе создания [токена платежного средства](#tag/Tokens) и гарантирует идемпотентность запросов на списание средств, обеспечивая защиту от ошибочных повторных списаний.\n## Ограничение времени обработки платежа\nПри создании платежа в рамках системы, в поле `processingDeadline` можно задать время выполнения платежа, по истечении которого, система попытается прекратить обработку платежа и перевести его в статус `failed` с ошибкой `processing_deadline_reached`.\n\nОграничение на время обработки следует рассматривать как рекомендацию, поскольку в зависимости от платежного средства и текущего состояния платежа у системы может не быть возможности прекратить обработку. Если значение поля не установлено, то система выберет его самостоятельно, так чтобы было достаточно времени для прохождения платежа в обычных условиях.\n\nОграничение времени обработки платежа, аналогично заголовку `X-Request-Deadline`, может указываться в формате, описанном в RFC 3339, или в относительных величинах.\n## Authorization\nЗапросы API платежей авторизуются либо токеном доступа к инвойсу, по которому создан платеж, либо вашим API-ключом.\n">>,
    <<"x-displayName">> => <<"Платежи">>
  }, #{
    <<"name">> => <<"Tokens">>,
    <<"description">> => <<"Система предоставляет вам возможность самостоятельно инициировать списание денег с платежных карт плательщиков и берет на себя процессы сертификации и соответствия стандартам PCS-DSS. Стандарт декларирует запрет на обработку и хранение данных держателей карт (ДДК) на стороне мерчанта. Используемые нами подходы к реализации интерфейса подразумевают возможность верстки и отдачи HTML формы для ввода ДДК на стороне вашего серверного кода. Чтобы обеспечить соответствие стандартам мы предоставляем разработанную нами JS-библиотеку, которая после встраивания в HTML-код вашей платежной формы в асинхронном режиме собирает ДДК и отправляет на интерфейс системы для дальнейшего шифрования и токенизации. В ответ JS-библиотека возвращает на вашу платежную форму уникальный токен платежной карты, который в дальнейшем вы можете использовать для запуска платежей.\n\nВ процессе создания токена предоставляется [платежная сессия](#tag/Payments), обеспечивающая идемпотентность списания денег с платежного средства.\n">>,
    <<"x-displayName">> => <<"Платежные токены">>
  }, #{
    <<"name">> => <<"Categories">>,
    <<"description">> => <<"Для описания групп товаров и услуг, предоставляемых магазинами, используются категории. Категории могут влиять на предоставление статистики, упорядочивание магазинов, а также на финансовые условия системы.\n">>,
    <<"x-displayName">> => <<"Категории магазинов">>
  }, #{
    <<"name">> => <<"Contracts">>,
    <<"description">> => <<"Договор содержит данные юридического соглашения, на основе которого система предоставляет всевозможные услуги мерчанту. В договоре, в частности описывается набор условий, по которым предоставляются сервисы системы, например, комиссии на проведение транзакций, условия вывода средств и данных юридического лица.\nЛюбые изменения данных магазинов требуют верификации на стороне системы путем создания заявок на изменение.\n">>,
    <<"x-displayName">> => <<"Договоры">>
  }, #{
    <<"name">> => <<"Payouts">>,
    <<"description">> => <<"Для получения автоматических выплат по принятым платежам на ваш банковский счет необходимо в рамках договора с системой указать данные для вывода средств. В дальнейшем по указанным данным система будет инициировать банковские переводы на основе суммы платежей, принятой по всем активным магазинам.\nЛюбые изменения данных требуют верификации на стороне системы путем создания заявок на изменение.\n">>,
    <<"x-displayName">> => <<"Вывод средств">>
  }, #{
    <<"name">> => <<"Webhooks">>,
    <<"description">> => <<"В данном разделе описаны методы, позволяющие управлять Webhook'ами, или инструментами для получения асинхронных оповещений посредством HTTP-запросов при наступлении одного или группы интересующих вас событий, например, о том, что платеж в рамках созданного инвойса был успешно оплачен.\nВнимание! Только Webhooks Management API является частью данной спецификации. Для реализации обработчика присылаемых уведомлений вам необходимо будет ознакомиться со спецификацей [Vality Webhooks Events API](https://github.com/valitydev/swag-payments-webhook-events).\n">>,
    <<"x-displayName">> => <<"Webhooks">>
  }, #{
    <<"name">> => <<"Search">>,
    <<"description">> => <<"Для получения списка всех инвойсов/платежей указанного магазина необходимо вызвать соответствующий метод платформы. Имеется возможность отфильтровать выборку по определенным статусам.\n">>,
    <<"x-displayName">> => <<"Поиск">>
  }, #{
    <<"name">> => <<"PaymentInstitutions">>,
    <<"description">> => <<"Платёжная организация - организация, осуществляющая услуги по обслуживанию финансовых операций, которые возникают в результате осуществления бизнес-процессов системой.\n">>,
    <<"x-displayName">> => <<"Платёжные организации">>
  }, #{
    <<"name">> => <<"Error Codes">>,
    <<"description">> => <<"\n## Ошибки бизнес-логики\nВсе ошибки бизнес-логики имеют следуюший вид:\n\n  ```json\n  {\n    \"code\": \"string\",\n    \"message\": \"string\"\n  }\n  ```\n\nВ поле `code` содержится тип ошибки, а в `message` - дополнительная информация по произошедшей ошибке.\nНа данный момент существуют следующие коды ошибок:\n\n  | Код                              | Описание                                                                                                                              |\n  | ---                              | --------                                                                                                                              |\n  | **operationNotPermitted**        | Недоступная в рамках действующего договора операция.                                                                                  |\n  | **invalidPartyStatus**           | Ваш участник заблокирован или его операции приостановлены. В последнем случае вы можете их [возобновить](#operation/activateMyParty). |\n  | **invalidShopStatus**            | Ваш магазин заблокирован или его операции приостановлены. В последнем случае вы можете их [возобновить](#operation/activateShop).     |\n  | **invalidContractStatus**        | Ваш договор более не имеет силы, по причине истечения срока действия или расторжения.                                                 |\n  | **invalidShopID**                | Магазин с указанным идентификатором не существует или недоступен.                                                                     |\n  | **invalidInvoiceCost**           | Стоимость инвойса не указана или неверна, в частности, не равна стоимости позиций в корзине.                                          |\n  | **invalidInvoiceCart**           | Некорректная корзина в инвойсе, Например, пустая.                                                                                     |\n  | **invalidInvoiceStatus**         | Неверный [статус инвойса](#tag/Invoices). Например, при попытке [оплатить](#operation/createPayment) отменённый инвойс.               |\n  | **invoiceTermsViolated**         | Инвойс нарушает ограничения, установленные в рамках действующего договора.                                                            |\n  | **invoicePaymentPending**        | Последний запущенный платёж по указанному инвойсу ещё не достиг финального статуса.                                                   |\n  | **invalidPaymentStatus**         | Неверный [статус платежа](#tag/Payments). Например, при попытке [подтвердить](#operation/capturePayment) неуспешный платёж.           |\n  | **invalidPaymentResource**       | Не поддерживаемый системой или не подключенный в рамках действующего договора платежный инструмент.                                   |\n  | **invalidPaymentToolToken**      | Неверное содержимое токена платёжного инструмента.                                                                                    |\n  | **invalidProcessingDeadline**    | Неверный формат ограничения времени авторизации платежа.                                                                              |\n  | **invalidPaymentSession**        | Невернoе содержимое платёжной сессии.                                                                                                 |\n  | **invalidRecurrentParent**       | Невернo указан родительский рекуррентный платеж.                                                                                      |\n  | **insufficentAccountBalance**    | Недостаточный объём денежных средств на счёте магазина, например, для проведения возврата.                                            |\n  | **invoicePaymentAmountExceeded** | Попытка возврата сверх суммы платежа.                                                                                                 |\n  | **inconsistentRefundCurrency**   | Попытка возврата средств в валюте, отличной от валюты платежа.                                                                        |\n  | **changesetConflict**            | Попытка внести изменения участника, конфликтующие с изменениями в других заявках, ожидающих рассмотрения.                             |\n  | **invalidChangeset**             | Неверные изменения участника, например, попытка создать магазин в валюте, недоступной в рамках договора.                              |\n  | **limitExceeded**                | Превышен разумный лимит выборки. В этом случае лучше запросить менее объёмный набор данных.                                           |\n  | **invalidDeadline**              | Неверный формат времени.                                                                                                              |\n  | **chargebackInProgress**         | Попытка возврата при открытом возвратном платеже.                                                                                     |\n  | **invalidRequest**               | Прочие неверные данные запроса.                                                                                                       |\n  | **invalidPartyID**               | Участник с указанным идентификатором не существует или недоступен.                                                                    |\n  | **ambiguousPartyID**             | Невозможно однозначно определить идентификатор участника, укажите идентификатор в запросе явно.                                       |\n  | **invalidAllocation**            | Некорректное распределение денежных средств, Например, больше одной транзакции в пользу одного из магазинов.                          |\n  | **allocationNotPermitted**       | Распределение недоступно в рамках договора.                                                                                           |\n  | **refundCartConflict**           | Невозможно однозначно определить содержание возврата, так как одновременно переданы распределение и корзина рефанда.                  |\n\n## Общие ошибки\nОшибки возникающие при попытках совершения операций с незарегистрированными в системе объектами. Имеют вид\n\n  ```json\n  {\n      \"message\": \"string\"\n  }\n  ```\n\nВ поле `message` содержится информация по произошедшей ошибке. Например:\n\n  ```json\n  {\n      \"message\": \"Invoice not found\"\n  }\n  ```\n\n## Ошибки обработки запросов\nВ процессе обработки запросов силами нашей системы могут происходить различные непредвиденные ситуации. Об их появлении система сигнализирует по протоколу HTTP соответствующими [статусами][5xx], обозначающими ошибки сервера.\n\n  |  Код    |  Описание  |\n  | ------- | ---------- |\n  | **500** | В процессе обработки системой запроса возникла непредвиденная ситуация. При получении подобного кода ответа мы рекомендуем обратиться в техническую поддержку. |\n  | **503** | Система временно недоступна и не готова обслуживать данный запрос. Запрос гарантированно не выполнен, при получении подобного кода ответа попробуйте выполнить его позднее, когда доступность системы будет восстановлена. |\n  | **504** | Система превысила допустимое время обработки запроса, результат запроса не определён. Попробуйте отправить запрос повторно или выяснить результат выполнения исходного запроса, если повторное исполнение запроса нежелательно. |\n\n[5xx]: https://tools.ietf.org/html/rfc7231#section-6.6\n\n## Ошибки платежа\nОшибки, передаваемые в платежную форму (отображаются плательщикам):\n\n  | Код                    | Описание                                                                                                                                      |\n  | ---                    | --------                                                                                                                                      |\n  | InvalidPaymentTool     | Неверный платежный инструмент (введен номер несуществующей карты, отсутствующего аккаунта и т.п.)                                             |\n  | AccountLimitsExceeded  | Превышены лимиты (например, в личном кабинете плательщика установлено ограничение по сумме платежа, стране списания)                          |\n  | InsufficientFunds      | Недостаточно средств на счете                                                                                                                 |\n  | PreauthorizationFailed | Предварительная авторизация отклонена (введен неверный код 3D-Secure, на форме 3D-Secure нажата ссылка отмены)                                |\n  | RejectedByIssuer       | Платёж отклонён эмитентом (установлены запреты по стране списания, запрет на покупки в интернете, платеж отклонен антифродом эмитента и т.п.) |\n  | PaymentRejected        | платёж отклонён по иным причинам                                                                                                              |\n\nОшибки, передаваемые в ЛК мерчанта (отображаются только вам):\n- timeout\n\n  Истекло время ожидания попытки оплаты\n\n- rejected_by_inspector\n\n  Отклонено сервисом противодействия мошенничеству\n\n- preauthorization_failed\n\n  Ошибка предавторизации (3DS)\n\n- authorization_failed:\n\n  Ошибка авторизации платежа у провайдера\n\n  - unknown\n\n    Неизвестная ошибка авторизации\n\n  - merchant_blocked\n\n    Мерчант заблокирован\n\n  - operation_blocked\n\n    Операция платежа заблокирована\n\n  - account_not_found\n\n    Аккаунт не найден\n\n  - account_blocked\n\n    Аккаунт заблокирован\n\n  - account_stolen\n\n    Аккаунт украден\n\n  - insufficient_funds\n\n    Не хватает средств\n\n  - processing_deadline_reached\n\n    Истекло время выполнения платежа (см. [Ограничение времени обработки платежа](#section/Ogranichenie-vremeni-obrabotki-platezha))\n\n  - account_limit_exceeded:\n\n    Превышен лимит на счете плательщика\n\n    - unknown\n\n      Объект лимита неизвестен\n\n    - amount\n\n      Лимит на сумму\n\n    - number\n\n      Лимит на количество попыток\n\n  - provider_limit_exceeded:\n\n    Превышен лимит на данного мерчанта или на систему в целом у провайдера\n\n    - unknown\n\n      Объект лимита неизвестен\n\n    - amount\n\n      Лимит на сумму\n\n    - number\n\n      Лимит на количество попыток\n\n  - payment_tool_rejected:\n\n    Платёжный интрумент отклонён\n\n    - unknown\n\n      Неизвестный платёжный интрумент\n\n    - bank_card_rejected:\n\n      Банковская карта отклонена\n\n      - unknown\n\n        Причина неизвестна\n\n      - card_number_invalid\n\n        Неверный номер карты\n\n      - card_expired\n\n        Истёк срок действия карты\n\n      - card_holder_invalid\n\n        Неверный владелец карты\n\n      - cvv_invalid\n\n        Неверный CVV код\n\n      - issuer_not_found\n\n        Эмитент не найден\n\n  - security_policy_violated\n\n    Нарушения политики безопасности\n\n  - temporarily_unavailable\n\n    Временная недоступность третьих сторон\n\n  - rejected_by_issuer\n\n    Отклонено эмитентом\n\n\nНапример, в случае некорректного CVV:\n```\n{\n    \"code\": \"authorization_failed\",\n    \"subError\": {\n        \"code\": \"payment_tool_rejected\",\n        \"subError\": {\n            \"code\": \"bank_card_rejected\",\n            \"subError\": {\n                \"code\": \"cvv_invalid\"\n            }\n        }\n    }\n}\n```\nЕсли вы получили ошибку, которой нет в данном описании, обратитесь в техническую поддержку.\n">>,
    <<"x-displayName">> => <<"Коды ошибок">>
  } ],
  <<"schemes">> => [ <<"https">> ],
  <<"consumes">> => [ <<"application/json; charset=utf-8">> ],
  <<"produces">> => [ <<"application/json; charset=utf-8">> ],
  <<"security">> => [ #{
    <<"bearer">> => [ ]
  } ],
  <<"paths">> => #{
    <<"/analytics/shops/{shopID}/invoices">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Search">> ],
        <<"description">> => <<"Поиск инвойсов">>,
        <<"operationId">> => <<"searchInvoices">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"shopID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор магазина">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"fromTime">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Начало временного отрезка">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"format">> => <<"date-time">>
        }, #{
          <<"name">> => <<"toTime">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Конец временного отрезка">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"format">> => <<"date-time">>
        }, #{
          <<"name">> => <<"limit">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Лимит выборки">>,
          <<"required">> => true,
          <<"type">> => <<"integer">>,
          <<"maximum">> => 1000,
          <<"minimum">> => 1,
          <<"format">> => <<"int32">>
        }, #{
          <<"name">> => <<"invoiceStatus">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Статус инвойса для поиска">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"enum">> => [ <<"unpaid">>, <<"cancelled">>, <<"paid">>, <<"fulfilled">> ]
        }, #{
          <<"name">> => <<"paymentStatus">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Статус платежа для поиска">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"enum">> => [ <<"pending">>, <<"processed">>, <<"captured">>, <<"cancelled">>, <<"refunded">>, <<"failed">> ]
        }, #{
          <<"name">> => <<"paymentFlow">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Flow платежа">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"enum">> => [ <<"instant">>, <<"hold">> ]
        }, #{
          <<"name">> => <<"paymentMethod">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Метод оплаты">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"enum">> => [ <<"bankCard">>, <<"paymentTerminal">> ]
        }, #{
          <<"name">> => <<"paymentTerminalProvider">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Провайдер платежного терминала">>,
          <<"required">> => false,
          <<"type">> => <<"string">>
        }, #{
          <<"name">> => <<"invoiceID">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Идентификатор инвойса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"paymentID">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Идентификатор платежа">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"payerEmail">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Email, указанный при оплате">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 100,
          <<"format">> => <<"email">>
        }, #{
          <<"name">> => <<"payerIP">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"IP-адрес плательщика">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 45,
          <<"format">> => <<"ip-address">>
        }, #{
          <<"name">> => <<"payerFingerprint">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Уникальный отпечаток user agent'а плательщика">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 1000
        }, #{
          <<"name">> => <<"customerID">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Идентификатор плательщика">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"bankCardTokenProvider">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Провайдер платежных токенов.\n\nНабор провайдеров, доступных для проведения платежей, можно узнать, вызвав соответствующую [операцию](#operation/getInvoicePaymentMethods) после создания инвойса.\n">>,
          <<"required">> => false,
          <<"type">> => <<"string">>
        }, #{
          <<"name">> => <<"bankCardPaymentSystem">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Платежная система.\n\nНабор систем, доступных для проведения платежей, можно узнать, вызвав соответствующую [операцию](#operation/getInvoicePaymentMethods) после создания инвойса.\n">>,
          <<"required">> => false,
          <<"type">> => <<"string">>
        }, #{
          <<"name">> => <<"first6">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Первые 6 цифр номера карты">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"pattern">> => <<"^\\d{6}$">>
        }, #{
          <<"name">> => <<"last4">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Последние цифры номера карты">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"pattern">> => <<"^\\d{0,4}$">>
        }, #{
          <<"name">> => <<"rrn">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Retrieval Reference Number">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"pattern">> => <<"^[a-zA-Z0-9]{12}$">>
        }, #{
          <<"name">> => <<"paymentAmount">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Сумма платежа">>,
          <<"required">> => false,
          <<"type">> => <<"integer">>,
          <<"minimum">> => 1,
          <<"format">> => <<"int64">>
        }, #{
          <<"name">> => <<"invoiceAmount">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Сумма инвойса">>,
          <<"required">> => false,
          <<"type">> => <<"integer">>,
          <<"minimum">> => 1,
          <<"format">> => <<"int64">>
        }, #{
          <<"name">> => <<"continuationToken">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Токен, сигнализирующий о том, что в ответе передана только часть данных.\nДля получения следующей части нужно повторно обратиться к сервису, указав тот-же набор условий и полученый токен.\nЕсли токена нет, получена последняя часть данных.\n">>,
          <<"required">> => false,
          <<"type">> => <<"string">>
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Найденные инвойсы">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/inline_response_200">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/analytics/shops/{shopID}/payments">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Search">> ],
        <<"description">> => <<"Поиск платежей">>,
        <<"operationId">> => <<"searchPayments">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"shopID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор магазина">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"fromTime">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Начало временного отрезка">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"format">> => <<"date-time">>
        }, #{
          <<"name">> => <<"toTime">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Конец временного отрезка">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"format">> => <<"date-time">>
        }, #{
          <<"name">> => <<"limit">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Лимит выборки">>,
          <<"required">> => true,
          <<"type">> => <<"integer">>,
          <<"maximum">> => 1000,
          <<"minimum">> => 1,
          <<"format">> => <<"int32">>
        }, #{
          <<"name">> => <<"paymentStatus">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Статус платежа для поиска">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"enum">> => [ <<"pending">>, <<"processed">>, <<"captured">>, <<"cancelled">>, <<"refunded">>, <<"failed">> ]
        }, #{
          <<"name">> => <<"paymentFlow">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Flow платежа">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"enum">> => [ <<"instant">>, <<"hold">> ]
        }, #{
          <<"name">> => <<"paymentMethod">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Метод оплаты">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"enum">> => [ <<"bankCard">>, <<"paymentTerminal">> ]
        }, #{
          <<"name">> => <<"paymentTerminalProvider">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Провайдер платежного терминала">>,
          <<"required">> => false,
          <<"type">> => <<"string">>
        }, #{
          <<"name">> => <<"invoiceID">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Идентификатор инвойса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"paymentID">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Идентификатор платежа">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"payerEmail">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Email, указанный при оплате">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 100,
          <<"format">> => <<"email">>
        }, #{
          <<"name">> => <<"payerIP">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"IP-адрес плательщика">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 45,
          <<"format">> => <<"ip-address">>
        }, #{
          <<"name">> => <<"payerFingerprint">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Уникальный отпечаток user agent'а плательщика">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 1000
        }, #{
          <<"name">> => <<"customerID">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Идентификатор плательщика">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"first6">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Первые 6 цифр номера карты">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"pattern">> => <<"^\\d{6}$">>
        }, #{
          <<"name">> => <<"last4">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Последние цифры номера карты">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"pattern">> => <<"^\\d{0,4}$">>
        }, #{
          <<"name">> => <<"rrn">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Retrieval Reference Number">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"pattern">> => <<"^[a-zA-Z0-9]{12}$">>
        }, #{
          <<"name">> => <<"approvalCode">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Authorization Approval Code">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"bankCardTokenProvider">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Провайдер платежных токенов.\n\nНабор провайдеров, доступных для проведения платежей, можно узнать, вызвав соответствующую [операцию](#operation/getInvoicePaymentMethods) после создания инвойса.\n">>,
          <<"required">> => false,
          <<"type">> => <<"string">>
        }, #{
          <<"name">> => <<"bankCardPaymentSystem">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Платежная система.\n\nНабор систем, доступных для проведения платежей, можно узнать, вызвав соответствующую [операцию](#operation/getInvoicePaymentMethods) после создания инвойса.\n">>,
          <<"required">> => false,
          <<"type">> => <<"string">>
        }, #{
          <<"name">> => <<"paymentAmount">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Сумма платежа">>,
          <<"required">> => false,
          <<"type">> => <<"integer">>,
          <<"minimum">> => 1,
          <<"format">> => <<"int64">>
        }, #{
          <<"name">> => <<"continuationToken">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Токен, сигнализирующий о том, что в ответе передана только часть данных.\nДля получения следующей части нужно повторно обратиться к сервису, указав тот-же набор условий и полученый токен.\nЕсли токена нет, получена последняя часть данных.\n">>,
          <<"required">> => false,
          <<"type">> => <<"string">>
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Найденные платежи">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/inline_response_200_1">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/analytics/shops/{shopID}/payouts">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Search">> ],
        <<"description">> => <<"Поиск выплат">>,
        <<"operationId">> => <<"searchPayouts">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"shopID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор магазина">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"fromTime">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Начало временного отрезка">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"format">> => <<"date-time">>
        }, #{
          <<"name">> => <<"toTime">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Конец временного отрезка">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"format">> => <<"date-time">>
        }, #{
          <<"name">> => <<"limit">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Лимит выборки">>,
          <<"required">> => true,
          <<"type">> => <<"integer">>,
          <<"maximum">> => 1000,
          <<"minimum">> => 1,
          <<"format">> => <<"int32">>
        }, #{
          <<"name">> => <<"offset">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Смещение выборки">>,
          <<"required">> => false,
          <<"type">> => <<"integer">>,
          <<"minimum">> => 0
        }, #{
          <<"name">> => <<"payoutID">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Идентификатор выплаты">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"payoutToolType">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Тип выплаты для поиска\n  * PayoutAccount - выплата на банковский счёт\n  * Wallet - выплата на кошелёк\n  * PaymentInstitutionAccount - выплата на счёт платежной организации\n">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"enum">> => [ <<"PayoutAccount">>, <<"Wallet">>, <<"PaymentInstitutionAccount">> ]
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Найденные выплаты">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/inline_response_200_2">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/analytics/shops/{shopID}/refunds">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Search">> ],
        <<"description">> => <<"Поиск возвратов">>,
        <<"operationId">> => <<"searchRefunds">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"shopID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор магазина">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"fromTime">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Начало временного отрезка">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"format">> => <<"date-time">>
        }, #{
          <<"name">> => <<"toTime">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Конец временного отрезка">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"format">> => <<"date-time">>
        }, #{
          <<"name">> => <<"limit">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Лимит выборки">>,
          <<"required">> => true,
          <<"type">> => <<"integer">>,
          <<"maximum">> => 1000,
          <<"minimum">> => 1,
          <<"format">> => <<"int32">>
        }, #{
          <<"name">> => <<"offset">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Смещение выборки">>,
          <<"required">> => false,
          <<"type">> => <<"integer">>,
          <<"minimum">> => 0
        }, #{
          <<"name">> => <<"invoiceID">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Идентификатор инвойса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"paymentID">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Идентификатор платежа">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"refundID">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Идентификатор возврата">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"rrn">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Retrieval Reference Number">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"pattern">> => <<"^[a-zA-Z0-9]{12}$">>
        }, #{
          <<"name">> => <<"approvalCode">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Authorization Approval Code">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"refundStatus">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Статус возврата">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"enum">> => [ <<"pending">>, <<"succeeded">>, <<"failed">> ]
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Найденные возвраты">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/inline_response_200_3">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/categories">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Categories">> ],
        <<"description">> => <<"Получить список категорий">>,
        <<"operationId">> => <<"getCategories">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"List of categories">>,
            <<"schema">> => #{
              <<"type">> => <<"array">>,
              <<"items">> => #{
                <<"$ref">> => <<"#/definitions/Category">>
              }
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          }
        }
      }
    },
    <<"/processing/categories/{categoryID}">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Categories">> ],
        <<"description">> => <<"Получить данные категории по ее ID">>,
        <<"operationId">> => <<"getCategoryByRef">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"categoryID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Category reference">>,
          <<"required">> => true,
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int32">>
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Category found">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/Category">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/contracts">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Contracts">> ],
        <<"description">> => <<"Получить данные всех договоров участника">>,
        <<"operationId">> => <<"getContracts">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"List of contracts">>,
            <<"schema">> => #{
              <<"type">> => <<"array">>,
              <<"items">> => #{
                <<"$ref">> => <<"#/definitions/Contract">>
              }
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          }
        }
      }
    },
    <<"/processing/contracts/{contractID}">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Contracts">> ],
        <<"description">> => <<"Получить данные договора по его ID">>,
        <<"operationId">> => <<"getContractByID">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"contractID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор договора">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Contract found">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/Contract">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/contracts/{contractID}/adjustments">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Contracts">> ],
        <<"description">> => <<"Получить данные всех поправок к указанному договору">>,
        <<"operationId">> => <<"getContractAdjustments">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"contractID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор договора">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Набор поправок к договору">>,
            <<"schema">> => #{
              <<"type">> => <<"array">>,
              <<"items">> => #{
                <<"$ref">> => <<"#/definitions/ContractAdjustment">>
              }
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/contracts/{contractID}/adjustments/{adjustmentID}">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Contracts">> ],
        <<"description">> => <<"Получить данные поправки к договору по её идентификатору">>,
        <<"operationId">> => <<"getContractAdjustmentByID">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"contractID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор договора">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"adjustmentID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор поправки к договору">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Данные поправки к договору">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/ContractAdjustment">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/contracts/{contractID}/payout_tools">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Payouts">> ],
        <<"description">> => <<"Получить данные всех средств вывода">>,
        <<"operationId">> => <<"getPayoutTools">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"contractID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор договора">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Набор средств вывода">>,
            <<"schema">> => #{
              <<"type">> => <<"array">>,
              <<"items">> => #{
                <<"$ref">> => <<"#/definitions/PayoutTool">>
              }
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/contracts/{contractID}/payout_tools/{payoutToolID}">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Payouts">> ],
        <<"description">> => <<"Получить данные средства вывода по его идентификатору">>,
        <<"operationId">> => <<"getPayoutToolByID">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"contractID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор договора">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"payoutToolID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор средства вывода">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Данные средства вывода">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/PayoutTool">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/countries">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Countries">> ],
        <<"description">> => <<"Получить список стран">>,
        <<"operationId">> => <<"getCountries">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Список стран">>,
            <<"schema">> => #{
              <<"type">> => <<"array">>,
              <<"items">> => #{
                <<"$ref">> => <<"#/definitions/Country">>
              }
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          }
        }
      }
    },
    <<"/processing/countries/{countryID}">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Countries">> ],
        <<"description">> => <<"Получить данные страны по ее ID">>,
        <<"operationId">> => <<"getCountryByID">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"countryID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Alpha-3 код страны по стандарту [ISO 3166-1](https://en.wikipedia.org/wiki/ISO_3166-1)">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"pattern">> => <<"^[A-Z]{3}$">>
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Страна найдена">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/Country">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/customers">> => #{
      <<"post">> => #{
        <<"tags">> => [ <<"Customers">> ],
        <<"description">> => <<"Создать нового плательщика.">>,
        <<"operationId">> => <<"createCustomer">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"in">> => <<"body">>,
          <<"name">> => <<"customerParams">>,
          <<"description">> => <<"Параметры создаваемого плательщика">>,
          <<"required">> => true,
          <<"schema">> => #{
            <<"$ref">> => <<"#/definitions/CustomerParams">>
          }
        } ],
        <<"responses">> => #{
          <<"201">> => #{
            <<"description">> => <<"Плательщик создан">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/CustomerAndToken">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Ошибочные данные плательщика">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/inline_response_400">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"409">> => #{
            <<"description">> => <<"Переданное значение `externalID` уже использовалось вами ранее с другими параметрами запроса">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/ExternalIDConflictError">>
            }
          }
        }
      }
    },
    <<"/processing/customers/{customerID}">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Customers">> ],
        <<"description">> => <<"Получить данные плательщика по его идентификатору.">>,
        <<"operationId">> => <<"getCustomerById">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"customerID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор кастомера">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Данные плательщика">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/Customer">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      },
      <<"delete">> => #{
        <<"tags">> => [ <<"Customers">> ],
        <<"description">> => <<"Удалить плательщика по его идентификатору">>,
        <<"operationId">> => <<"deleteCustomer">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"customerID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор кастомера">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"204">> => #{
            <<"description">> => <<"Плательщик удален">>
          },
          <<"400">> => #{
            <<"description">> => <<"Ошибка удаления плательщика">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/inline_response_400_1">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/customers/{customerID}/access-tokens">> => #{
      <<"post">> => #{
        <<"tags">> => [ <<"Customers">> ],
        <<"description">> => <<"Создать новый токен для доступа к указанному плательщику.\n">>,
        <<"operationId">> => <<"createCustomerAccessToken">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"customerID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор кастомера">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"201">> => #{
            <<"description">> => <<"Токен для доступа создан">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/AccessToken">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/customers/{customerID}/bindings">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Customers">> ],
        <<"description">> => <<"Получить все привязки к плательщику.">>,
        <<"operationId">> => <<"getBindings">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"customerID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор кастомера">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Список привязок">>,
            <<"schema">> => #{
              <<"type">> => <<"array">>,
              <<"items">> => #{
                <<"$ref">> => <<"#/definitions/CustomerBinding">>
              }
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      },
      <<"post">> => #{
        <<"tags">> => [ <<"Customers">> ],
        <<"description">> => <<"Запустить новую привязку к плательшику.">>,
        <<"operationId">> => <<"createBinding">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"customerID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор кастомера">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"in">> => <<"body">>,
          <<"name">> => <<"bindingParams">>,
          <<"description">> => <<"Параметры создаваемой привязки">>,
          <<"required">> => true,
          <<"schema">> => #{
            <<"$ref">> => <<"#/definitions/CustomerBindingParams">>
          }
        } ],
        <<"responses">> => #{
          <<"201">> => #{
            <<"description">> => <<"Привязка запущена">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/CustomerBinding">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Ошибочные данные для привязки">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/inline_response_400_2">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          },
          <<"409">> => #{
            <<"description">> => <<"Переданное значение `externalID` уже использовалось вами ранее с другими параметрами запроса">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/ExternalIDConflictError">>
            }
          }
        }
      }
    },
    <<"/processing/customers/{customerID}/bindings/{customerBindingID}">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Customers">> ],
        <<"description">> => <<"Получить информацию о привязке к плательщику.">>,
        <<"operationId">> => <<"getBinding">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"customerID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор кастомера">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"customerBindingID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор привязки к кастомера">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Данные привязки">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/CustomerBinding">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/customers/{customerID}/events">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Customers">> ],
        <<"description">> => <<"Получить историю указанного плательщика в виде набора событий.">>,
        <<"operationId">> => <<"getCustomerEvents">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"customerID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор кастомера">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"limit">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Лимит выборки">>,
          <<"required">> => true,
          <<"type">> => <<"integer">>,
          <<"minimum">> => 1,
          <<"format">> => <<"int32">>
        }, #{
          <<"name">> => <<"eventID">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Идентификатор события.\n\nВсе события, возникшие в системе _после_ указанного, попадут в выборку.\n">>,
          <<"required">> => false,
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int32">>
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Набор событий">>,
            <<"schema">> => #{
              <<"type">> => <<"array">>,
              <<"items">> => #{
                <<"$ref">> => <<"#/definitions/CustomerEvent">>
              }
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/customers/{customerID}/payment-methods">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Customers">> ],
        <<"description">> => <<"Получить доступные для плательщика методы оплаты.">>,
        <<"operationId">> => <<"getCustomerPaymentMethods">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"customerID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор кастомера">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Список методов оплаты">>,
            <<"schema">> => #{
              <<"type">> => <<"array">>,
              <<"items">> => #{
                <<"$ref">> => <<"#/definitions/PaymentMethod">>
              }
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/invoice-templates">> => #{
      <<"post">> => #{
        <<"tags">> => [ <<"InvoiceTemplates">> ],
        <<"description">> => <<"Создать новый шаблон инвойса.">>,
        <<"operationId">> => <<"createInvoiceTemplate">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"in">> => <<"body">>,
          <<"name">> => <<"invoiceTemplateCreateParams">>,
          <<"description">> => <<"Параметры шаблона инвойса.">>,
          <<"required">> => true,
          <<"schema">> => #{
            <<"$ref">> => <<"#/definitions/InvoiceTemplateCreateParams">>
          }
        } ],
        <<"responses">> => #{
          <<"201">> => #{
            <<"description">> => <<"Шаблон инвойса создан.">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/InvoiceTemplateAndToken">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Ошибочные данные для создания шаблона">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/inline_response_400_3">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"409">> => #{
            <<"description">> => <<"Переданное значение `externalID` уже использовалось вами ранее с другими параметрами запроса">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/ExternalIDConflictError">>
            }
          }
        }
      }
    },
    <<"/processing/invoice-templates/{invoiceTemplateID}">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"InvoiceTemplates">> ],
        <<"description">> => <<"Получить шаблон инвойса по его идентификатору.">>,
        <<"operationId">> => <<"getInvoiceTemplateByID">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"invoiceTemplateID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор шаблона инвойса">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Шаблон инвойса">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/InvoiceTemplate">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      },
      <<"put">> => #{
        <<"tags">> => [ <<"InvoiceTemplates">> ],
        <<"description">> => <<"Модифицировать шаблон инвойса.">>,
        <<"operationId">> => <<"updateInvoiceTemplate">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"invoiceTemplateID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор шаблона инвойса">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"in">> => <<"body">>,
          <<"name">> => <<"invoiceTemplateUpdateParams">>,
          <<"description">> => <<"Параметры модифицируемого инвойса.">>,
          <<"required">> => true,
          <<"schema">> => #{
            <<"$ref">> => <<"#/definitions/InvoiceTemplateUpdateParams">>
          }
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Шаблон инвойса модифицирован.">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/InvoiceTemplate">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Ошибочные данные для изменения шаблона">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/inline_response_400_4">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      },
      <<"delete">> => #{
        <<"tags">> => [ <<"InvoiceTemplates">> ],
        <<"description">> => <<"Удалить шаблон инвойса.">>,
        <<"operationId">> => <<"deleteInvoiceTemplate">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"invoiceTemplateID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор шаблона инвойса">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"204">> => #{
            <<"description">> => <<"Шаблон инвойса удален.">>
          },
          <<"400">> => #{
            <<"description">> => <<"Ошибочные данные для удаления шаблона">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/inline_response_400_1">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/invoice-templates/{invoiceTemplateID}/invoices">> => #{
      <<"post">> => #{
        <<"tags">> => [ <<"InvoiceTemplates">> ],
        <<"description">> => <<"Создать новый инвойс по шаблону.">>,
        <<"operationId">> => <<"createInvoiceWithTemplate">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"invoiceTemplateID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор шаблона инвойса">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"in">> => <<"body">>,
          <<"name">> => <<"invoiceParamsWithTemplate">>,
          <<"description">> => <<"Параметры создаваемого инвойса">>,
          <<"required">> => true,
          <<"schema">> => #{
            <<"$ref">> => <<"#/definitions/InvoiceParamsWithTemplate">>
          }
        } ],
        <<"responses">> => #{
          <<"201">> => #{
            <<"description">> => <<"Инвойс создан">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/InvoiceAndToken">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Ошибочные данные для создания инвойса">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/inline_response_400_5">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          },
          <<"409">> => #{
            <<"description">> => <<"Переданное значение `externalID` уже использовалось вами ранее с другими параметрами запроса">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/ExternalIDConflictError">>
            }
          }
        }
      }
    },
    <<"/processing/invoice-templates/{invoiceTemplateID}/payment-methods">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"InvoiceTemplates">> ],
        <<"description">> => <<"Получить доступные для инвойса методы оплаты по шаблону инвойса.">>,
        <<"operationId">> => <<"getInvoicePaymentMethodsByTemplateID">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"invoiceTemplateID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор шаблона инвойса">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Список методов оплаты">>,
            <<"schema">> => #{
              <<"type">> => <<"array">>,
              <<"items">> => #{
                <<"$ref">> => <<"#/definitions/PaymentMethod">>
              }
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/invoices">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Invoices">> ],
        <<"description">> => <<"Получить инвойс по указанному внешнему идентификатору.">>,
        <<"operationId">> => <<"getInvoiceByExternalID">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"externalID">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Внешний идентификатор инвойса">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Инвойс">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/Invoice">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      },
      <<"post">> => #{
        <<"tags">> => [ <<"Invoices">> ],
        <<"description">> => <<"Создать новый инвойс.">>,
        <<"operationId">> => <<"createInvoice">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"in">> => <<"body">>,
          <<"name">> => <<"invoiceParams">>,
          <<"description">> => <<"Параметры создаваемого инвойса">>,
          <<"required">> => true,
          <<"schema">> => #{
            <<"$ref">> => <<"#/definitions/InvoiceParams">>
          }
        } ],
        <<"responses">> => #{
          <<"201">> => #{
            <<"description">> => <<"Инвойс создан">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/InvoiceAndToken">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Ошибочные данные для создания инвойса">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/inline_response_400_6">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"409">> => #{
            <<"description">> => <<"Переданное значение `externalID` уже использовалось вами ранее с другими параметрами запроса">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/ExternalIDConflictError">>
            }
          }
        }
      }
    },
    <<"/processing/invoices/{invoiceID}">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Invoices">> ],
        <<"description">> => <<"Получить данные инвойса по его идентификатору.">>,
        <<"operationId">> => <<"getInvoiceByID">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"invoiceID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор инвойса">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Данные инвойса">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/Invoice">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/invoices/{invoiceID}/access-tokens">> => #{
      <<"post">> => #{
        <<"tags">> => [ <<"Invoices">> ],
        <<"description">> => <<"Создать новый токен для доступа к указанному инвойсу.">>,
        <<"operationId">> => <<"createInvoiceAccessToken">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"invoiceID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор инвойса">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"201">> => #{
            <<"description">> => <<"Токен для доступа к инвойсу создан.">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/AccessToken">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/invoices/{invoiceID}/events">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Invoices">> ],
        <<"description">> => <<"Получить историю указанного инвойса в виде набора событий.">>,
        <<"operationId">> => <<"getInvoiceEvents">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"invoiceID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор инвойса">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"limit">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Лимит выборки">>,
          <<"required">> => true,
          <<"type">> => <<"integer">>,
          <<"minimum">> => 1,
          <<"format">> => <<"int32">>
        }, #{
          <<"name">> => <<"eventID">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Идентификатор события.\n\nВсе события, возникшие в системе _после_ указанного, попадут в выборку.\n">>,
          <<"required">> => false,
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int32">>
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Набор событий">>,
            <<"schema">> => #{
              <<"type">> => <<"array">>,
              <<"items">> => #{
                <<"$ref">> => <<"#/definitions/InvoiceEvent">>
              }
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/invoices/{invoiceID}/fulfill">> => #{
      <<"post">> => #{
        <<"tags">> => [ <<"Invoices">> ],
        <<"description">> => <<"Погасить указанный инвойс.">>,
        <<"operationId">> => <<"fulfillInvoice">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"invoiceID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор инвойса">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"in">> => <<"body">>,
          <<"name">> => <<"fulfillInvoice">>,
          <<"description">> => <<"Произвольная причина совершения операции">>,
          <<"required">> => true,
          <<"schema">> => #{
            <<"$ref">> => <<"#/definitions/Reason">>
          }
        } ],
        <<"responses">> => #{
          <<"204">> => #{
            <<"description">> => <<"Инвойс погашен">>
          },
          <<"400">> => #{
            <<"description">> => <<"Ошибка погашения инвойса">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/inline_response_400_7">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/invoices/{invoiceID}/payment-methods">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Invoices">> ],
        <<"description">> => <<"Получить доступные для инвойса методы оплаты.">>,
        <<"operationId">> => <<"getInvoicePaymentMethods">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"invoiceID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор инвойса">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Список методов оплаты">>,
            <<"schema">> => #{
              <<"type">> => <<"array">>,
              <<"items">> => #{
                <<"$ref">> => <<"#/definitions/PaymentMethod">>
              }
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/invoices/{invoiceID}/payments">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Payments">> ],
        <<"description">> => <<"Получить все платежи по указанному инвойсу.">>,
        <<"operationId">> => <<"getPayments">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"invoiceID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор инвойса">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Данные платежей по инвойсу">>,
            <<"schema">> => #{
              <<"type">> => <<"array">>,
              <<"items">> => #{
                <<"$ref">> => <<"#/definitions/Payment">>
              }
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      },
      <<"post">> => #{
        <<"tags">> => [ <<"Payments">> ],
        <<"description">> => <<"Создать новый платеж по указанному инвойсу.">>,
        <<"operationId">> => <<"createPayment">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"invoiceID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор инвойса">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"in">> => <<"body">>,
          <<"name">> => <<"paymentParams">>,
          <<"description">> => <<"Параметры создаваемого платежа">>,
          <<"required">> => true,
          <<"schema">> => #{
            <<"$ref">> => <<"#/definitions/PaymentParams">>
          }
        } ],
        <<"responses">> => #{
          <<"201">> => #{
            <<"description">> => <<"Платёж создан">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/Payment">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Ошибочные данные для запуска платежа">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/inline_response_400_8">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          },
          <<"409">> => #{
            <<"description">> => <<"Переданное значение `externalID` уже использовалось вами ранее с другими параметрами запроса">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/ExternalIDConflictError">>
            }
          }
        }
      }
    },
    <<"/processing/invoices/{invoiceID}/payments/{paymentID}">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Payments">> ],
        <<"description">> => <<"Получить данные платежа по указанному инвойсу.">>,
        <<"operationId">> => <<"getPaymentByID">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"invoiceID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор инвойса">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"paymentID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор платежа в рамках инвойса">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Данные платежа">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/Payment">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/invoices/{invoiceID}/payments/{paymentID}/cancel">> => #{
      <<"post">> => #{
        <<"tags">> => [ <<"Payments">> ],
        <<"description">> => <<"Отменить указанный платеж.">>,
        <<"operationId">> => <<"cancelPayment">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"invoiceID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор инвойса">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"paymentID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор платежа в рамках инвойса">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"in">> => <<"body">>,
          <<"name">> => <<"cancelPayment">>,
          <<"description">> => <<"Произвольная причина совершения операции">>,
          <<"required">> => true,
          <<"schema">> => #{
            <<"$ref">> => <<"#/definitions/Reason">>
          }
        } ],
        <<"responses">> => #{
          <<"202">> => #{
            <<"description">> => <<"Запрос на отмену платежа принят">>
          },
          <<"400">> => #{
            <<"description">> => <<"Ошибка отмены платежа">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/inline_response_400_9">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/invoices/{invoiceID}/payments/{paymentID}/capture">> => #{
      <<"post">> => #{
        <<"tags">> => [ <<"Payments">> ],
        <<"description">> => <<"Подтвердить указанный платеж. В случае передачи суммы подтверждения, меньшей, чем оригинальная, оставшаяся часть платежа будет возвращена.(см. [Варианты проведения оплаты](#tag/Payments))\n">>,
        <<"operationId">> => <<"capturePayment">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"invoiceID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор инвойса">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"paymentID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор платежа в рамках инвойса">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"in">> => <<"body">>,
          <<"name">> => <<"capturePayment">>,
          <<"description">> => <<"Параметры подтверждения платежа">>,
          <<"required">> => true,
          <<"schema">> => #{
            <<"$ref">> => <<"#/definitions/CaptureParams">>
          }
        } ],
        <<"responses">> => #{
          <<"202">> => #{
            <<"description">> => <<"Запрос на подтверждение платежа принят">>
          },
          <<"400">> => #{
            <<"description">> => <<"Ошибка подтверждения платежа">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/inline_response_400_10">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/invoices/{invoiceID}/payments/{paymentID}/chargebacks">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Payments">> ],
        <<"description">> => <<"Получить все чарджбэки по указанному платежу.">>,
        <<"operationId">> => <<"getChargebacks">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"invoiceID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор инвойса">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"paymentID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор платежа в рамках инвойса">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Данные чарджбэков по платежу">>,
            <<"schema">> => #{
              <<"type">> => <<"array">>,
              <<"items">> => #{
                <<"$ref">> => <<"#/definitions/Chargeback">>
              }
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/invoices/{invoiceID}/payments/{paymentID}/chargebacks/{chargebackID}">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Payments">> ],
        <<"description">> => <<"Получить данные определённого чарджбэка для указанного платежа.">>,
        <<"operationId">> => <<"getChargebackByID">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"invoiceID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор инвойса">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"paymentID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор платежа в рамках инвойса">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"chargebackID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор возвратного платежа в рамках платежа">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Данные чарджбэка">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/Chargeback">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/invoices/{invoiceID}/payments/{paymentID}/refunds">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Payments">> ],
        <<"description">> => <<"Получить все возвраты указанного платежа.">>,
        <<"operationId">> => <<"getRefunds">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"invoiceID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор инвойса">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"paymentID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор платежа в рамках инвойса">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Данные возвратов по платежу">>,
            <<"schema">> => #{
              <<"type">> => <<"array">>,
              <<"items">> => #{
                <<"$ref">> => <<"#/definitions/Refund">>
              }
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      },
      <<"post">> => #{
        <<"tags">> => [ <<"Payments">> ],
        <<"description">> => <<"Создать возврат указанного платежа">>,
        <<"operationId">> => <<"createRefund">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"invoiceID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор инвойса">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"paymentID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор платежа в рамках инвойса">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"in">> => <<"body">>,
          <<"name">> => <<"refundParams">>,
          <<"description">> => <<"Параметры создаваемого возврата платежа">>,
          <<"required">> => true,
          <<"schema">> => #{
            <<"$ref">> => <<"#/definitions/RefundParams">>
          }
        } ],
        <<"responses">> => #{
          <<"201">> => #{
            <<"description">> => <<"Возврат создан">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/Refund">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Ошибочные данные для возврата">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/inline_response_400_11">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          },
          <<"409">> => #{
            <<"description">> => <<"Переданное значение `externalID` уже использовалось вами ранее с другими параметрами запроса">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/ExternalIDConflictError">>
            }
          }
        }
      }
    },
    <<"/processing/invoices/{invoiceID}/payments/{paymentID}/refunds/{refundID}">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Payments">> ],
        <<"description">> => <<"Получить данные определённого возврата указанного платежа.">>,
        <<"operationId">> => <<"getRefundByID">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"invoiceID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор инвойса">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"paymentID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор платежа в рамках инвойса">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"refundID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор возврата в рамках платежа">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Данные возврата">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/Refund">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/invoices/{invoiceID}/rescind">> => #{
      <<"post">> => #{
        <<"tags">> => [ <<"Invoices">> ],
        <<"description">> => <<"Перевести инвойс в состояние \"Отменен\" со статусом \"Аннулирован\".">>,
        <<"operationId">> => <<"rescindInvoice">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"invoiceID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор инвойса">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"in">> => <<"body">>,
          <<"name">> => <<"rescindInvoice">>,
          <<"description">> => <<"Произвольная причина совершения операции">>,
          <<"required">> => true,
          <<"schema">> => #{
            <<"$ref">> => <<"#/definitions/Reason">>
          }
        } ],
        <<"responses">> => #{
          <<"204">> => #{
            <<"description">> => <<"Инвойс аннулирован">>
          },
          <<"400">> => #{
            <<"description">> => <<"Ошибка отмены инвойса">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/inline_response_400_12">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/me">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Parties">> ],
        <<"operationId">> => <<"getMyParty">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Get my party">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/Party">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          }
        }
      }
    },
    <<"/processing/me/activate">> => #{
      <<"put">> => #{
        <<"tags">> => [ <<"Parties">> ],
        <<"description">> => <<"Activate my party">>,
        <<"operationId">> => <<"activateMyParty">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"204">> => #{
            <<"description">> => <<"Party activated">>
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          }
        }
      }
    },
    <<"/processing/me/suspend">> => #{
      <<"put">> => #{
        <<"tags">> => [ <<"Parties">> ],
        <<"description">> => <<"Suspend my party">>,
        <<"operationId">> => <<"suspendMyParty">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"204">> => #{
            <<"description">> => <<"Party suspended">>
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          }
        }
      }
    },
    <<"/processing/parties/{partyID}">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Parties">> ],
        <<"operationId">> => <<"getPartyByID">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"partyID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Уникальный в рамках системы идентификатор участника.">>,
          <<"required">> => true,
          <<"type">> => <<"string">>
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Party">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/Party">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/parties/{partyID}/activate">> => #{
      <<"put">> => #{
        <<"tags">> => [ <<"Parties">> ],
        <<"description">> => <<"Activate party by ID">>,
        <<"operationId">> => <<"activatePartyByID">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"partyID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Уникальный в рамках системы идентификатор участника.">>,
          <<"required">> => true,
          <<"type">> => <<"string">>
        } ],
        <<"responses">> => #{
          <<"204">> => #{
            <<"description">> => <<"Party activated">>
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/parties/{partyID}/contracts">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Contracts">> ],
        <<"description">> => <<"Получить данные всех договоров участника">>,
        <<"operationId">> => <<"getContractsForParty">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"partyID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Уникальный в рамках системы идентификатор участника.">>,
          <<"required">> => true,
          <<"type">> => <<"string">>
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"List of contracts">>,
            <<"schema">> => #{
              <<"type">> => <<"array">>,
              <<"items">> => #{
                <<"$ref">> => <<"#/definitions/Contract">>
              }
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/parties/{partyID}/contracts/{contractID}">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Contracts">> ],
        <<"description">> => <<"Получить данные договора по его ID">>,
        <<"operationId">> => <<"getContractByIDForParty">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"contractID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор договора">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"partyID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Уникальный в рамках системы идентификатор участника.">>,
          <<"required">> => true,
          <<"type">> => <<"string">>
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Contract found">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/Contract">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/parties/{partyID}/contracts/{contractID}/adjustments">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Contracts">> ],
        <<"description">> => <<"Получить данные всех поправок к указанному договору">>,
        <<"operationId">> => <<"getContractAdjustmentsForParty">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"contractID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор договора">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"partyID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Уникальный в рамках системы идентификатор участника.">>,
          <<"required">> => true,
          <<"type">> => <<"string">>
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Набор поправок к договору">>,
            <<"schema">> => #{
              <<"type">> => <<"array">>,
              <<"items">> => #{
                <<"$ref">> => <<"#/definitions/ContractAdjustment">>
              }
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/parties/{partyID}/contracts/{contractID}/adjustments/{adjustmentID}">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Contracts">> ],
        <<"description">> => <<"Получить данные поправки к договору по её идентификатору">>,
        <<"operationId">> => <<"getContractAdjustmentByIDForParty">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"contractID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор договора">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"adjustmentID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор поправки к договору">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"partyID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Уникальный в рамках системы идентификатор участника.">>,
          <<"required">> => true,
          <<"type">> => <<"string">>
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Данные поправки к договору">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/ContractAdjustment">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/parties/{partyID}/contracts/{contractID}/payout_tools">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Payouts">> ],
        <<"description">> => <<"Получить данные всех средств вывода">>,
        <<"operationId">> => <<"getPayoutToolsForParty">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"contractID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор договора">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"partyID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Уникальный в рамках системы идентификатор участника.">>,
          <<"required">> => true,
          <<"type">> => <<"string">>
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Набор средств вывода">>,
            <<"schema">> => #{
              <<"type">> => <<"array">>,
              <<"items">> => #{
                <<"$ref">> => <<"#/definitions/PayoutTool">>
              }
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/parties/{partyID}/contracts/{contractID}/payout_tools/{payoutToolID}">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Payouts">> ],
        <<"description">> => <<"Получить данные средства вывода по его идентификатору">>,
        <<"operationId">> => <<"getPayoutToolByIDForParty">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"contractID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор договора">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"payoutToolID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор средства вывода">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"partyID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Уникальный в рамках системы идентификатор участника.">>,
          <<"required">> => true,
          <<"type">> => <<"string">>
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Данные средства вывода">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/PayoutTool">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/parties/{partyID}/invoices">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Invoices">> ],
        <<"description">> => <<"Получить инвойс участника по указанному внешнему идентификатору.">>,
        <<"operationId">> => <<"getInvoiceByExternalIDForParty">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"partyID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Уникальный в рамках системы идентификатор участника.">>,
          <<"required">> => true,
          <<"type">> => <<"string">>
        }, #{
          <<"name">> => <<"externalID">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Внешний идентификатор инвойса">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Инвойс">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/Invoice">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/parties/{partyID}/payment-institutions/{paymentInstitutionID}/terms/payouts/methods">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"PaymentInstitutions">> ],
        <<"description">> => <<"Получить cпособы вывода средств для платёжной организации участника">>,
        <<"operationId">> => <<"getPaymentInstitutionPayoutMethodsForParty">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"partyID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Уникальный в рамках системы идентификатор участника.">>,
          <<"required">> => true,
          <<"type">> => <<"string">>
        }, #{
          <<"name">> => <<"paymentInstitutionID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Payment institution reference">>,
          <<"required">> => true,
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int32">>
        }, #{
          <<"name">> => <<"currency">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Валюта, символьный код согласно [ISO 4217](http://www.iso.org/iso/home/standards/currency_codes.htm).">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"pattern">> => <<"^[A-Z]{3}$">>
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Способ вывода средств">>,
            <<"schema">> => #{
              <<"type">> => <<"array">>,
              <<"items">> => #{
                <<"type">> => <<"string">>,
                <<"enum">> => [ <<"BankAccount">>, <<"InternationalBankAccount">>, <<"Wallet">>, <<"PaymentInstitutionAccount">> ]
              }
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/parties/{partyID}/payment-institutions/{paymentInstitutionID}/terms/payouts/schedules">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"PaymentInstitutions">> ],
        <<"description">> => <<"Получить доступные расписания вывода средств для платёжной организации участника">>,
        <<"operationId">> => <<"getPaymentInstitutionPayoutSchedulesForParty">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"partyID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Уникальный в рамках системы идентификатор участника.">>,
          <<"required">> => true,
          <<"type">> => <<"string">>
        }, #{
          <<"name">> => <<"paymentInstitutionID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Payment institution reference">>,
          <<"required">> => true,
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int32">>
        }, #{
          <<"name">> => <<"currency">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Валюта, символьный код согласно [ISO 4217](http://www.iso.org/iso/home/standards/currency_codes.htm).">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"pattern">> => <<"^[A-Z]{3}$">>
        }, #{
          <<"name">> => <<"payoutMethod">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Способ вывода средств">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"enum">> => [ <<"BankAccount">>, <<"InternationalBankAccount">>, <<"Wallet">> ]
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Идентификаторы расписаний выводов">>,
            <<"schema">> => #{
              <<"type">> => <<"array">>,
              <<"items">> => #{
                <<"type">> => <<"integer">>,
                <<"format">> => <<"int32">>
              }
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/parties/{partyID}/payments">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Payments">> ],
        <<"description">> => <<"Получить платёж по указанному внешнему идентификатору для участника.">>,
        <<"operationId">> => <<"getPaymentByExternalIDForParty">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"partyID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Уникальный в рамках системы идентификатор участника.">>,
          <<"required">> => true,
          <<"type">> => <<"string">>
        }, #{
          <<"name">> => <<"externalID">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Внешний идентификатор платежа">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Платёж">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/Payment">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/parties/{partyID}/refunds">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Payments">> ],
        <<"description">> => <<"Получить возврат по указанному внешнему идентификатору для участника.">>,
        <<"operationId">> => <<"getRefundByExternalIDForParty">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"partyID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Уникальный в рамках системы идентификатор участника.">>,
          <<"required">> => true,
          <<"type">> => <<"string">>
        }, #{
          <<"name">> => <<"externalID">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Внешний идентификатор возврата">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Данные возврата">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/Refund">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/parties/{partyID}/shops">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Shops">> ],
        <<"description">> => <<"Get all shops">>,
        <<"operationId">> => <<"getShopsForParty">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"partyID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Уникальный в рамках системы идентификатор участника.">>,
          <<"required">> => true,
          <<"type">> => <<"string">>
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"List of shops">>,
            <<"schema">> => #{
              <<"type">> => <<"array">>,
              <<"items">> => #{
                <<"$ref">> => <<"#/definitions/Shop">>
              }
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/parties/{partyID}/shops/{shopID}">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Shops">> ],
        <<"description">> => <<"Get shop by id">>,
        <<"operationId">> => <<"getShopByIDForParty">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"shopID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор магазина">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"partyID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Уникальный в рамках системы идентификатор участника.">>,
          <<"required">> => true,
          <<"type">> => <<"string">>
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Shop found">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/Shop">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/parties/{partyID}/shops/{shopID}/activate">> => #{
      <<"put">> => #{
        <<"tags">> => [ <<"Shops">> ],
        <<"description">> => <<"Activate shop">>,
        <<"operationId">> => <<"activateShopForParty">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"shopID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор магазина">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"partyID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Уникальный в рамках системы идентификатор участника.">>,
          <<"required">> => true,
          <<"type">> => <<"string">>
        } ],
        <<"responses">> => #{
          <<"204">> => #{
            <<"description">> => <<"Shop activated">>
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/parties/{partyID}/shops/{shopID}/suspend">> => #{
      <<"put">> => #{
        <<"tags">> => [ <<"Shops">> ],
        <<"description">> => <<"Приостановить действие магазина. Этот тип заявок обрабатывается платформой\nавтоматически и исполняется сразу же после отправки.\n">>,
        <<"operationId">> => <<"suspendShopForParty">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"shopID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор магазина">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"partyID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Уникальный в рамках системы идентификатор участника.">>,
          <<"required">> => true,
          <<"type">> => <<"string">>
        } ],
        <<"responses">> => #{
          <<"204">> => #{
            <<"description">> => <<"Shop suspended">>
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/parties/{partyID}/suspend">> => #{
      <<"put">> => #{
        <<"tags">> => [ <<"Parties">> ],
        <<"description">> => <<"Suspend party by ID">>,
        <<"operationId">> => <<"suspendPartyByID">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"partyID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Уникальный в рамках системы идентификатор участника.">>,
          <<"required">> => true,
          <<"type">> => <<"string">>
        } ],
        <<"responses">> => #{
          <<"204">> => #{
            <<"description">> => <<"Party suspended">>
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/payment-institutions">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"PaymentInstitutions">> ],
        <<"description">> => <<"Получить список платёжных организаций">>,
        <<"operationId">> => <<"getPaymentInstitutions">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"residence">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Резиденция, alpha-3 код по стандарту [ISO 3166-1](https://en.wikipedia.org/wiki/ISO_3166-1)">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"pattern">> => <<"^[A-Z]{3}$">>
        }, #{
          <<"name">> => <<"realm">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Режим рабочего окружения платежной организации">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"enum">> => [ <<"test">>, <<"live">> ]
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"List of payment institutions">>,
            <<"schema">> => #{
              <<"type">> => <<"array">>,
              <<"items">> => #{
                <<"$ref">> => <<"#/definitions/PaymentInstitution">>
              }
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          }
        }
      }
    },
    <<"/processing/payment-institutions/{paymentInstitutionID}">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"PaymentInstitutions">> ],
        <<"description">> => <<"Получить данные платёжной организации по ее ID">>,
        <<"operationId">> => <<"getPaymentInstitutionByRef">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"paymentInstitutionID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Payment institution reference">>,
          <<"required">> => true,
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int32">>
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Payment institution found">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/PaymentInstitution">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/payment-institutions/{paymentInstitutionID}/terms/payments">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"PaymentInstitutions">> ],
        <<"description">> => <<"Получить условия проведения платежей для платёжной организации">>,
        <<"operationId">> => <<"getPaymentInstitutionPaymentTerms">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"paymentInstitutionID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Payment institution reference">>,
          <<"required">> => true,
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int32">>
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Payment institution terms calculated">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/PaymentTerms">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/payment-institutions/{paymentInstitutionID}/terms/payouts/methods">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"PaymentInstitutions">> ],
        <<"description">> => <<"Получить cпособы вывода средств для платёжной организации">>,
        <<"operationId">> => <<"getPaymentInstitutionPayoutMethods">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"paymentInstitutionID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Payment institution reference">>,
          <<"required">> => true,
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int32">>
        }, #{
          <<"name">> => <<"currency">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Валюта, символьный код согласно [ISO 4217](http://www.iso.org/iso/home/standards/currency_codes.htm).">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"pattern">> => <<"^[A-Z]{3}$">>
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Способ вывода средств">>,
            <<"schema">> => #{
              <<"type">> => <<"array">>,
              <<"items">> => #{
                <<"type">> => <<"string">>,
                <<"enum">> => [ <<"BankAccount">>, <<"InternationalBankAccount">>, <<"Wallet">>, <<"PaymentInstitutionAccount">> ]
              }
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/payment-institutions/{paymentInstitutionID}/terms/payouts/schedules">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"PaymentInstitutions">> ],
        <<"description">> => <<"Получить доступные расписания вывода средств для платёжной организации">>,
        <<"operationId">> => <<"getPaymentInstitutionPayoutSchedules">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"paymentInstitutionID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Payment institution reference">>,
          <<"required">> => true,
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int32">>
        }, #{
          <<"name">> => <<"currency">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Валюта, символьный код согласно [ISO 4217](http://www.iso.org/iso/home/standards/currency_codes.htm).">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"pattern">> => <<"^[A-Z]{3}$">>
        }, #{
          <<"name">> => <<"payoutMethod">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Способ вывода средств">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"enum">> => [ <<"BankAccount">>, <<"InternationalBankAccount">>, <<"Wallet">> ]
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Идентификаторы расписаний выводов">>,
            <<"schema">> => #{
              <<"type">> => <<"array">>,
              <<"items">> => #{
                <<"type">> => <<"integer">>,
                <<"format">> => <<"int32">>
              }
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/payment-resources">> => #{
      <<"post">> => #{
        <<"tags">> => [ <<"Tokens">> ],
        <<"description">> => <<"Создать новый одноразовый токен платежного средства, предоставленного плательщиком, а\nтакже новую уникальную платежную сессию.\nТокен платежного средства и идентификатор сессии необходим для создания\nплатежа по инвойсу и имеет ограниченное время жизни.\n">>,
        <<"operationId">> => <<"createPaymentResource">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"in">> => <<"body">>,
          <<"name">> => <<"paymentResource">>,
          <<"description">> => <<"Данные для создания платежного средства">>,
          <<"required">> => true,
          <<"schema">> => #{
            <<"$ref">> => <<"#/definitions/PaymentResourceParams">>
          }
        } ],
        <<"responses">> => #{
          <<"201">> => #{
            <<"description">> => <<"Токен и сессия созданы">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/PaymentResourceResult">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          }
        }
      }
    },
    <<"/processing/payments">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Payments">> ],
        <<"description">> => <<"Получить платёж по указанному внешнему идентификатору.">>,
        <<"operationId">> => <<"getPaymentByExternalID">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"externalID">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Внешний идентификатор платежа">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Платёж">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/Payment">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/payouts">> => #{
      <<"post">> => #{
        <<"tags">> => [ <<"Payouts">> ],
        <<"description">> => <<"Создать новую выплату и отправить её на\nпремодерацию.\n">>,
        <<"operationId">> => <<"createPayout">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"in">> => <<"body">>,
          <<"name">> => <<"payoutParams">>,
          <<"required">> => true,
          <<"schema">> => #{
            <<"$ref">> => <<"#/definitions/PayoutParams">>
          }
        } ],
        <<"responses">> => #{
          <<"201">> => #{
            <<"description">> => <<"Выплата создана">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/Payout">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/inline_response_400_13">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          }
        }
      }
    },
    <<"/processing/payouts/{payoutID}">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Payouts">> ],
        <<"description">> => <<"Получение данных по выплате">>,
        <<"operationId">> => <<"getPayout">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"payoutID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор вывода">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Найдена выплата">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/Payout">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/refunds">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Payments">> ],
        <<"description">> => <<"Получить возврат по указанному внешнему идентификатору.">>,
        <<"operationId">> => <<"getRefundByExternalID">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"externalID">>,
          <<"in">> => <<"query">>,
          <<"description">> => <<"Внешний идентификатор возврата">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Данные возврата">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/Refund">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/schedules/{scheduleID}">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Payouts">> ],
        <<"description">> => <<"Получить данные расписания выводов по ее ID">>,
        <<"operationId">> => <<"getScheduleByRef">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"scheduleID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Schedule reference">>,
          <<"required">> => true,
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int32">>
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Schedule found">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/Schedule">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/service-providers/{serviceProviderID}">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"PaymentInstitutions">> ],
        <<"description">> => <<"Получить данные провайдера платёжных сервисов по его ID">>,
        <<"operationId">> => <<"getServiceProviderByID">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"serviceProviderID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор провайдера платёжных сервисов в системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 100,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Провайдер платёжных сервисов найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/ServiceProvider">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/shops">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Shops">> ],
        <<"description">> => <<"Get all shops">>,
        <<"operationId">> => <<"getShops">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"List of shops">>,
            <<"schema">> => #{
              <<"type">> => <<"array">>,
              <<"items">> => #{
                <<"$ref">> => <<"#/definitions/Shop">>
              }
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          }
        }
      }
    },
    <<"/processing/shops/{shopID}">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Shops">> ],
        <<"description">> => <<"Get shop by id">>,
        <<"operationId">> => <<"getShopByID">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"shopID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор магазина">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Shop found">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/Shop">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/shops/{shopID}/activate">> => #{
      <<"put">> => #{
        <<"tags">> => [ <<"Shops">> ],
        <<"description">> => <<"Activate shop">>,
        <<"operationId">> => <<"activateShop">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"shopID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор магазина">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"204">> => #{
            <<"description">> => <<"Shop activated">>
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/shops/{shopID}/suspend">> => #{
      <<"put">> => #{
        <<"tags">> => [ <<"Shops">> ],
        <<"description">> => <<"Приостановить действие магазина. Этот тип заявок обрабатывается платформой\nавтоматически и исполняется сразу же после отправки.\n">>,
        <<"operationId">> => <<"suspendShop">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"shopID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор магазина">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"204">> => #{
            <<"description">> => <<"Shop suspended">>
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/tradeblocs">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"TradeBlocs">> ],
        <<"description">> => <<"Получить список торговых блоков">>,
        <<"operationId">> => <<"getTradeBlocs">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Список Торговых Блоков">>,
            <<"schema">> => #{
              <<"type">> => <<"array">>,
              <<"items">> => #{
                <<"$ref">> => <<"#/definitions/TradeBloc">>
              }
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          }
        }
      }
    },
    <<"/processing/tradeblocs/{tradeBlocID}">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"TradeBlocs">> ],
        <<"description">> => <<"Получить данные торгового блока по его ID">>,
        <<"operationId">> => <<"getTradeBlocByID">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"tradeBlocID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор торгового блока">>,
          <<"required">> => true,
          <<"type">> => <<"string">>
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Торговый Блок найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/TradeBloc">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    },
    <<"/processing/webhooks">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Webhooks">> ],
        <<"description">> => <<"Получить набор установленных webhook'ов.">>,
        <<"operationId">> => <<"getWebhooks">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Набор webhook'ов">>,
            <<"schema">> => #{
              <<"type">> => <<"array">>,
              <<"items">> => #{
                <<"$ref">> => <<"#/definitions/Webhook">>
              }
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          }
        }
      },
      <<"post">> => #{
        <<"tags">> => [ <<"Webhooks">> ],
        <<"description">> => <<"Установить новый webhook.">>,
        <<"operationId">> => <<"createWebhook">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"in">> => <<"body">>,
          <<"name">> => <<"webhookParams">>,
          <<"description">> => <<"Параметры устанавливаемого webhook'а">>,
          <<"required">> => true,
          <<"schema">> => #{
            <<"$ref">> => <<"#/definitions/Webhook">>
          }
        } ],
        <<"responses">> => #{
          <<"201">> => #{
            <<"description">> => <<"Webhook установлен">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/Webhook">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Ошибочные данные webhook'а">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/inline_response_400_14">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"429">> => #{
            <<"description">> => <<"Превышен лимит количества установленных webhook'ов">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/inline_response_429">>
            }
          }
        }
      }
    },
    <<"/processing/webhooks/{webhookID}">> => #{
      <<"get">> => #{
        <<"tags">> => [ <<"Webhooks">> ],
        <<"description">> => <<"Получить webhook по его идентификатору.">>,
        <<"operationId">> => <<"getWebhookByID">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"webhookID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор webhook'а">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"200">> => #{
            <<"description">> => <<"Данные webhook'а">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/Webhook">>
            }
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      },
      <<"delete">> => #{
        <<"tags">> => [ <<"Webhooks">> ],
        <<"description">> => <<"Снять указанный webhook.">>,
        <<"operationId">> => <<"deleteWebhookByID">>,
        <<"parameters">> => [ #{
          <<"name">> => <<"X-Request-ID">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 32,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"X-Request-Deadline">>,
          <<"in">> => <<"header">>,
          <<"description">> => <<"Максимальное время обработки запроса">>,
          <<"required">> => false,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        }, #{
          <<"name">> => <<"webhookID">>,
          <<"in">> => <<"path">>,
          <<"description">> => <<"Идентификатор webhook'а">>,
          <<"required">> => true,
          <<"type">> => <<"string">>,
          <<"maxLength">> => 40,
          <<"minLength">> => 1
        } ],
        <<"responses">> => #{
          <<"204">> => #{
            <<"description">> => <<"Webhook успешно снят">>
          },
          <<"400">> => #{
            <<"description">> => <<"Неверные данные">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/DefaultLogicError">>
            }
          },
          <<"401">> => #{
            <<"description">> => <<"Ошибка авторизации">>
          },
          <<"404">> => #{
            <<"description">> => <<"Заданный ресурс не найден">>,
            <<"schema">> => #{
              <<"$ref">> => <<"#/definitions/GeneralError">>
            }
          }
        }
      }
    }
  },
  <<"securityDefinitions">> => #{
    <<"bearer">> => #{
      <<"description">> => <<"Взаимодействие между мерчантом и системой осуществляется по защищенному протоколу (HTTPS).\nHTTP-запросы по нешифрованному каналу не поддерживаются.\n\nСодержимое API-ключа следует передать в заголовке `Authorization`:\n\n```\nAuthorization: Bearer MjMyNDQxMjM6NDUzRmRnZDQ0M...\n```\n\nКлючи не разделяются на тестовые и боевые. Для проведения тестовых транзакций используйте\nидентификатор тестового магазина.\n\n**Важно! Не передавайте API-ключ третьим лицам!**\n">>,
      <<"type">> => <<"apiKey">>,
      <<"name">> => <<"Authorization">>,
      <<"in">> => <<"header">>
    }
  },
  <<"definitions">> => #{
    <<"AccessToken">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"payload">> ],
      <<"properties">> => #{
        <<"payload">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Содержимое токена для доступа\n">>
        }
      },
      <<"example">> => #{
        <<"payload">> => <<"payload">>
      }
    },
    <<"Allocation">> => #{
      <<"type">> => <<"array">>,
      <<"description">> => <<"Распределение денежных средств\n">>,
      <<"items">> => #{
        <<"$ref">> => <<"#/definitions/AllocationTransaction">>
      },
      <<"minItems">> => 1,
      <<"maxItems">> => 100
    },
    <<"AllocationBodyAmount">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/AllocationTransaction">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"amount">>, <<"currency">> ],
        <<"properties">> => #{
          <<"amount">> => #{
            <<"type">> => <<"integer">>,
            <<"format">> => <<"int64">>,
            <<"description">> => <<"Сумма перечисляемая выбранному назначению в минорных денежных единицах,\nнапример в копейках в случае указания российских рублей в качестве валюты.\n">>,
            <<"minimum">> => 1
          },
          <<"currency">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Валюта, символьный код согласно [ISO 4217](http://www.iso.org/iso/home/standards/currency_codes.htm).">>,
            <<"pattern">> => <<"^[A-Z]{3}$">>
          }
        }
      } ],
      <<"description">> => <<"Тело транзакции в абсолютных значениях">>
    },
    <<"AllocationBodyTotal">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/AllocationTransaction">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"currency">>, <<"fee">>, <<"total">> ],
        <<"properties">> => #{
          <<"total">> => #{
            <<"type">> => <<"integer">>,
            <<"format">> => <<"int64">>,
            <<"description">> => <<"Общая сумма транзакции (включает в себя комиссию) в минорных денежных единицах, например в копейках в случае указания российских рублей в качестве валюты.\n">>,
            <<"minimum">> => 1
          },
          <<"amount">> => #{
            <<"type">> => <<"integer">>,
            <<"format">> => <<"int64">>,
            <<"description">> => <<"Сумма перечисляемая выбранному назначению в минорных денежных единицах,\nнапример в копейках в случае указания российских рублей в качестве валюты.\n">>,
            <<"readOnly">> => true,
            <<"minimum">> => 1
          },
          <<"currency">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Валюта, символьный код согласно [ISO 4217](http://www.iso.org/iso/home/standards/currency_codes.htm).">>,
            <<"pattern">> => <<"^[A-Z]{3}$">>
          },
          <<"fee">> => #{
            <<"$ref">> => <<"#/definitions/AllocationFee">>
          }
        }
      } ],
      <<"description">> => <<"Тело транзакции с указанием комиссии">>
    },
    <<"AllocationFee">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"allocationFeeType">> ],
      <<"discriminator">> => <<"allocationFeeType">>,
      <<"properties">> => #{
        <<"target">> => #{
          <<"$ref">> => <<"#/definitions/AllocationFee_target">>
        },
        <<"allocationFeeType">> => #{
          <<"type">> => <<"string">>,
          <<"enum">> => [ <<"AllocationFeeFixed">>, <<"AllocationFeeShare">> ]
        }
      },
      <<"description">> => <<"Комиссия транзакции">>,
      <<"x-discriminator-is-enum">> => true
    },
    <<"AllocationFeeFixed">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/AllocationFee">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"amount">> ],
        <<"properties">> => #{
          <<"amount">> => #{
            <<"type">> => <<"integer">>,
            <<"format">> => <<"int64">>,
            <<"description">> => <<"Значение комиссии в минорных денежных единицах, например в копейках в случае указания российских рублей в качестве валюты транзакции.\n">>,
            <<"minimum">> => 1
          }
        }
      } ],
      <<"description">> => <<"Комиссия транзакции в абсолютных значениях">>
    },
    <<"AllocationFeeShare">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/AllocationFee">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"share">> ],
        <<"properties">> => #{
          <<"share">> => #{
            <<"$ref">> => <<"#/definitions/Decimal">>
          },
          <<"amount">> => #{
            <<"type">> => <<"integer">>,
            <<"format">> => <<"int64">>,
            <<"description">> => <<"Значение комиссии в минорных денежных единицах, например в копейках в случае указания российских рублей в качестве валюты транзакции.\n">>,
            <<"readOnly">> => true,
            <<"minimum">> => 1
          }
        }
      } ],
      <<"description">> => <<"Комиссия транзакции в относительных значениях">>
    },
    <<"AllocationTarget">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"allocationTargetType">> ],
      <<"discriminator">> => <<"allocationTargetType">>,
      <<"properties">> => #{
        <<"allocationTargetType">> => #{
          <<"type">> => <<"string">>,
          <<"enum">> => [ <<"AllocationTargetShop">> ]
        }
      },
      <<"description">> => <<"Назначение транзакции">>,
      <<"example">> => #{
        <<"allocationTargetType">> => <<"AllocationTargetShop">>
      },
      <<"x-discriminator-is-enum">> => true
    },
    <<"AllocationTargetShop">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/AllocationTarget">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"shopID">> ],
        <<"properties">> => #{
          <<"shopID">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Идентификатор магазина">>,
            <<"minLength">> => 1,
            <<"maxLength">> => 40
          }
        }
      } ],
      <<"description">> => <<"Магазин как назначение транзакции">>
    },
    <<"AllocationTransaction">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"allocationBodyType">>, <<"target">> ],
      <<"discriminator">> => <<"allocationBodyType">>,
      <<"properties">> => #{
        <<"target">> => #{
          <<"$ref">> => <<"#/definitions/AllocationTarget">>
        },
        <<"allocationBodyType">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Тело транзакции">>,
          <<"enum">> => [ <<"AllocationBodyAmount">>, <<"AllocationBodyTotal">> ]
        },
        <<"cart">> => #{
          <<"$ref">> => <<"#/definitions/InvoiceCart">>
        }
      },
      <<"description">> => <<"Транзакция распределения денежных средств">>,
      <<"example">> => #{
        <<"allocationBodyType">> => <<"AllocationBodyAmount">>,
        <<"cart">> => <<"">>,
        <<"target">> => #{
          <<"allocationTargetType">> => <<"AllocationTargetShop">>
        }
      },
      <<"x-discriminator-is-enum">> => true
    },
    <<"ApplePay">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/TokenizedCardData">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"merchantID">>, <<"paymentToken">> ],
        <<"properties">> => #{
          <<"merchantID">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Идентификатор мерчанта в Apple Pay">>
          },
          <<"paymentToken">> => #{
            <<"type">> => <<"object">>,
            <<"description">> => <<"Совокупность открытых и зашифрованных платежных данных">>,
            <<"properties">> => #{ }
          }
        },
        <<"description">> => <<"Платежные данные Apple Pay">>
      } ]
    },
    <<"ArticlesOfAssociation">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/RepresentativeDocument">>
      }, #{ } ],
      <<"description">> => <<"Устав организации">>
    },
    <<"BankAccount">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"account">>, <<"bankBik">>, <<"bankName">>, <<"bankPostAccount">> ],
      <<"properties">> => #{
        <<"account">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Номер счёта">>,
          <<"pattern">> => <<"^\\d{20}$">>
        },
        <<"bankName">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Наименование юридического лица банковской организации">>,
          <<"maxLength">> => 100
        },
        <<"bankPostAccount">> => #{
          <<"type">> => <<"string">>,
          <<"pattern">> => <<"^\\d{20}$">>
        },
        <<"bankBik">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"БИК банковской организации">>,
          <<"pattern">> => <<"^\\d{9}$">>
        }
      },
      <<"description">> => <<"Данные расчётного счёта в банковской организации, ведущей деятельность под\nюрисдикцией РФ.\n">>
    },
    <<"BankCard">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/PaymentMethod">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"paymentSystems">> ],
        <<"properties">> => #{
          <<"paymentSystems">> => #{
            <<"type">> => <<"array">>,
            <<"description">> => <<"Список платежных систем">>,
            <<"items">> => #{
              <<"type">> => <<"string">>,
              <<"description">> => <<"Платежная система.\n\nНабор систем, доступных для проведения платежей, можно узнать, вызвав соответствующую [операцию](#operation/getInvoicePaymentMethods) после создания инвойса.\n">>
            }
          },
          <<"tokenProviders">> => #{
            <<"type">> => <<"array">>,
            <<"description">> => <<"Список провайдеров платежных токенов">>,
            <<"items">> => #{
              <<"type">> => <<"string">>,
              <<"description">> => <<"Провайдер платежных токенов.\n\nНабор провайдеров, доступных для проведения платежей, можно узнать, вызвав соответствующую [операцию](#operation/getInvoicePaymentMethods) после создания инвойса.\n">>
            }
          },
          <<"tokenProviderData">> => #{
            <<"$ref">> => <<"#/definitions/BankCard_tokenProviderData">>
          }
        }
      } ]
    },
    <<"BankCardDetails">> => #{
      <<"required">> => [ <<"cardNumberMask">>, <<"paymentSystem">> ],
      <<"properties">> => #{
        <<"cardNumberMask">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Маскированый номер карты">>,
          <<"pattern">> => <<"^\\d{0,6}\\*+\\d{0,4}$">>
        },
        <<"first6">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Первые цифры номера карты.\n\nОтсутствуют для токенизированных платежных средств.\n">>,
          <<"pattern">> => <<"^\\d{6}$">>
        },
        <<"last4">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Последние цифры номера карты">>,
          <<"pattern">> => <<"^\\d{0,4}$">>
        },
        <<"paymentSystem">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Платежная система.\n\nНабор систем, доступных для проведения платежей, можно узнать, вызвав соответствующую [операцию](#operation/getInvoicePaymentMethods) после создания инвойса.\n">>
        },
        <<"tokenProvider">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Провайдер платежных токенов.\n\nНабор провайдеров, доступных для проведения платежей, можно узнать, вызвав соответствующую [операцию](#operation/getInvoicePaymentMethods) после создания инвойса.\n">>
        },
        <<"tokenizationMethod">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Метод токенизации">>,
          <<"enum">> => [ <<"dpan">>, <<"none">> ]
        }
      }
    },
    <<"BankCardPaymentSystem">> => #{
      <<"type">> => <<"string">>,
      <<"description">> => <<"Платежная система.\n\nНабор систем, доступных для проведения платежей, можно узнать, вызвав соответствующую [операцию](#operation/getInvoicePaymentMethods) после создания инвойса.\n">>
    },
    <<"BankCardTokenizationMethod">> => #{
      <<"type">> => <<"string">>,
      <<"description">> => <<"Метод токенизации">>,
      <<"enum">> => [ <<"dpan">>, <<"none">> ]
    },
    <<"BankCardTokenProvider">> => #{
      <<"type">> => <<"string">>,
      <<"description">> => <<"Провайдер платежных токенов.\n\nНабор провайдеров, доступных для проведения платежей, можно узнать, вызвав соответствующую [операцию](#operation/getInvoicePaymentMethods) после создания инвойса.\n">>
    },
    <<"BankCardTokenProviderData">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"merchantID">>, <<"realm">> ],
      <<"properties">> => #{
        <<"merchantID">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Идентификатор мерчанта в платёжной организации.\nМожет быть использован для передачи провайдеру платежных токенов. Например, ожидается,\nчто этот параметр передается как gatewayMerchantID для GooglePay и/или YandexPay,\nа затем используется для привязки токена к указанному магазину.\n">>
        },
        <<"merchantName">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Имя мерчанта в платежной организации.\nМожет быть использовано, например,  как `merchantInfo.merchantName` в GooglePay\nили `merchant.name` в YandexPay или `displayName` в ApplePay.\n">>
        },
        <<"orderID">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Идентификатор оплачиваемого счета в платёжной организации.\nМожет быть использован, например,  как `orderNumber`  в SamsungPay или `order.id` в YandexPay.\nИспользование системного идентификатора может оказаться полезным при отладке или сверке данных\nс данными провайдера.\n">>
        },
        <<"realm">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Режим рабочего окружения платежной организации">>,
          <<"enum">> => [ <<"test">>, <<"live">> ]
        }
      },
      <<"description">> => <<"Данные для интеграции с провайдерами платежных токенов.\nЭти параметры заданы в нашей системе и могут быть использованы для построении запросов к провайдеру токенов\nили корректного отображения платежной формы.\nДля более подробной информации ознакомьтесь с нашими руководствами по интеграции:\n  * [GooglePay](https://developer.rbk.money/docs/payments/googlepay),\n  * [ApplePay](https://developer.rbk.money/docs/payments/applepay).\n">>
    },
    <<"BrowserGetRequest">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/BrowserRequest">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"uriTemplate">> ],
        <<"properties">> => #{
          <<"uriTemplate">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Шаблон значения URL для перехода в браузере\n\nШаблон представлен согласно стандарту\n[RFC6570](https://tools.ietf.org/html/rfc6570).\n">>
          }
        }
      } ]
    },
    <<"BrowserPostRequest">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/BrowserRequest">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"form">>, <<"uriTemplate">> ],
        <<"properties">> => #{
          <<"uriTemplate">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Шаблон значения URL для отправки формы\n\nШаблон представлен согласно стандарту\n[RFC6570](https://tools.ietf.org/html/rfc6570).\n">>
          },
          <<"form">> => #{
            <<"$ref">> => <<"#/definitions/UserInteractionForm">>
          }
        }
      } ]
    },
    <<"BrowserRequest">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"requestType">> ],
      <<"discriminator">> => <<"requestType">>,
      <<"properties">> => #{
        <<"requestType">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Тип браузерной операции">>
        }
      }
    },
    <<"CaptureParams">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/Reason">>
      }, #{
        <<"type">> => <<"object">>,
        <<"properties">> => #{
          <<"amount">> => #{
            <<"type">> => <<"integer">>,
            <<"format">> => <<"int64">>,
            <<"description">> => <<"Подтверждаемая сумма платежа, в минорных денежных единицах,\nнапример в копейках в случае указания российских рублей в качестве\nвалюты.\n">>,
            <<"minimum">> => 1
          },
          <<"currency">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Валюта, символьный код согласно [ISO 4217](http://www.iso.org/iso/home/standards/currency_codes.htm).">>,
            <<"pattern">> => <<"^[A-Z]{3}$">>
          },
          <<"cart">> => #{
            <<"type">> => <<"array">>,
            <<"description">> => <<"Корзина с набором позиций **предоставляемых** товаров или услуг">>,
            <<"items">> => #{
              <<"$ref">> => <<"#/definitions/InvoiceLine">>
            },
            <<"maxItems">> => 100,
            <<"minItems">> => 1
          },
          <<"allocation">> => #{
            <<"type">> => <<"array">>,
            <<"description">> => <<"Итоговое распределение денежных средств\n">>,
            <<"items">> => #{
              <<"$ref">> => <<"#/definitions/AllocationTransaction">>
            },
            <<"maxItems">> => 100,
            <<"minItems">> => 1
          }
        },
        <<"description">> => <<"Данные подтверждаемой суммы платежа">>
      } ]
    },
    <<"CardData">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/PaymentTool">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"cardNumber">>, <<"expDate">> ],
        <<"properties">> => #{
          <<"cardNumber">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Номер банковской карты">>,
            <<"pattern">> => <<"^\\d{12,19}$">>
          },
          <<"expDate">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Срок действия банковской карты">>,
            <<"pattern">> => <<"^\\d{2}\\/(\\d{2}|\\d{4})$">>
          },
          <<"cvv">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Код верификации">>,
            <<"pattern">> => <<"^\\d{3,4}$">>
          },
          <<"cardHolder">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Имя держателя карты">>,
            <<"minLength">> => 1,
            <<"maxLength">> => 100,
            <<"pattern">> => <<"^[[:alpha:][:space:][:punct:]]+$">>
          }
        },
        <<"description">> => <<"Банковская карта">>
      } ]
    },
    <<"Category">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"categoryID">>, <<"name">> ],
      <<"properties">> => #{
        <<"name">> => #{
          <<"type">> => <<"string">>,
          <<"maxLength">> => 100
        },
        <<"categoryID">> => #{
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int32">>
        },
        <<"description">> => #{
          <<"type">> => <<"string">>,
          <<"maxLength">> => 1000
        }
      },
      <<"example">> => #{
        <<"name">> => <<"name">>,
        <<"description">> => <<"description">>,
        <<"categoryID">> => 0
      }
    },
    <<"Chargeback">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"body">>, <<"createdAt">>, <<"currency">>, <<"id">>, <<"levy">>, <<"stage">>, <<"status">> ],
      <<"properties">> => #{
        <<"id">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Идентификатор чарджбэка">>
        },
        <<"createdAt">> => #{
          <<"type">> => <<"string">>,
          <<"format">> => <<"date-time">>,
          <<"description">> => <<"Дата и время создания">>
        },
        <<"body">> => #{
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int64">>,
          <<"description">> => <<"Сумма чарджбэка, в минорных денежных единицах, например в копейках в случае указания российских рублей в качестве валюты.\n">>,
          <<"minimum">> => 1
        },
        <<"levy">> => #{
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int64">>,
          <<"description">> => <<"Сумма штрафа за чарджбэк, в минорных денежных единицах, например в копейках в случае указания российских рублей в качестве валюты.\n">>,
          <<"minimum">> => 1
        },
        <<"currency">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Валюта, символьный код согласно [ISO 4217](http://www.iso.org/iso/home/standards/currency_codes.htm).">>,
          <<"pattern">> => <<"^[A-Z]{3}$">>
        },
        <<"reasonCode">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Код причины чарджбэка">>,
          <<"maxLength">> => 1000
        },
        <<"stage">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Стадия чарджбэка">>,
          <<"enum">> => [ <<"chargeback">>, <<"pre-arbitration">>, <<"arbitration">> ]
        },
        <<"status">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Статус чарджбэка">>,
          <<"enum">> => [ <<"pending">>, <<"rejected">>, <<"accepted">>, <<"cancelled">> ]
        }
      },
      <<"example">> => #{
        <<"createdAt">> => <<"2000-01-23T04:56:07.000+00:00">>,
        <<"stage">> => <<"chargeback">>,
        <<"currency">> => <<"currency">>,
        <<"id">> => <<"id">>,
        <<"reasonCode">> => <<"reasonCode">>,
        <<"body">> => 1,
        <<"levy">> => 1,
        <<"status">> => <<"pending">>
      }
    },
    <<"ClientInfo">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"fingerprint">> ],
      <<"properties">> => #{
        <<"fingerprint">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Уникальный отпечаток user agent'а плательщика">>,
          <<"maxLength">> => 1000
        },
        <<"ip">> => #{
          <<"type">> => <<"string">>,
          <<"format">> => <<"ip-address">>,
          <<"description">> => <<"IP-адрес плательщика">>,
          <<"maxLength">> => 45
        },
        <<"url">> => #{
          <<"type">> => <<"string">>,
          <<"format">> => <<"uri">>,
          <<"description">> => <<"URL с которого была получена платежная форма клиентом">>,
          <<"maxLength">> => 1000
        }
      },
      <<"description">> => <<"Данные клиентского устройства плательщика">>,
      <<"example">> => #{
        <<"ip">> => <<"ip">>,
        <<"fingerprint">> => <<"fingerprint">>,
        <<"url">> => <<"http://example.com/aeiou">>
      }
    },
    <<"ContactInfo">> => #{
      <<"type">> => <<"object">>,
      <<"properties">> => #{
        <<"email">> => #{
          <<"type">> => <<"string">>,
          <<"format">> => <<"email">>,
          <<"description">> => <<"Адрес электронной почты">>,
          <<"maxLength">> => 100
        },
        <<"phoneNumber">> => #{
          <<"type">> => <<"string">>,
          <<"format">> => <<"^\\+\\d{4,15}$">>,
          <<"description">> => <<"Номер мобильного телефона с международным префиксом согласно\n[E.164](https://en.wikipedia.org/wiki/E.164).\n">>
        }
      },
      <<"description">> => <<"Контактные данные">>,
      <<"example">> => #{
        <<"phoneNumber">> => <<"phoneNumber">>,
        <<"email">> => <<"email">>
      }
    },
    <<"ContinuationToken">> => #{
      <<"type">> => <<"string">>,
      <<"description">> => <<"Токен, сигнализирующий о том, что в ответе передана только часть данных.\nДля получения следующей части нужно повторно обратиться к сервису, указав тот-же набор условий и полученый токен.\nЕсли токена нет, получена последняя часть данных.\n">>
    },
    <<"Contract">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"contractor">>, <<"createdAt">>, <<"id">>, <<"paymentInstitutionID">>, <<"status">> ],
      <<"properties">> => #{
        <<"id">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Идентификатор договора">>
        },
        <<"createdAt">> => #{
          <<"type">> => <<"string">>,
          <<"format">> => <<"date-time">>,
          <<"description">> => <<"Дата и время создания договора">>
        },
        <<"status">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Статус договора">>,
          <<"enum">> => [ <<"active">>, <<"terminated">> ]
        },
        <<"validSince">> => #{
          <<"type">> => <<"string">>,
          <<"format">> => <<"date-time">>,
          <<"description">> => <<"Дата и время вступления договора в силу">>
        },
        <<"validUntil">> => #{
          <<"type">> => <<"string">>,
          <<"format">> => <<"date-time">>,
          <<"description">> => <<"Дата и время прекращения силы договора">>
        },
        <<"terminatedAt">> => #{
          <<"type">> => <<"string">>,
          <<"format">> => <<"date-time">>,
          <<"description">> => <<"Дата и время расторжения договора">>
        },
        <<"contractor">> => #{
          <<"$ref">> => <<"#/definitions/Contractor">>
        },
        <<"legalAgreement">> => #{
          <<"$ref">> => <<"#/definitions/LegalAgreement">>
        },
        <<"paymentInstitutionID">> => #{
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int32">>
        },
        <<"reportingPreferences">> => #{
          <<"$ref">> => <<"#/definitions/ReportingPreferences">>
        }
      },
      <<"description">> => <<"Данные договора с участником">>,
      <<"example">> => #{
        <<"contractor">> => #{
          <<"contractorType">> => <<"LegalEntity">>
        },
        <<"createdAt">> => <<"2000-01-23T04:56:07.000+00:00">>,
        <<"validSince">> => <<"2000-01-23T04:56:07.000+00:00">>,
        <<"paymentInstitutionID">> => 0,
        <<"terminatedAt">> => <<"2000-01-23T04:56:07.000+00:00">>,
        <<"validUntil">> => <<"2000-01-23T04:56:07.000+00:00">>,
        <<"legalAgreement">> => #{
          <<"signedAt">> => <<"2000-01-23T04:56:07.000+00:00">>,
          <<"validUntil">> => <<"2000-01-23T04:56:07.000+00:00">>,
          <<"id">> => <<"id">>
        },
        <<"id">> => <<"id">>,
        <<"reportingPreferences">> => #{
          <<"serviceAcceptanceActPreferences">> => #{
            <<"scheduleID">> => 6,
            <<"signer">> => #{
              <<"document">> => #{
                <<"representativeDocumentType">> => <<"ArticlesOfAssociation">>
              },
              <<"fullName">> => <<"fullName">>,
              <<"position">> => <<"position">>
            }
          }
        },
        <<"status">> => <<"active">>
      }
    },
    <<"ContractAdjustment">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"createdAt">>, <<"id">> ],
      <<"properties">> => #{
        <<"id">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Идентификатор поправки">>
        },
        <<"createdAt">> => #{
          <<"type">> => <<"string">>,
          <<"format">> => <<"date-time">>,
          <<"description">> => <<"Дата и время создания поправки">>
        },
        <<"validSince">> => #{
          <<"type">> => <<"string">>,
          <<"format">> => <<"date-time">>,
          <<"description">> => <<"Дата и время вступления поправки в силу">>
        },
        <<"validUntil">> => #{
          <<"type">> => <<"string">>,
          <<"format">> => <<"date-time">>,
          <<"description">> => <<"Дата и время прекращения силы поправки">>
        }
      },
      <<"description">> => <<"Данные поправки к договору">>,
      <<"example">> => #{
        <<"createdAt">> => <<"2000-01-23T04:56:07.000+00:00">>,
        <<"validSince">> => <<"2000-01-23T04:56:07.000+00:00">>,
        <<"validUntil">> => <<"2000-01-23T04:56:07.000+00:00">>,
        <<"id">> => <<"id">>
      }
    },
    <<"Contractor">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"contractorType">> ],
      <<"discriminator">> => <<"contractorType">>,
      <<"properties">> => #{
        <<"contractorType">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Тип лица, выступающего стороной договора">>,
          <<"enum">> => [ <<"LegalEntity">>, <<"PrivateEntity">>, <<"RegisteredUser">> ]
        }
      },
      <<"description">> => <<"Данные лица, выступающего стороной договора">>,
      <<"example">> => #{
        <<"contractorType">> => <<"LegalEntity">>
      },
      <<"x-discriminator-is-enum">> => true
    },
    <<"CostAmountRange">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"lowerBound">>, <<"upperBound">> ],
      <<"properties">> => #{
        <<"upperBound">> => #{
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int64">>,
          <<"description">> => <<"Верхняя (включительная) граница стоимости товаров или услуг.">>,
          <<"minimum">> => 1
        },
        <<"lowerBound">> => #{
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int64">>,
          <<"description">> => <<"Нижняя (включительная) граница стоимости товаров или услуг.">>,
          <<"minimum">> => 1
        }
      }
    },
    <<"Country">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"id">>, <<"name">> ],
      <<"properties">> => #{
        <<"id">> => #{
          <<"type">> => <<"string">>,
          <<"example">> => <<"RUS">>,
          <<"description">> => <<"Alpha-3 код страны по стандарту [ISO 3166-1](https://en.wikipedia.org/wiki/ISO_3166-1)">>,
          <<"pattern">> => <<"^[A-Z]{3}$">>
        },
        <<"name">> => #{
          <<"type">> => <<"string">>,
          <<"maxLength">> => 200
        },
        <<"tradeBlocs">> => #{
          <<"type">> => <<"array">>,
          <<"items">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Идентификаторы Торговых Блоков">>
          }
        }
      },
      <<"description">> => <<"Страна">>,
      <<"example">> => #{
        <<"tradeBlocs">> => [ <<"tradeBlocs">>, <<"tradeBlocs">> ],
        <<"name">> => <<"name">>,
        <<"id">> => <<"RUS">>
      }
    },
    <<"CountryCode">> => #{
      <<"type">> => <<"string">>,
      <<"pattern">> => <<"^[A-Z]{3}$">>,
      <<"description">> => <<"Alpha-3 код страны по стандарту [ISO 3166-1](https://en.wikipedia.org/wiki/ISO_3166-1)">>,
      <<"example">> => <<"RUS">>
    },
    <<"CryptoCurrency">> => #{
      <<"type">> => <<"string">>,
      <<"description">> => <<"Криптовалютное платёжное средство.\n\nНабор криптовалют, доступных для проведения платежей, можно узнать, вызвав соответствующую [операцию](#operation/getInvoicePaymentMethods) после создания инвойса.\n">>,
      <<"example">> => <<"BTC">>
    },
    <<"CryptoCurrencyTransferRequest">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/UserInteraction">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"cryptoAddress">>, <<"cryptoAmount">>, <<"symbolicCode">> ],
        <<"properties">> => #{
          <<"cryptoAddress">> => #{
            <<"type">> => <<"string">>,
            <<"example">> => <<"2NBjv8rkUViGXAQar7n2BsdZjNQgupKtdPJ">>,
            <<"description">> => <<"Адрес криптовалютного кошелька">>
          },
          <<"symbolicCode">> => #{
            <<"type">> => <<"string">>,
            <<"example">> => <<"BTC">>,
            <<"description">> => <<"Символьный код криптовалюты">>
          },
          <<"cryptoAmount">> => #{
            <<"type">> => <<"string">>,
            <<"example">> => <<"0.0012">>,
            <<"description">> => <<"Сумма денежных средств в криптовалюте">>,
            <<"pattern">> => <<"^[0-9]+[.][0-9]+$">>
          }
        }
      } ]
    },
    <<"CryptoWallet">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/PaymentMethod">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"cryptoCurrencies">> ],
        <<"properties">> => #{
          <<"cryptoCurrencies">> => #{
            <<"type">> => <<"array">>,
            <<"description">> => <<"Список криптовалют">>,
            <<"items">> => #{
              <<"type">> => <<"string">>,
              <<"example">> => <<"BTC">>,
              <<"description">> => <<"Криптовалютное платёжное средство.\n\nНабор криптовалют, доступных для проведения платежей, можно узнать, вызвав соответствующую [операцию](#operation/getInvoicePaymentMethods) после создания инвойса.\n">>
            }
          }
        }
      } ]
    },
    <<"CryptoWalletData">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/PaymentTool">>
      }, #{
        <<"$ref">> => <<"#/definitions/CryptoWalletDetails">>
      } ]
    },
    <<"CryptoWalletDetails">> => #{
      <<"required">> => [ <<"cryptoCurrency">> ],
      <<"properties">> => #{
        <<"cryptoCurrency">> => #{
          <<"type">> => <<"string">>,
          <<"example">> => <<"BTC">>,
          <<"description">> => <<"Криптовалютное платёжное средство.\n\nНабор криптовалют, доступных для проведения платежей, можно узнать, вызвав соответствующую [операцию](#operation/getInvoicePaymentMethods) после создания инвойса.\n">>
        }
      }
    },
    <<"Currency">> => #{
      <<"type">> => <<"string">>,
      <<"pattern">> => <<"^[A-Z]{3}$">>,
      <<"description">> => <<"Валюта, символьный код согласно [ISO 4217](http://www.iso.org/iso/home/standards/currency_codes.htm).">>
    },
    <<"Customer">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"contactInfo">>, <<"metadata">>, <<"shopID">> ],
      <<"properties">> => #{
        <<"id">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Идентификатор плательщика">>,
          <<"readOnly">> => true
        },
        <<"externalID">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Внешний идентификатор плательщика">>,
          <<"minLength">> => 1,
          <<"maxLength">> => 40
        },
        <<"shopID">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Идентификатор магазина">>
        },
        <<"partyID">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Уникальный в рамках платформы идентификатор участника.">>,
          <<"minLength">> => 1,
          <<"maxLength">> => 40
        },
        <<"contactInfo">> => #{
          <<"$ref">> => <<"#/definitions/ContactInfo">>
        },
        <<"status">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Статус плательщика">>,
          <<"readOnly">> => true,
          <<"enum">> => [ <<"ready">>, <<"unready">> ]
        },
        <<"metadata">> => #{
          <<"type">> => <<"object">>,
          <<"description">> => <<"Связанные с плательщиком метаданные">>,
          <<"properties">> => #{ }
        }
      },
      <<"example">> => #{
        <<"metadata">> => <<"{}">>,
        <<"contactInfo">> => #{
          <<"phoneNumber">> => <<"phoneNumber">>,
          <<"email">> => <<"email">>
        },
        <<"externalID">> => <<"externalID">>,
        <<"id">> => <<"id">>,
        <<"shopID">> => <<"shopID">>,
        <<"partyID">> => <<"partyID">>,
        <<"status">> => <<"ready">>
      }
    },
    <<"CustomerAndToken">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"customer">>, <<"customerAccessToken">> ],
      <<"properties">> => #{
        <<"customer">> => #{
          <<"$ref">> => <<"#/definitions/Customer">>
        },
        <<"customerAccessToken">> => #{
          <<"$ref">> => <<"#/definitions/AccessToken">>
        }
      },
      <<"example">> => #{
        <<"customerAccessToken">> => #{
          <<"payload">> => <<"payload">>
        },
        <<"customer">> => #{
          <<"metadata">> => <<"{}">>,
          <<"contactInfo">> => #{
            <<"phoneNumber">> => <<"phoneNumber">>,
            <<"email">> => <<"email">>
          },
          <<"externalID">> => <<"externalID">>,
          <<"id">> => <<"id">>,
          <<"shopID">> => <<"shopID">>,
          <<"partyID">> => <<"partyID">>,
          <<"status">> => <<"ready">>
        }
      }
    },
    <<"CustomerBinding">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"id">>, <<"paymentResource">>, <<"status">> ],
      <<"properties">> => #{
        <<"id">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Идентификатор привязки">>
        },
        <<"externalID">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Внешний идентификатор привязки">>,
          <<"minLength">> => 1,
          <<"maxLength">> => 40
        },
        <<"paymentResource">> => #{
          <<"$ref">> => <<"#/definitions/PaymentResource">>
        },
        <<"status">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Статус привязки">>,
          <<"enum">> => [ <<"pending">>, <<"succeeded">>, <<"failed">> ]
        },
        <<"error">> => #{
          <<"$ref">> => <<"#/definitions/CustomerBindingError">>
        }
      },
      <<"example">> => #{
        <<"externalID">> => <<"externalID">>,
        <<"id">> => <<"id">>,
        <<"error">> => #{
          <<"code">> => <<"code">>,
          <<"message">> => <<"message">>
        },
        <<"paymentResource">> => #{
          <<"paymentToolToken">> => <<"paymentToolToken">>,
          <<"paymentSession">> => <<"paymentSession">>,
          <<"clientInfo">> => #{ },
          <<"paymentToolDetails">> => #{
            <<"detailsType">> => <<"detailsType">>
          }
        },
        <<"status">> => <<"pending">>
      }
    },
    <<"CustomerBindingError">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"code">>, <<"message">> ],
      <<"properties">> => #{
        <<"code">> => #{
          <<"type">> => <<"string">>
        },
        <<"message">> => #{
          <<"type">> => <<"string">>
        }
      },
      <<"description">> => <<"Описание ошибки, возникшей в процессе привязки">>,
      <<"example">> => #{
        <<"code">> => <<"code">>,
        <<"message">> => <<"message">>
      }
    },
    <<"CustomerBindingInteractionCompleted">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/CustomerChange">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"customerBindingID">> ],
        <<"properties">> => #{
          <<"customerBindingID">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Идентификатор привязки">>
          },
          <<"userInteraction">> => #{
            <<"$ref">> => <<"#/definitions/UserInteraction">>
          }
        },
        <<"description">> => <<"Оповещение о завершении последнего запрошенного взаимодействия с плательщиком\nв рамках привязки\n">>
      } ]
    },
    <<"CustomerBindingInteractionRequested">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/CustomerChange">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"customerBindingID">>, <<"userInteraction">> ],
        <<"properties">> => #{
          <<"customerBindingID">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Идентификатор привязки">>
          },
          <<"userInteraction">> => #{
            <<"$ref">> => <<"#/definitions/UserInteraction">>
          }
        },
        <<"description">> => <<"Требование провести взаимодействие с плательщиком для продолжения процесса\nпривязки\n">>
      } ]
    },
    <<"CustomerBindingParams">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"paymentResource">> ],
      <<"properties">> => #{
        <<"externalID">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Внешний идентификатор привязки">>,
          <<"minLength">> => 1,
          <<"maxLength">> => 40
        },
        <<"paymentResource">> => #{
          <<"$ref">> => <<"#/definitions/PaymentResource">>
        }
      },
      <<"example">> => #{
        <<"externalID">> => <<"externalID">>,
        <<"paymentResource">> => #{
          <<"paymentToolToken">> => <<"paymentToolToken">>,
          <<"paymentSession">> => <<"paymentSession">>,
          <<"clientInfo">> => #{ },
          <<"paymentToolDetails">> => #{
            <<"detailsType">> => <<"detailsType">>
          }
        }
      }
    },
    <<"CustomerBindingStarted">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/CustomerChange">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"customerBinding">> ],
        <<"properties">> => #{
          <<"customerBinding">> => #{
            <<"$ref">> => <<"#/definitions/CustomerBinding">>
          }
        }
      } ]
    },
    <<"CustomerBindingStatus">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"status">> ],
      <<"properties">> => #{
        <<"status">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Статус привязки">>,
          <<"enum">> => [ <<"pending">>, <<"succeeded">>, <<"failed">> ]
        },
        <<"error">> => #{
          <<"$ref">> => <<"#/definitions/CustomerBindingError">>
        }
      }
    },
    <<"CustomerBindingStatusChanged">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/CustomerChange">>
      }, #{
        <<"$ref">> => <<"#/definitions/CustomerBindingStatus">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"customerBindingID">> ],
        <<"properties">> => #{
          <<"customerBindingID">> => #{
            <<"type">> => <<"string">>
          }
        }
      } ]
    },
    <<"CustomerChange">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"changeType">> ],
      <<"discriminator">> => <<"changeType">>,
      <<"properties">> => #{
        <<"changeType">> => #{
          <<"type">> => <<"string">>,
          <<"enum">> => [ <<"CustomerBindingStarted">>, <<"CustomerBindingStatusChanged">>, <<"CustomerBindingInteractionRequested">>, <<"CustomerBindingInteractionCompleted">> ]
        }
      },
      <<"example">> => #{
        <<"changeType">> => <<"CustomerBindingStarted">>
      },
      <<"x-discriminator-is-enum">> => true
    },
    <<"CustomerEvent">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"changes">>, <<"createdAt">>, <<"id">> ],
      <<"properties">> => #{
        <<"id">> => #{
          <<"type">> => <<"integer">>
        },
        <<"createdAt">> => #{
          <<"type">> => <<"string">>,
          <<"format">> => <<"date-time">>
        },
        <<"changes">> => #{
          <<"type">> => <<"array">>,
          <<"items">> => #{
            <<"$ref">> => <<"#/definitions/CustomerChange">>
          }
        }
      },
      <<"example">> => #{
        <<"createdAt">> => <<"2000-01-23T04:56:07.000+00:00">>,
        <<"changes">> => [ #{
          <<"changeType">> => <<"CustomerBindingStarted">>
        }, #{
          <<"changeType">> => <<"CustomerBindingStarted">>
        } ],
        <<"id">> => 0
      }
    },
    <<"CustomerParams">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"contactInfo">>, <<"metadata">>, <<"shopID">> ],
      <<"properties">> => #{
        <<"externalID">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Внешний идентификатор плательщика">>,
          <<"minLength">> => 1,
          <<"maxLength">> => 40
        },
        <<"shopID">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Идентификатор магазина">>
        },
        <<"partyID">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Уникальный в рамках платформы идентификатор участника.">>,
          <<"minLength">> => 1,
          <<"maxLength">> => 40
        },
        <<"contactInfo">> => #{
          <<"$ref">> => <<"#/definitions/ContactInfo">>
        },
        <<"metadata">> => #{
          <<"type">> => <<"object">>,
          <<"description">> => <<"Связанные с плательщиком метаданные">>,
          <<"properties">> => #{ }
        }
      },
      <<"example">> => #{
        <<"metadata">> => <<"{}">>,
        <<"contactInfo">> => #{
          <<"phoneNumber">> => <<"phoneNumber">>,
          <<"email">> => <<"email">>
        },
        <<"externalID">> => <<"externalID">>,
        <<"shopID">> => <<"shopID">>,
        <<"partyID">> => <<"partyID">>
      }
    },
    <<"CustomerPayer">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/Payer">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"customerID">> ],
        <<"properties">> => #{
          <<"customerID">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Идентификатор плательщика">>,
            <<"minLength">> => 1,
            <<"maxLength">> => 40
          },
          <<"paymentToolDetails">> => #{
            <<"$ref">> => <<"#/definitions/PaymentToolDetails">>
          }
        }
      } ],
      <<"description">> => <<"Многоразовое платежное средство">>
    },
    <<"CustomersTopic">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/WebhookScope">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"eventTypes">>, <<"shopID">> ],
        <<"properties">> => #{
          <<"shopID">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Идентификатор магазина">>,
            <<"minLength">> => 1,
            <<"maxLength">> => 40
          },
          <<"eventTypes">> => #{
            <<"type">> => <<"array">>,
            <<"description">> => <<"Набор типов событий плательщиков, о которых следует оповещать">>,
            <<"items">> => #{
              <<"type">> => <<"string">>,
              <<"enum">> => [ <<"CustomerCreated">>, <<"CustomerDeleted">>, <<"CustomerReady">>, <<"CustomerBindingStarted">>, <<"CustomerBindingSucceeded">>, <<"CustomerBindingFailed">> ]
            }
          }
        }
      } ],
      <<"description">> => <<"Область охвата, включающая события по плательщикам в рамках определённого\nмагазина\n">>
    },
    <<"Decimal">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"exp">>, <<"m">> ],
      <<"properties">> => #{
        <<"m">> => #{
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int64">>,
          <<"description">> => <<"Мантисса.\n">>,
          <<"minimum">> => 0
        },
        <<"exp">> => #{
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int64">>,
          <<"description">> => <<"Порядок.\n">>
        }
      },
      <<"description">> => <<"Дробное десятичное число произвольной точности">>
    },
    <<"DefaultLogicError">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"code">>, <<"message">> ],
      <<"properties">> => #{
        <<"code">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"[Код ошибки](#tag/Error-Codes)\n">>,
          <<"enum">> => [ <<"invalidRequest">>, <<"invalidDeadline">> ]
        },
        <<"message">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Человекочитаемое описание ошибки">>
        }
      }
    },
    <<"DigitalWallet">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/PaymentMethod">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"providers">> ],
        <<"properties">> => #{
          <<"providers">> => #{
            <<"type">> => <<"array">>,
            <<"description">> => <<"Список провайдеров электронных денежных средств">>,
            <<"items">> => #{
              <<"type">> => <<"string">>,
              <<"example">> => <<"QIWI">>,
              <<"description">> => <<"Провайдер электронных денежных средств.\n\nНабор провайдеров, доступных для проведения платежей, можно узнать, вызвав\nсоответствующую [операцию](#operation/getInvoicePaymentMethods) после создания инвойса.\n\nДополнительные детали провайдера можно узнать, вызвав [справочную операцию](#operation/getServiceProviderByID).\n">>
            }
          }
        }
      } ]
    },
    <<"DigitalWalletData">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/PaymentTool">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"id">>, <<"provider">> ],
        <<"properties">> => #{
          <<"id">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Идентификатор кошелька">>
          },
          <<"provider">> => #{
            <<"type">> => <<"string">>,
            <<"example">> => <<"QIWI">>,
            <<"description">> => <<"Провайдер электронных денежных средств.\n\nНабор провайдеров, доступных для проведения платежей, можно узнать, вызвав\nсоответствующую [операцию](#operation/getInvoicePaymentMethods) после создания инвойса.\n\nДополнительные детали провайдера можно узнать, вызвав [справочную операцию](#operation/getServiceProviderByID).\n">>
          },
          <<"token">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Токен">>
          }
        },
        <<"description">> => <<"Электронный кошелёк">>
      } ]
    },
    <<"DigitalWalletDetails">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"provider">> ],
      <<"properties">> => #{
        <<"provider">> => #{
          <<"type">> => <<"string">>,
          <<"example">> => <<"QIWI">>,
          <<"description">> => <<"Провайдер электронных денежных средств.\n\nНабор провайдеров, доступных для проведения платежей, можно узнать, вызвав\nсоответствующую [операцию](#operation/getInvoicePaymentMethods) после создания инвойса.\n\nДополнительные детали провайдера можно узнать, вызвав [справочную операцию](#operation/getServiceProviderByID).\n">>
        }
      }
    },
    <<"DigitalWalletProvider">> => #{
      <<"type">> => <<"string">>,
      <<"description">> => <<"Провайдер электронных денежных средств.\n\nНабор провайдеров, доступных для проведения платежей, можно узнать, вызвав\nсоответствующую [операцию](#operation/getInvoicePaymentMethods) после создания инвойса.\n\nДополнительные детали провайдера можно узнать, вызвав [справочную операцию](#operation/getServiceProviderByID).\n">>,
      <<"example">> => <<"QIWI">>
    },
    <<"ExternalID">> => #{
      <<"type">> => <<"string">>,
      <<"minLength">> => 1,
      <<"maxLength">> => 40,
      <<"description">> => <<"Уникальный в рамках платформы идентификатор сущности для данного участника.\n\nИспользуется для обеспечения идемпотентности запроса.\n">>
    },
    <<"ExternalIDConflictError">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"externalID">> ],
      <<"properties">> => #{
        <<"externalID">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Переданное значение `externalID`, для которого обнаружен конфликт параметров запроса">>,
          <<"minLength">> => 1,
          <<"maxLength">> => 40
        },
        <<"id">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Идентификатор сущности, созданной предыдущим запросом с указанным `externalID`">>
        },
        <<"message">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Человекочитаемое описание ошибки">>
        }
      }
    },
    <<"GeneralError">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"message">> ],
      <<"properties">> => #{
        <<"message">> => #{
          <<"type">> => <<"string">>
        }
      }
    },
    <<"GooglePay">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/TokenizedCardData">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"gatewayMerchantID">>, <<"paymentToken">> ],
        <<"properties">> => #{
          <<"gatewayMerchantID">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Идентификатор мерчанта в системе">>
          },
          <<"paymentToken">> => #{
            <<"type">> => <<"object">>,
            <<"description">> => <<"Совокупность открытых и зашифрованных платежных данных">>,
            <<"properties">> => #{ }
          }
        },
        <<"description">> => <<"Платежные данные Google Pay">>
      } ]
    },
    <<"InternationalBankAccount">> => #{
      <<"type">> => <<"object">>,
      <<"properties">> => #{
        <<"number">> => #{
          <<"type">> => <<"string">>,
          <<"example">> => <<"123006951">>,
          <<"description">> => <<"Номер счёта\n">>,
          <<"pattern">> => <<"^[0-9A-Z]{8,40}$">>
        },
        <<"iban">> => #{
          <<"type">> => <<"string">>,
          <<"example">> => <<"GR1601101250000000012300695">>,
          <<"description">> => <<"International Bank Account Number [ISO 13616](https://en.wikipedia.org/wiki/International_Bank_Account_Number)\n\n_* Если `iban` задан, `bankDetails` не обязательны к заполнению._\n">>,
          <<"pattern">> => <<"^[A-Z0-9]{3,35}$">>
        },
        <<"bankDetails">> => #{
          <<"$ref">> => <<"#/definitions/InternationalBankDetails">>
        },
        <<"correspondentBankAccount">> => #{
          <<"$ref">> => <<"#/definitions/InternationalCorrespondentBankAccount">>
        }
      },
      <<"description">> => <<"Данные международного банковского счёта">>
    },
    <<"InternationalBankDetails">> => #{
      <<"type">> => <<"object">>,
      <<"properties">> => #{
        <<"bic">> => #{
          <<"type">> => <<"string">>,
          <<"example">> => <<"RZBAATWW\n">>,
          <<"description">> => <<"Business Identifier Code [ISO 9362](https://en.wikipedia.org/wiki/ISO_9362).\n\n_* Если `bic` задан, прочие данные не обязательны к заполнению._\n">>,
          <<"pattern">> => <<"^([A-Z0-9]{8}|[A-Z0-9]{11})$">>
        },
        <<"abartn">> => #{
          <<"type">> => <<"string">>,
          <<"example">> => <<"129131673">>,
          <<"description">> => <<"[ABA Routing Transit Number](https://en.wikipedia.org/wiki/ABA_routing_transit_number)\nбанковской организации, специфичный для банковской системы USA.\n\n_* Если `abartn` задан, прочие данные не обязательны к заполнению._\n">>,
          <<"pattern">> => <<"^[0-9]{9}$">>
        },
        <<"name">> => #{
          <<"type">> => <<"string">>,
          <<"example">> => <<"RAIFFEISEN BANK INTERNATIONAL AG\n">>,
          <<"description">> => <<"Наименование юридического лица банковской организации">>,
          <<"maxLength">> => 100
        },
        <<"countryCode">> => #{
          <<"type">> => <<"string">>,
          <<"example">> => <<"RUS">>,
          <<"description">> => <<"Код страны резиденции банковской организации, обозначается\nalpha-3 код по стандарту [ISO 3166-1](https://en.wikipedia.org/wiki/ISO_3166-1)\n">>,
          <<"pattern">> => <<"^[A-Z]{3}$">>
        },
        <<"address">> => #{
          <<"type">> => <<"string">>,
          <<"example">> => <<"1030, VIENNA, AM STADTPARK 9\n">>,
          <<"description">> => <<"Адрес юридического лица банковской организации">>,
          <<"maxLength">> => 1000
        }
      },
      <<"description">> => <<"Данные международной банковской организации">>
    },
    <<"InternationalCorrespondentBankAccount">> => #{
      <<"allOf">> => [ #{
        <<"description">> => <<"Данные корреспондентского счёта указанного банка">>
      }, #{
        <<"$ref">> => <<"#/definitions/InternationalBankAccount">>
      } ]
    },
    <<"InternationalLegalEntity">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/LegalEntity">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"legalName">>, <<"registeredOffice">> ],
        <<"properties">> => #{
          <<"legalName">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Наименование">>
          },
          <<"tradingName">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Торговое наименование (если применимо)">>
          },
          <<"registeredOffice">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Адрес места регистрации">>
          },
          <<"principalPlaceOfBusiness">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Адрес места нахождения (если отличается от регистрации)">>
          },
          <<"registeredNumber">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Регистрационный номер">>,
            <<"maxLength">> => 100
          },
          <<"country">> => #{
            <<"type">> => <<"string">>,
            <<"example">> => <<"RUS">>,
            <<"description">> => <<"Alpha-3 код страны по стандарту [ISO 3166-1](https://en.wikipedia.org/wiki/ISO_3166-1)">>,
            <<"pattern">> => <<"^[A-Z]{3}$">>
          }
        }
      } ],
      <<"description">> => <<"Международное юридическое лицо">>
    },
    <<"Invoice">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"amount">>, <<"createdAt">>, <<"currency">>, <<"dueDate">>, <<"id">>, <<"metadata">>, <<"product">>, <<"shopID">>, <<"status">> ],
      <<"properties">> => #{
        <<"id">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Идентификатор инвойса">>
        },
        <<"shopID">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Идентификатор магазина">>
        },
        <<"externalID">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Внешний идентификатор инвойса">>,
          <<"minLength">> => 1,
          <<"maxLength">> => 40
        },
        <<"createdAt">> => #{
          <<"type">> => <<"string">>,
          <<"format">> => <<"date-time">>,
          <<"description">> => <<"Дата и время создания">>
        },
        <<"dueDate">> => #{
          <<"type">> => <<"string">>,
          <<"format">> => <<"date-time">>,
          <<"description">> => <<"Дата и время окончания действия">>
        },
        <<"amount">> => #{
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int64">>,
          <<"description">> => <<"Стоимость предлагаемых товаров или услуг, в минорных денежных единицах,\nнапример в копейках в случае указания российских рублей в качестве валюты.\n">>,
          <<"minimum">> => 1
        },
        <<"currency">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Валюта, символьный код согласно [ISO 4217](http://www.iso.org/iso/home/standards/currency_codes.htm).">>,
          <<"pattern">> => <<"^[A-Z]{3}$">>
        },
        <<"product">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Наименование предлагаемых товаров или услуг">>,
          <<"maxLength">> => 100
        },
        <<"description">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Описание предлагаемых товаров или услуг">>,
          <<"maxLength">> => 1000
        },
        <<"invoiceTemplateID">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Идентификатор шаблона (для инвойсов, созданных по шаблону).">>
        },
        <<"cart">> => #{
          <<"$ref">> => <<"#/definitions/InvoiceCart">>
        },
        <<"allocation">> => #{
          <<"$ref">> => <<"#/definitions/Allocation">>
        },
        <<"bankAccount">> => #{
          <<"$ref">> => <<"#/definitions/InvoiceBankAccount">>
        },
        <<"metadata">> => #{
          <<"type">> => <<"object">>,
          <<"description">> => <<"Связанные с инвойсом метаданные">>,
          <<"properties">> => #{ }
        },
        <<"clientInfo">> => #{
          <<"$ref">> => <<"#/definitions/InvoiceClientInfo">>
        },
        <<"status">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Статус инвойса">>,
          <<"enum">> => [ <<"unpaid">>, <<"cancelled">>, <<"paid">>, <<"fulfilled">> ]
        },
        <<"reason">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Причина отмены или погашения инвойса">>,
          <<"maxLength">> => 1000
        }
      },
      <<"example">> => #{
        <<"bankAccount">> => #{
          <<"accountType">> => <<"InvoiceRussianBankAccount">>
        },
        <<"reason">> => <<"reason">>,
        <<"amount">> => 1,
        <<"product">> => <<"product">>,
        <<"allocation">> => <<"">>,
        <<"metadata">> => <<"{}">>,
        <<"dueDate">> => <<"2000-01-23T04:56:07.000+00:00">>,
        <<"externalID">> => <<"externalID">>,
        <<"description">> => <<"description">>,
        <<"clientInfo">> => #{
          <<"trustLevel">> => <<"wellKnown">>
        },
        <<"cart">> => <<"">>,
        <<"createdAt">> => <<"2000-01-23T04:56:07.000+00:00">>,
        <<"currency">> => <<"currency">>,
        <<"id">> => <<"id">>,
        <<"shopID">> => <<"shopID">>,
        <<"invoiceTemplateID">> => <<"invoiceTemplateID">>,
        <<"status">> => <<"unpaid">>
      }
    },
    <<"InvoiceAndToken">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"invoice">>, <<"invoiceAccessToken">> ],
      <<"properties">> => #{
        <<"invoice">> => #{
          <<"$ref">> => <<"#/definitions/Invoice">>
        },
        <<"invoiceAccessToken">> => #{
          <<"$ref">> => <<"#/definitions/AccessToken">>
        }
      },
      <<"example">> => #{
        <<"invoiceAccessToken">> => #{
          <<"payload">> => <<"payload">>
        },
        <<"invoice">> => #{
          <<"bankAccount">> => #{
            <<"accountType">> => <<"InvoiceRussianBankAccount">>
          },
          <<"reason">> => <<"reason">>,
          <<"amount">> => 1,
          <<"product">> => <<"product">>,
          <<"allocation">> => <<"">>,
          <<"metadata">> => <<"{}">>,
          <<"dueDate">> => <<"2000-01-23T04:56:07.000+00:00">>,
          <<"externalID">> => <<"externalID">>,
          <<"description">> => <<"description">>,
          <<"clientInfo">> => #{
            <<"trustLevel">> => <<"wellKnown">>
          },
          <<"cart">> => <<"">>,
          <<"createdAt">> => <<"2000-01-23T04:56:07.000+00:00">>,
          <<"currency">> => <<"currency">>,
          <<"id">> => <<"id">>,
          <<"shopID">> => <<"shopID">>,
          <<"invoiceTemplateID">> => <<"invoiceTemplateID">>,
          <<"status">> => <<"unpaid">>
        }
      }
    },
    <<"InvoiceBankAccount">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"accountType">> ],
      <<"discriminator">> => <<"accountType">>,
      <<"properties">> => #{
        <<"accountType">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Вид банковского счета">>,
          <<"enum">> => [ <<"InvoiceRussianBankAccount">> ]
        }
      },
      <<"description">> => <<"Информация о банковском счете плательщика, к операциям с которым относится данный инвойс\n">>,
      <<"example">> => #{
        <<"accountType">> => <<"InvoiceRussianBankAccount">>
      },
      <<"x-discriminator-is-enum">> => true
    },
    <<"InvoiceCart">> => #{
      <<"type">> => <<"array">>,
      <<"description">> => <<"Корзина с набором позиций товаров или услуг\n">>,
      <<"items">> => #{
        <<"$ref">> => <<"#/definitions/InvoiceLine">>
      },
      <<"minItems">> => 1,
      <<"maxItems">> => 100
    },
    <<"InvoiceChange">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"changeType">> ],
      <<"discriminator">> => <<"changeType">>,
      <<"properties">> => #{
        <<"changeType">> => #{
          <<"type">> => <<"string">>,
          <<"enum">> => [ <<"InvoiceCreated">>, <<"InvoiceStatusChanged">>, <<"PaymentStarted">>, <<"PaymentStatusChanged">>, <<"PaymentInteractionRequested">>, <<"PaymentInteractionCompleted">>, <<"RefundStarted">>, <<"RefundStatusChanged">> ]
        }
      },
      <<"example">> => #{
        <<"changeType">> => <<"InvoiceCreated">>
      },
      <<"x-discriminator-is-enum">> => true
    },
    <<"InvoiceClientInfo">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"trustLevel">> ],
      <<"properties">> => #{
        <<"trustLevel">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Надёжен ли плательщик?">>,
          <<"enum">> => [ <<"wellKnown">>, <<"unknown">> ]
        }
      },
      <<"description">> => <<"Дополнительная информация о клиенте">>,
      <<"example">> => #{
        <<"trustLevel">> => <<"wellKnown">>
      }
    },
    <<"InvoiceCreated">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/InvoiceChange">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"invoice">> ],
        <<"properties">> => #{
          <<"invoice">> => #{
            <<"$ref">> => <<"#/definitions/Invoice">>
          }
        }
      } ]
    },
    <<"InvoiceEvent">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"changes">>, <<"createdAt">>, <<"id">> ],
      <<"properties">> => #{
        <<"id">> => #{
          <<"type">> => <<"integer">>
        },
        <<"createdAt">> => #{
          <<"type">> => <<"string">>,
          <<"format">> => <<"date-time">>
        },
        <<"changes">> => #{
          <<"type">> => <<"array">>,
          <<"items">> => #{
            <<"$ref">> => <<"#/definitions/InvoiceChange">>
          }
        }
      },
      <<"example">> => #{
        <<"createdAt">> => <<"2000-01-23T04:56:07.000+00:00">>,
        <<"changes">> => [ #{
          <<"changeType">> => <<"InvoiceCreated">>
        }, #{
          <<"changeType">> => <<"InvoiceCreated">>
        } ],
        <<"id">> => 0
      }
    },
    <<"InvoiceLine">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"price">>, <<"product">>, <<"quantity">> ],
      <<"properties">> => #{
        <<"product">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Описание предлагаемого товара или услуги">>,
          <<"maxLength">> => 1000
        },
        <<"quantity">> => #{
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int64">>,
          <<"description">> => <<"Количество единиц товаров или услуг, предлагаемых в этой\nпозиции\n">>,
          <<"minimum">> => 1,
          <<"default">> => 1
        },
        <<"price">> => #{
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int64">>,
          <<"description">> => <<"Цена предлагаемого товара или услуги, в минорных денежных единицах, например\nв копейках в случае указания российских рублей в качестве валюты\n">>,
          <<"minimum">> => 1
        },
        <<"cost">> => #{
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int64">>,
          <<"description">> => <<"Суммарная стоимость позиции с учётом количества единиц товаров или услуг\n">>,
          <<"readOnly">> => true,
          <<"minimum">> => 1
        },
        <<"taxMode">> => #{
          <<"$ref">> => <<"#/definitions/InvoiceLineTaxMode">>
        }
      },
      <<"description">> => <<"Позиция товара или услуги">>,
      <<"example">> => #{
        <<"product">> => <<"product">>,
        <<"quantity">> => 1,
        <<"cost">> => 1,
        <<"price">> => 1,
        <<"taxMode">> => #{
          <<"type">> => <<"InvoiceLineTaxVAT">>
        }
      }
    },
    <<"InvoiceLineTaxMode">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"type">> ],
      <<"discriminator">> => <<"type">>,
      <<"properties">> => #{
        <<"type">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Тип схемы налогообложения">>,
          <<"enum">> => [ <<"InvoiceLineTaxVAT">> ]
        }
      },
      <<"description">> => <<"Схема налогообложения предлагаемого товара или услуги.\n\nУказывается, только если предлагаемый товар или услуга облагается налогом.\n">>,
      <<"example">> => #{
        <<"type">> => <<"InvoiceLineTaxVAT">>
      },
      <<"x-discriminator-is-enum">> => true
    },
    <<"InvoiceLineTaxVAT">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/InvoiceLineTaxMode">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"rate">> ],
        <<"properties">> => #{
          <<"rate">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Ставка налога">>,
            <<"enum">> => [ <<"0%">>, <<"10%">>, <<"18%">>, <<"20%">>, <<"10/110">>, <<"18/118">>, <<"20/120">> ]
          }
        },
        <<"description">> => <<"Налог на добавленную стоимость в юрисдикции РФ">>
      } ]
    },
    <<"InvoiceParams">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"currency">>, <<"dueDate">>, <<"metadata">>, <<"product">>, <<"shopID">> ],
      <<"properties">> => #{
        <<"shopID">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Идентификатор магазина">>,
          <<"minLength">> => 1,
          <<"maxLength">> => 40
        },
        <<"partyID">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Уникальный в рамках платформы идентификатор участника.">>,
          <<"minLength">> => 1,
          <<"maxLength">> => 40
        },
        <<"externalID">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Внешний идентификатор инвойса">>,
          <<"minLength">> => 1,
          <<"maxLength">> => 40
        },
        <<"dueDate">> => #{
          <<"type">> => <<"string">>,
          <<"format">> => <<"date-time">>,
          <<"description">> => <<"Дата и время окончания действия инвойса, после наступления которых его\nуже невозможно будет оплатить\n">>
        },
        <<"amount">> => #{
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int64">>,
          <<"description">> => <<"Стоимость предлагаемых товаров или услуг, в минорных денежных единицах,\nнапример в копейках в случае указания российских рублей в качестве валюты.\n\nЕсли стоимость не указана, то стоимостью инвойса будет считаться суммарная\nстоимость позиций в корзине.\n">>,
          <<"minimum">> => 1
        },
        <<"currency">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Валюта, символьный код согласно [ISO 4217](http://www.iso.org/iso/home/standards/currency_codes.htm).">>,
          <<"pattern">> => <<"^[A-Z]{3}$">>
        },
        <<"product">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Наименование предлагаемых товаров или услуг">>,
          <<"maxLength">> => 100
        },
        <<"description">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Описание предлагаемых товаров или услуг">>,
          <<"maxLength">> => 1000
        },
        <<"cart">> => #{
          <<"$ref">> => <<"#/definitions/InvoiceCart">>
        },
        <<"allocation">> => #{
          <<"$ref">> => <<"#/definitions/Allocation">>
        },
        <<"bankAccount">> => #{
          <<"$ref">> => <<"#/definitions/InvoiceBankAccount">>
        },
        <<"metadata">> => #{
          <<"type">> => <<"object">>,
          <<"description">> => <<"Метаданные, которые необходимо связать с инвойсом">>,
          <<"properties">> => #{ }
        },
        <<"clientInfo">> => #{
          <<"$ref">> => <<"#/definitions/InvoiceClientInfo">>
        }
      },
      <<"example">> => #{
        <<"bankAccount">> => #{
          <<"accountType">> => <<"InvoiceRussianBankAccount">>
        },
        <<"amount">> => 1,
        <<"product">> => <<"product">>,
        <<"allocation">> => <<"">>,
        <<"metadata">> => <<"{}">>,
        <<"dueDate">> => <<"2000-01-23T04:56:07.000+00:00">>,
        <<"externalID">> => <<"externalID">>,
        <<"description">> => <<"description">>,
        <<"clientInfo">> => #{
          <<"trustLevel">> => <<"wellKnown">>
        },
        <<"cart">> => <<"">>,
        <<"currency">> => <<"currency">>,
        <<"shopID">> => <<"shopID">>,
        <<"partyID">> => <<"partyID">>
      }
    },
    <<"InvoiceParamsWithTemplate">> => #{
      <<"type">> => <<"object">>,
      <<"properties">> => #{
        <<"externalID">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Уникальный в рамках платформы идентификатор сущности для данного участника.\n\nИспользуется для обеспечения идемпотентности запроса.\n">>,
          <<"minLength">> => 1,
          <<"maxLength">> => 40
        },
        <<"amount">> => #{
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int64">>,
          <<"description">> => <<"Стоимость предлагаемых товаров или услуг, в минорных денежных единицах,\nнапример в копейках в случае указания российских рублей в качестве валюты.\n">>,
          <<"minimum">> => 1
        },
        <<"currency">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Валюта, символьный код согласно [ISO 4217](http://www.iso.org/iso/home/standards/currency_codes.htm).">>,
          <<"pattern">> => <<"^[A-Z]{3}$">>
        },
        <<"metadata">> => #{
          <<"type">> => <<"object">>,
          <<"description">> => <<"Метаданные, которые необходимо связать с инвойсом">>,
          <<"properties">> => #{ }
        }
      },
      <<"example">> => #{
        <<"amount">> => 1,
        <<"metadata">> => <<"{}">>,
        <<"externalID">> => <<"externalID">>,
        <<"currency">> => <<"currency">>
      }
    },
    <<"InvoiceRussianBankAccount">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/InvoiceBankAccount">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"account">>, <<"bankBik">> ],
        <<"properties">> => #{
          <<"account">> => #{
            <<"type">> => <<"string">>,
            <<"example">> => <<"12345678912345680000">>,
            <<"description">> => <<"Номер счёта">>,
            <<"pattern">> => <<"^\\d{20}$">>
          },
          <<"bankBik">> => #{
            <<"type">> => <<"string">>,
            <<"example">> => <<"123456789">>,
            <<"description">> => <<"БИК банковской организации">>,
            <<"pattern">> => <<"^\\d{9}$">>
          }
        },
        <<"description">> => <<"Данные счёта плательщика в банковской организации, ведущей деятельность под\nюрисдикцией РФ.\n">>
      } ]
    },
    <<"InvoiceStatus">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"status">> ],
      <<"properties">> => #{
        <<"status">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Статус инвойса">>,
          <<"enum">> => [ <<"unpaid">>, <<"cancelled">>, <<"paid">>, <<"fulfilled">> ]
        },
        <<"reason">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Причина отмены или погашения инвойса">>,
          <<"maxLength">> => 1000
        }
      }
    },
    <<"InvoiceStatusChanged">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/InvoiceChange">>
      }, #{
        <<"$ref">> => <<"#/definitions/InvoiceStatus">>
      } ]
    },
    <<"InvoicesTopic">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/WebhookScope">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"eventTypes">>, <<"shopID">> ],
        <<"properties">> => #{
          <<"shopID">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Идентификатор магазина">>,
            <<"minLength">> => 1,
            <<"maxLength">> => 40
          },
          <<"eventTypes">> => #{
            <<"type">> => <<"array">>,
            <<"description">> => <<"Набор типов событий инвойсов, о которых следует оповещать">>,
            <<"items">> => #{
              <<"type">> => <<"string">>,
              <<"enum">> => [ <<"InvoiceCreated">>, <<"InvoicePaid">>, <<"InvoiceCancelled">>, <<"InvoiceFulfilled">>, <<"PaymentStarted">>, <<"PaymentProcessed">>, <<"PaymentCaptured">>, <<"PaymentCancelled">>, <<"PaymentRefunded">>, <<"PaymentFailed">>, <<"PaymentRefundCreated">>, <<"PaymentRefundSucceeded">>, <<"PaymentRefundFailed">> ]
            }
          }
        }
      } ],
      <<"description">> => <<"Область охвата, включающая события по инвойсам в рамках определённого\nмагазина\n">>
    },
    <<"InvoiceTemplate">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"details">>, <<"id">>, <<"lifetime">>, <<"shopID">> ],
      <<"properties">> => #{
        <<"id">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Идентификатор шаблона инвойса">>
        },
        <<"externalID">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Внешний идентификатор шаблона инвойса">>,
          <<"minLength">> => 1,
          <<"maxLength">> => 40
        },
        <<"shopID">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Идентификатор магазина">>,
          <<"minLength">> => 1,
          <<"maxLength">> => 40
        },
        <<"name">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Название шаблона">>,
          <<"maxLength">> => 100
        },
        <<"description">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Описание предлагаемых товаров или услуг">>,
          <<"maxLength">> => 1000
        },
        <<"createdAt">> => #{
          <<"type">> => <<"string">>,
          <<"format">> => <<"date-time">>,
          <<"description">> => <<"Дата создания шаблона">>
        },
        <<"lifetime">> => #{
          <<"$ref">> => <<"#/definitions/LifetimeInterval">>
        },
        <<"details">> => #{
          <<"$ref">> => <<"#/definitions/InvoiceTemplateDetails">>
        },
        <<"metadata">> => #{
          <<"type">> => <<"object">>,
          <<"description">> => <<"Метаданные, которые будут связаны с инвойсом, созданным по шаблону, в случае, если иные метаданные не указаны в запросе на создание инвойса.\n">>,
          <<"properties">> => #{ }
        }
      },
      <<"example">> => #{
        <<"createdAt">> => <<"2000-01-23T04:56:07.000+00:00">>,
        <<"metadata">> => <<"{}">>,
        <<"name">> => <<"name">>,
        <<"lifetime">> => #{
          <<"months">> => 0,
          <<"days">> => 0,
          <<"years">> => 0
        },
        <<"externalID">> => <<"externalID">>,
        <<"description">> => <<"description">>,
        <<"details">> => #{
          <<"templateType">> => <<"templateType">>
        },
        <<"id">> => <<"id">>,
        <<"shopID">> => <<"shopID">>
      }
    },
    <<"InvoiceTemplateAndToken">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"invoiceTemplate">>, <<"invoiceTemplateAccessToken">> ],
      <<"properties">> => #{
        <<"invoiceTemplate">> => #{
          <<"$ref">> => <<"#/definitions/InvoiceTemplate">>
        },
        <<"invoiceTemplateAccessToken">> => #{
          <<"$ref">> => <<"#/definitions/AccessToken">>
        }
      },
      <<"example">> => #{
        <<"invoiceTemplate">> => #{
          <<"createdAt">> => <<"2000-01-23T04:56:07.000+00:00">>,
          <<"metadata">> => <<"{}">>,
          <<"name">> => <<"name">>,
          <<"lifetime">> => #{
            <<"months">> => 0,
            <<"days">> => 0,
            <<"years">> => 0
          },
          <<"externalID">> => <<"externalID">>,
          <<"description">> => <<"description">>,
          <<"details">> => #{
            <<"templateType">> => <<"templateType">>
          },
          <<"id">> => <<"id">>,
          <<"shopID">> => <<"shopID">>
        },
        <<"invoiceTemplateAccessToken">> => #{
          <<"payload">> => <<"payload">>
        }
      }
    },
    <<"InvoiceTemplateCreateParams">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"details">>, <<"lifetime">>, <<"shopID">> ],
      <<"properties">> => #{
        <<"shopID">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Идентификатор магазина">>,
          <<"minLength">> => 1,
          <<"maxLength">> => 40
        },
        <<"externalID">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Внешний идентификатор шаблона инвойса">>,
          <<"minLength">> => 1,
          <<"maxLength">> => 40
        },
        <<"partyID">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Уникальный в рамках платформы идентификатор участника.">>,
          <<"minLength">> => 1,
          <<"maxLength">> => 40
        },
        <<"name">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Название шаблона">>,
          <<"maxLength">> => 100
        },
        <<"description">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Описание предлагаемых товаров или услуг">>,
          <<"maxLength">> => 1000
        },
        <<"lifetime">> => #{
          <<"$ref">> => <<"#/definitions/LifetimeInterval">>
        },
        <<"details">> => #{
          <<"$ref">> => <<"#/definitions/InvoiceTemplateDetails">>
        },
        <<"metadata">> => #{
          <<"type">> => <<"object">>,
          <<"description">> => <<"Метаданные, которые будут связаны с инвойсом, созданным по шаблону, в случае, если иные метаданные не указаны в запросе на создание инвойса.\n">>,
          <<"properties">> => #{ }
        }
      },
      <<"example">> => #{
        <<"metadata">> => <<"{}">>,
        <<"name">> => <<"name">>,
        <<"lifetime">> => #{
          <<"months">> => 0,
          <<"days">> => 0,
          <<"years">> => 0
        },
        <<"externalID">> => <<"externalID">>,
        <<"description">> => <<"description">>,
        <<"details">> => #{
          <<"templateType">> => <<"templateType">>
        },
        <<"shopID">> => <<"shopID">>,
        <<"partyID">> => <<"partyID">>
      }
    },
    <<"InvoiceTemplateDetails">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"templateType">> ],
      <<"discriminator">> => <<"templateType">>,
      <<"properties">> => #{
        <<"templateType">> => #{
          <<"type">> => <<"string">>
        }
      },
      <<"example">> => #{
        <<"templateType">> => <<"templateType">>
      }
    },
    <<"InvoiceTemplateLineCost">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"costType">> ],
      <<"discriminator">> => <<"costType">>,
      <<"properties">> => #{
        <<"costType">> => #{
          <<"type">> => <<"string">>
        }
      },
      <<"description">> => <<"Ограничения на стоимость товара и услуги для инвойсов, генерируемых по\nшаблону.\n">>
    },
    <<"InvoiceTemplateLineCostFixed">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/InvoiceTemplateLineCost">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"amount">>, <<"currency">> ],
        <<"properties">> => #{
          <<"currency">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Валюта, символьный код согласно [ISO 4217](http://www.iso.org/iso/home/standards/currency_codes.htm).">>,
            <<"pattern">> => <<"^[A-Z]{3}$">>
          },
          <<"amount">> => #{
            <<"type">> => <<"integer">>,
            <<"format">> => <<"int64">>,
            <<"description">> => <<"Стоимость предлагаемых товаров или услуг, в минорных денежных единицах,\nнапример в копейках в случае указания российских рублей в качестве валюты.\n">>,
            <<"minimum">> => 1
          }
        }
      } ]
    },
    <<"InvoiceTemplateLineCostRange">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/InvoiceTemplateLineCost">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"currency">>, <<"range">> ],
        <<"properties">> => #{
          <<"currency">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Валюта, символьный код согласно [ISO 4217](http://www.iso.org/iso/home/standards/currency_codes.htm).">>,
            <<"pattern">> => <<"^[A-Z]{3}$">>
          },
          <<"range">> => #{
            <<"$ref">> => <<"#/definitions/CostAmountRange">>
          }
        }
      } ]
    },
    <<"InvoiceTemplateLineCostUnlim">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/InvoiceTemplateLineCost">>
      }, #{ } ]
    },
    <<"InvoiceTemplateMultiLine">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/InvoiceTemplateDetails">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"cart">>, <<"currency">> ],
        <<"properties">> => #{
          <<"cart">> => #{
            <<"$ref">> => <<"#/definitions/InvoiceCart">>
          },
          <<"currency">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Валюта, символьный код согласно [ISO 4217](http://www.iso.org/iso/home/standards/currency_codes.htm).">>,
            <<"pattern">> => <<"^[A-Z]{3}$">>
          }
        }
      } ]
    },
    <<"InvoiceTemplateSingleLine">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/InvoiceTemplateDetails">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"price">>, <<"product">> ],
        <<"properties">> => #{
          <<"product">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Наименование предлагаемых товаров или услуг">>,
            <<"maxLength">> => 100
          },
          <<"price">> => #{
            <<"$ref">> => <<"#/definitions/InvoiceTemplateLineCost">>
          },
          <<"taxMode">> => #{
            <<"$ref">> => <<"#/definitions/InvoiceLineTaxMode">>
          }
        }
      } ]
    },
    <<"InvoiceTemplateUpdateParams">> => #{
      <<"type">> => <<"object">>,
      <<"properties">> => #{
        <<"name">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Название шаблона">>,
          <<"maxLength">> => 100
        },
        <<"description">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Описание предлагаемых товаров или услуг">>,
          <<"maxLength">> => 1000
        },
        <<"lifetime">> => #{
          <<"$ref">> => <<"#/definitions/LifetimeInterval">>
        },
        <<"details">> => #{
          <<"$ref">> => <<"#/definitions/InvoiceTemplateDetails">>
        },
        <<"metadata">> => #{
          <<"type">> => <<"object">>,
          <<"description">> => <<"Метаданные, которые будут связаны с инвойсом, созданным по шаблону, в случае, если иные метаданные не указаны в запросе на создание инвойса.\n">>,
          <<"properties">> => #{ }
        }
      },
      <<"example">> => #{
        <<"metadata">> => <<"{}">>,
        <<"name">> => <<"name">>,
        <<"lifetime">> => #{
          <<"months">> => 0,
          <<"days">> => 0,
          <<"years">> => 0
        },
        <<"description">> => <<"description">>,
        <<"details">> => #{
          <<"templateType">> => <<"templateType">>
        }
      }
    },
    <<"LegalAgreement">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"id">>, <<"signedAt">> ],
      <<"properties">> => #{
        <<"id">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Идентификатор юридического соглашения, например номер договора">>
        },
        <<"signedAt">> => #{
          <<"type">> => <<"string">>,
          <<"format">> => <<"date-time">>,
          <<"description">> => <<"Дата и время заключения юридического соглашения">>
        },
        <<"validUntil">> => #{
          <<"type">> => <<"string">>,
          <<"format">> => <<"date-time">>,
          <<"description">> => <<"Дата и время окончания действия юридического соглашения">>
        }
      },
      <<"description">> => <<"Ключевые данные юридического соглашения">>,
      <<"example">> => #{
        <<"signedAt">> => <<"2000-01-23T04:56:07.000+00:00">>,
        <<"validUntil">> => <<"2000-01-23T04:56:07.000+00:00">>,
        <<"id">> => <<"id">>
      }
    },
    <<"LegalEntity">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/Contractor">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"entityType">> ],
        <<"discriminator">> => <<"entityType">>,
        <<"properties">> => #{
          <<"entityType">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Тип юридического лица">>,
            <<"enum">> => [ <<"RussianLegalEntity">>, <<"InternationalLegalEntity">> ]
          }
        }
      } ],
      <<"description">> => <<"Юридическое лицо">>
    },
    <<"LifetimeInterval">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"days">>, <<"months">>, <<"years">> ],
      <<"properties">> => #{
        <<"days">> => #{
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int32">>,
          <<"minimum">> => 0
        },
        <<"months">> => #{
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int32">>,
          <<"minimum">> => 0
        },
        <<"years">> => #{
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int32">>,
          <<"minimum">> => 0
        }
      },
      <<"description">> => <<"Время жизни инвойса с момента его создания.">>,
      <<"example">> => #{
        <<"months">> => 0,
        <<"days">> => 0,
        <<"years">> => 0
      }
    },
    <<"LogicError">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"code">>, <<"message">> ],
      <<"properties">> => #{
        <<"code">> => #{
          <<"type">> => <<"string">>
        },
        <<"message">> => #{
          <<"type">> => <<"string">>
        }
      },
      <<"description">> => <<"Описание ошибки, возникшей в процессе проведения платежа">>
    },
    <<"MobileCommerce">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/PaymentMethod">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"operators">> ],
        <<"properties">> => #{
          <<"operators">> => #{
            <<"type">> => <<"array">>,
            <<"description">> => <<"Список операторов мобильной связи">>,
            <<"items">> => #{
              <<"type">> => <<"string">>,
              <<"example">> => <<"MTS">>,
              <<"description">> => <<"Оператор сотовой связи.\n\nНабор операторов, доступных для проведения платежей, можно узнать, вызвав соответствующую [операцию](#operation/getInvoicePaymentMethods) после создания инвойса.\n">>
            }
          }
        }
      } ]
    },
    <<"MobileCommerceData">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/PaymentTool">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"mobilePhone">> ],
        <<"discriminator">> => <<"mobileCommerceType">>,
        <<"properties">> => #{
          <<"mobilePhone">> => #{
            <<"$ref">> => <<"#/definitions/MobileCommercePhone">>
          }
        },
        <<"description">> => <<"Мобильная коммерция">>
      } ]
    },
    <<"MobileCommerceDetails">> => #{
      <<"required">> => [ <<"phoneNumber">> ],
      <<"properties">> => #{
        <<"phoneNumber">> => #{
          <<"type">> => <<"string">>,
          <<"example">> => <<"+7******0102">>,
          <<"description">> => <<"Маскированый номер мобильного телефона">>,
          <<"pattern">> => <<"^\\+\\d\\*{1,10}\\d{2,4}$">>
        }
      }
    },
    <<"MobileCommercePhone">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"cc">>, <<"ctn">> ],
      <<"properties">> => #{
        <<"cc">> => #{
          <<"type">> => <<"string">>,
          <<"example">> => <<"7">>,
          <<"description">> => <<"Код страны (1-3 цифры)">>,
          <<"pattern">> => <<"^\\d{1,3}$">>
        },
        <<"ctn">> => #{
          <<"type">> => <<"string">>,
          <<"example">> => <<"0001234567">>,
          <<"description">> => <<"Номер абонента">>,
          <<"pattern">> => <<"^\\d{10,12}$">>
        }
      },
      <<"description">> => <<"Телефонный номер, согласно рекомендации ITU-T [E.164](https://ru.wikipedia.org/wiki/E.164)\n">>
    },
    <<"MobileOperator">> => #{
      <<"type">> => <<"string">>,
      <<"description">> => <<"Оператор сотовой связи.\n\nНабор операторов, доступных для проведения платежей, можно узнать, вызвав соответствующую [операцию](#operation/getInvoicePaymentMethods) после создания инвойса.\n">>,
      <<"example">> => <<"MTS">>
    },
    <<"Party">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"id">>, <<"isBlocked">>, <<"isSuspended">> ],
      <<"properties">> => #{
        <<"id">> => #{
          <<"type">> => <<"string">>
        },
        <<"isBlocked">> => #{
          <<"type">> => <<"boolean">>
        },
        <<"isSuspended">> => #{
          <<"type">> => <<"boolean">>
        }
      },
      <<"example">> => #{
        <<"isSuspended">> => true,
        <<"isBlocked">> => true,
        <<"id">> => <<"id">>
      }
    },
    <<"PartyID">> => #{
      <<"type">> => <<"string">>,
      <<"minLength">> => 1,
      <<"maxLength">> => 40,
      <<"description">> => <<"Уникальный в рамках платформы идентификатор участника.">>
    },
    <<"Payer">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"payerType">> ],
      <<"discriminator">> => <<"payerType">>,
      <<"properties">> => #{
        <<"payerType">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Тип платежного средства">>
        },
        <<"sessionInfo">> => #{
          <<"$ref">> => <<"#/definitions/Payer_sessionInfo">>
        }
      },
      <<"example">> => #{
        <<"sessionInfo">> => #{
          <<"redirectUrl">> => <<"redirectUrl">>
        },
        <<"payerType">> => <<"payerType">>
      }
    },
    <<"Payment">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"amount">>, <<"createdAt">>, <<"currency">>, <<"flow">>, <<"id">>, <<"invoiceID">>, <<"payer">>, <<"status">> ],
      <<"properties">> => #{
        <<"id">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Идентификатор платежа">>
        },
        <<"externalID">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Уникальный в рамках платформы идентификатор сущности для данного участника.\n\nИспользуется для обеспечения идемпотентности запроса.\n">>,
          <<"minLength">> => 1,
          <<"maxLength">> => 40
        },
        <<"invoiceID">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Идентификатор инвойса, в рамках которого был создан платеж">>
        },
        <<"createdAt">> => #{
          <<"type">> => <<"string">>,
          <<"format">> => <<"date-time">>,
          <<"description">> => <<"Дата и время создания">>
        },
        <<"amount">> => #{
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int64">>,
          <<"description">> => <<"Стоимость предлагаемых товаров или услуг, в минорных денежных единицах,\nнапример в копейках в случае указания российских рублей в качестве валюты.\n">>,
          <<"minimum">> => 1
        },
        <<"currency">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Валюта, символьный код согласно [ISO 4217](http://www.iso.org/iso/home/standards/currency_codes.htm).">>,
          <<"pattern">> => <<"^[A-Z]{3}$">>
        },
        <<"flow">> => #{
          <<"$ref">> => <<"#/definitions/PaymentFlow">>
        },
        <<"payer">> => #{
          <<"$ref">> => <<"#/definitions/Payer">>
        },
        <<"transactionInfo">> => #{
          <<"$ref">> => <<"#/definitions/TransactionInfo">>
        },
        <<"makeRecurrent">> => #{
          <<"type">> => <<"boolean">>,
          <<"description">> => <<"Признак создания родительского рекуррентного платежа.\nУспешно проведеный платеж с этим признаком можно использовать как родительский в других рекуррентных платежах.\n">>,
          <<"readOnly">> => true,
          <<"default">> => false
        },
        <<"metadata">> => #{
          <<"type">> => <<"object">>,
          <<"description">> => <<"Связанные с платежом метаданные">>,
          <<"properties">> => #{ }
        },
        <<"allocation">> => #{
          <<"type">> => <<"array">>,
          <<"description">> => <<"Распределение денежных средств\n">>,
          <<"readOnly">> => true,
          <<"items">> => #{
            <<"$ref">> => <<"#/definitions/AllocationTransaction">>
          },
          <<"maxItems">> => 100,
          <<"minItems">> => 1
        },
        <<"status">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Статус платежа">>,
          <<"enum">> => [ <<"pending">>, <<"processed">>, <<"captured">>, <<"cancelled">>, <<"refunded">>, <<"failed">> ]
        },
        <<"error">> => #{
          <<"$ref">> => <<"#/definitions/PaymentError">>
        }
      },
      <<"example">> => #{
        <<"amount">> => 1,
        <<"metadata">> => <<"{}">>,
        <<"allocation">> => [ #{
          <<"allocationBodyType">> => <<"AllocationBodyAmount">>,
          <<"cart">> => <<"">>,
          <<"target">> => #{
            <<"allocationTargetType">> => <<"AllocationTargetShop">>
          }
        }, #{
          <<"allocationBodyType">> => <<"AllocationBodyAmount">>,
          <<"cart">> => <<"">>,
          <<"target">> => #{
            <<"allocationTargetType">> => <<"AllocationTargetShop">>
          }
        }, #{
          <<"allocationBodyType">> => <<"AllocationBodyAmount">>,
          <<"cart">> => <<"">>,
          <<"target">> => #{
            <<"allocationTargetType">> => <<"AllocationTargetShop">>
          }
        }, #{
          <<"allocationBodyType">> => <<"AllocationBodyAmount">>,
          <<"cart">> => <<"">>,
          <<"target">> => #{
            <<"allocationTargetType">> => <<"AllocationTargetShop">>
          }
        }, #{
          <<"allocationBodyType">> => <<"AllocationBodyAmount">>,
          <<"cart">> => <<"">>,
          <<"target">> => #{
            <<"allocationTargetType">> => <<"AllocationTargetShop">>
          }
        }, #{
          <<"allocationBodyType">> => <<"AllocationBodyAmount">>,
          <<"cart">> => <<"">>,
          <<"target">> => #{
            <<"allocationTargetType">> => <<"AllocationTargetShop">>
          }
        }, #{
          <<"allocationBodyType">> => <<"AllocationBodyAmount">>,
          <<"cart">> => <<"">>,
          <<"target">> => #{
            <<"allocationTargetType">> => <<"AllocationTargetShop">>
          }
        }, #{
          <<"allocationBodyType">> => <<"AllocationBodyAmount">>,
          <<"cart">> => <<"">>,
          <<"target">> => #{
            <<"allocationTargetType">> => <<"AllocationTargetShop">>
          }
        }, #{
          <<"allocationBodyType">> => <<"AllocationBodyAmount">>,
          <<"cart">> => <<"">>,
          <<"target">> => #{
            <<"allocationTargetType">> => <<"AllocationTargetShop">>
          }
        }, #{
          <<"allocationBodyType">> => <<"AllocationBodyAmount">>,
          <<"cart">> => <<"">>,
          <<"target">> => #{
            <<"allocationTargetType">> => <<"AllocationTargetShop">>
          }
        } ],
        <<"externalID">> => <<"externalID">>,
        <<"error">> => #{
          <<"code">> => <<"code">>,
          <<"subError">> => #{
            <<"code">> => <<"code">>
          }
        },
        <<"payer">> => #{
          <<"sessionInfo">> => #{
            <<"redirectUrl">> => <<"redirectUrl">>
          },
          <<"payerType">> => <<"payerType">>
        },
        <<"transactionInfo">> => #{
          <<"approvalCode">> => <<"approvalCode">>,
          <<"rrn">> => <<"rrn">>
        },
        <<"makeRecurrent">> => false,
        <<"createdAt">> => <<"2000-01-23T04:56:07.000+00:00">>,
        <<"invoiceID">> => <<"invoiceID">>,
        <<"currency">> => <<"currency">>,
        <<"id">> => <<"id">>,
        <<"flow">> => #{
          <<"type">> => <<"PaymentFlowInstant">>
        },
        <<"status">> => <<"pending">>
      }
    },
    <<"PaymentError">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"code">> ],
      <<"properties">> => #{
        <<"code">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Основной код ошибки">>
        },
        <<"subError">> => #{
          <<"$ref">> => <<"#/definitions/SubError">>
        }
      },
      <<"description">> => <<"[Ошибка, возникшая в процессе проведения платежа](#tag/Error-Codes)\n">>,
      <<"example">> => #{
        <<"code">> => <<"code">>,
        <<"subError">> => #{
          <<"code">> => <<"code">>
        }
      }
    },
    <<"PaymentFlow">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"type">> ],
      <<"discriminator">> => <<"type">>,
      <<"properties">> => #{
        <<"type">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Тип процесса выполнения платежа">>,
          <<"default">> => <<"PaymentFlowInstant">>,
          <<"enum">> => [ <<"PaymentFlowInstant">>, <<"PaymentFlowHold">> ]
        }
      },
      <<"example">> => #{
        <<"type">> => <<"PaymentFlowInstant">>
      },
      <<"x-discriminator-is-enum">> => true
    },
    <<"PaymentFlowHold">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/PaymentFlow">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"onHoldExpiration">> ],
        <<"properties">> => #{
          <<"onHoldExpiration">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Политика управления удержанием денежных средств">>,
            <<"default">> => <<"cancel">>,
            <<"enum">> => [ <<"cancel">>, <<"capture">> ]
          },
          <<"heldUntil">> => #{
            <<"type">> => <<"string">>,
            <<"format">> => <<"date-time">>,
            <<"description">> => <<"Дата и время, до которого происходит удержание денежных средств">>,
            <<"readOnly">> => true
          }
        }
      } ]
    },
    <<"PaymentFlowInstant">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/PaymentFlow">>
      }, #{ } ]
    },
    <<"PaymentInstitution">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"id">>, <<"name">>, <<"realm">>, <<"residences">> ],
      <<"properties">> => #{
        <<"id">> => #{
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int32">>
        },
        <<"name">> => #{
          <<"type">> => <<"string">>,
          <<"maxLength">> => 200
        },
        <<"description">> => #{
          <<"type">> => <<"string">>,
          <<"maxLength">> => 1000
        },
        <<"residences">> => #{
          <<"type">> => <<"array">>,
          <<"items">> => #{
            <<"type">> => <<"string">>,
            <<"example">> => <<"RUS">>,
            <<"description">> => <<"Alpha-3 код страны по стандарту [ISO 3166-1](https://en.wikipedia.org/wiki/ISO_3166-1)">>,
            <<"pattern">> => <<"^[A-Z]{3}$">>
          }
        },
        <<"realm">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Режим рабочего окружения платежной организации">>,
          <<"enum">> => [ <<"test">>, <<"live">> ]
        }
      },
      <<"description">> => <<"Платёжная организация">>,
      <<"example">> => #{
        <<"name">> => <<"name">>,
        <<"description">> => <<"description">>,
        <<"realm">> => <<"test">>,
        <<"id">> => 0,
        <<"residences">> => [ <<"RUS">>, <<"RUS">> ]
      }
    },
    <<"PaymentInstitutionAccount">> => #{
      <<"type">> => <<"object">>,
      <<"description">> => <<"Аккаунт платёжной организации">>
    },
    <<"PaymentInteractionCompleted">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/InvoiceChange">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"paymentID">> ],
        <<"properties">> => #{
          <<"paymentID">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Идентификатор платежа">>
          },
          <<"userInteraction">> => #{
            <<"$ref">> => <<"#/definitions/UserInteraction">>
          }
        },
        <<"description">> => <<"Оповещение о завершении последнего запрошенного взаимодействия с плательщиком\n">>
      } ]
    },
    <<"PaymentInteractionRequested">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/InvoiceChange">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"paymentID">>, <<"userInteraction">> ],
        <<"properties">> => #{
          <<"paymentID">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Идентификатор платежа">>
          },
          <<"userInteraction">> => #{
            <<"$ref">> => <<"#/definitions/UserInteraction">>
          }
        },
        <<"description">> => <<"Требование провести взаимодействие с плательщиком для продолжения процесса\nплатежа\n">>
      } ]
    },
    <<"PaymentMakeRecurrent">> => #{
      <<"type">> => <<"boolean">>,
      <<"description">> => <<"Признак создания родительского рекуррентного платежа.\nУспешно проведеный платеж с этим признаком можно использовать как родительский в других рекуррентных платежах.\n">>,
      <<"default">> => <<"false">>
    },
    <<"PaymentMethod">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"method">> ],
      <<"discriminator">> => <<"method">>,
      <<"properties">> => #{
        <<"method">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Метод оплаты">>,
          <<"enum">> => [ <<"BankCard">>, <<"PaymentTerminal">>, <<"DigitalWallet">>, <<"CryptoWallet">>, <<"MobileCommerce">> ]
        }
      },
      <<"example">> => #{
        <<"method">> => <<"BankCard">>
      },
      <<"x-discriminator-is-enum">> => true
    },
    <<"PaymentParams">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"flow">>, <<"payer">> ],
      <<"properties">> => #{
        <<"externalID">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Уникальный в рамках платформы идентификатор сущности для данного участника.\n\nИспользуется для обеспечения идемпотентности запроса.\n">>,
          <<"minLength">> => 1,
          <<"maxLength">> => 40
        },
        <<"flow">> => #{
          <<"$ref">> => <<"#/definitions/PaymentFlow">>
        },
        <<"payer">> => #{
          <<"$ref">> => <<"#/definitions/Payer">>
        },
        <<"processingDeadline">> => #{
          <<"type">> => <<"string">>,
          <<"example">> => <<"30m">>,
          <<"description">> => <<"Максимальное время обработки платежа">>,
          <<"minLength">> => 1,
          <<"maxLength">> => 40
        },
        <<"makeRecurrent">> => #{
          <<"type">> => <<"boolean">>,
          <<"description">> => <<"Признак создания родительского рекуррентного платежа.\nУспешно проведеный платеж с этим признаком можно использовать как родительский в других рекуррентных платежах.\n">>,
          <<"default">> => false
        },
        <<"metadata">> => #{
          <<"type">> => <<"object">>,
          <<"description">> => <<"Метаданные, которые необходимо связать с платежом">>,
          <<"properties">> => #{ }
        }
      },
      <<"example">> => #{
        <<"metadata">> => <<"{}">>,
        <<"processingDeadline">> => <<"30m">>,
        <<"externalID">> => <<"externalID">>,
        <<"payer">> => #{
          <<"sessionInfo">> => #{
            <<"redirectUrl">> => <<"redirectUrl">>
          },
          <<"payerType">> => <<"payerType">>
        },
        <<"flow">> => #{
          <<"type">> => <<"PaymentFlowInstant">>
        },
        <<"makeRecurrent">> => false
      }
    },
    <<"PaymentRecurrentParent">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"invoiceID">>, <<"paymentID">> ],
      <<"properties">> => #{
        <<"invoiceID">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Идентификатор инвойса">>
        },
        <<"paymentID">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Идентификатор платежа">>
        }
      },
      <<"description">> => <<"Родительский платеж, на основе которого создан текущий рекуррентный платеж">>
    },
    <<"PaymentResource">> => #{
      <<"type">> => <<"object">>,
      <<"properties">> => #{
        <<"paymentToolToken">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Токен платежного средства, предоставленного плательщиком.\n\n_Обязателен при создании платежа или привязки, может быть получен в процессе [токенизации](#operation/createPaymentResource)_.\n">>,
          <<"maxLength">> => 2000
        },
        <<"paymentSession">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Идентификатор платежной сессии.\n\n_Обязателен при создании платежа или привязки, может быть получен в процессе [токенизации](#operation/createPaymentResource)_.\n">>,
          <<"maxLength">> => 1000
        },
        <<"paymentToolDetails">> => #{
          <<"$ref">> => <<"#/definitions/PaymentToolDetails">>
        },
        <<"clientInfo">> => #{
          <<"$ref">> => <<"#/definitions/BankCard_tokenProviderData">>
        }
      },
      <<"description">> => <<"Данные одноразового платежного средства">>,
      <<"example">> => #{
        <<"paymentToolToken">> => <<"paymentToolToken">>,
        <<"paymentSession">> => <<"paymentSession">>,
        <<"clientInfo">> => #{ },
        <<"paymentToolDetails">> => #{
          <<"detailsType">> => <<"detailsType">>
        }
      }
    },
    <<"PaymentResourceParams">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"clientInfo">>, <<"paymentTool">> ],
      <<"properties">> => #{
        <<"paymentTool">> => #{
          <<"$ref">> => <<"#/definitions/PaymentTool">>
        },
        <<"clientInfo">> => #{
          <<"$ref">> => <<"#/definitions/ClientInfo">>
        }
      },
      <<"example">> => #{
        <<"paymentTool">> => #{
          <<"paymentToolType">> => <<"CardData">>
        },
        <<"clientInfo">> => #{
          <<"ip">> => <<"ip">>,
          <<"fingerprint">> => <<"fingerprint">>,
          <<"url">> => <<"http://example.com/aeiou">>
        }
      }
    },
    <<"PaymentResourcePayer">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/Payer">>
      }, #{
        <<"$ref">> => <<"#/definitions/PaymentResource">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"contactInfo">> ],
        <<"properties">> => #{
          <<"contactInfo">> => #{
            <<"$ref">> => <<"#/definitions/ContactInfo">>
          }
        }
      } ],
      <<"description">> => <<"Одноразовое платежное средство">>
    },
    <<"PaymentResourceResult">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"paymentSession">>, <<"paymentToolToken">> ],
      <<"properties">> => #{
        <<"paymentToolToken">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Токен платежного средства, предоставленного плательщиком">>,
          <<"maxLength">> => 2000
        },
        <<"paymentSession">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Идентификатор платежной сессии">>,
          <<"maxLength">> => 1000
        },
        <<"paymentToolDetails">> => #{
          <<"$ref">> => <<"#/definitions/PaymentToolDetails">>
        },
        <<"clientInfo">> => #{
          <<"$ref">> => <<"#/definitions/BankCard_tokenProviderData">>
        },
        <<"validUntil">> => #{
          <<"type">> => <<"string">>,
          <<"format">> => <<"date-time">>,
          <<"description">> => <<"Дата и время, до наступления которых токен платежного средства остается действительным">>,
          <<"readOnly">> => true
        }
      },
      <<"description">> => <<"Данные одноразового платежного средства">>,
      <<"example">> => #{
        <<"paymentToolToken">> => <<"paymentToolToken">>,
        <<"paymentSession">> => <<"paymentSession">>,
        <<"clientInfo">> => #{ },
        <<"validUntil">> => <<"2000-01-23T04:56:07.000+00:00">>,
        <<"paymentToolDetails">> => #{
          <<"detailsType">> => <<"detailsType">>
        }
      }
    },
    <<"PaymentSearchResult">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/PaymentStatus">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"amount">>, <<"createdAt">>, <<"currency">>, <<"flow">>, <<"id">>, <<"invoiceID">>, <<"payer">> ],
        <<"properties">> => #{
          <<"id">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Идентификатор платежа">>
          },
          <<"shortID">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Cокращенный идентификатор платежа и инвойса (spid)">>
          },
          <<"invoiceID">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Идентификатор инвойса, в рамках которого был создан платеж">>
          },
          <<"shopID">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Идентификатор магазина, в рамках которого был создан платеж">>
          },
          <<"createdAt">> => #{
            <<"type">> => <<"string">>,
            <<"format">> => <<"date-time">>,
            <<"description">> => <<"Дата и время создания">>
          },
          <<"amount">> => #{
            <<"type">> => <<"integer">>,
            <<"format">> => <<"int64">>,
            <<"description">> => <<"Стоимость предлагаемых товаров или услуг, в минорных денежных\nединицах, например в копейках в случае указания российских рублей в\nкачестве валюты.\n">>,
            <<"minimum">> => 0
          },
          <<"fee">> => #{
            <<"type">> => <<"integer">>,
            <<"format">> => <<"int64">>,
            <<"description">> => <<"Комиссия системы в минорных денежных единицах">>,
            <<"minimum">> => 0
          },
          <<"currency">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Валюта, символьный код согласно [ISO 4217](http://www.iso.org/iso/home/standards/currency_codes.htm).">>,
            <<"pattern">> => <<"^[A-Z]{3}$">>
          },
          <<"payer">> => #{
            <<"$ref">> => <<"#/definitions/Payer">>
          },
          <<"flow">> => #{
            <<"$ref">> => <<"#/definitions/PaymentFlow">>
          },
          <<"metadata">> => #{
            <<"type">> => <<"object">>,
            <<"description">> => <<"Связанные с платежом метаданные">>,
            <<"properties">> => #{ }
          },
          <<"statusChangedAt">> => #{
            <<"type">> => <<"string">>,
            <<"format">> => <<"date-time">>,
            <<"description">> => <<"Дата и время изменения статуса платежа">>
          },
          <<"transactionInfo">> => #{
            <<"$ref">> => <<"#/definitions/TransactionInfo">>
          },
          <<"makeRecurrent">> => #{
            <<"type">> => <<"boolean">>,
            <<"description">> => <<"Признак создания родительского рекуррентного платежа.\nУспешно проведеный платеж с этим признаком можно использовать как родительский в других рекуррентных платежах.\n">>,
            <<"default">> => false
          },
          <<"cart">> => #{
            <<"$ref">> => <<"#/definitions/InvoiceCart">>
          },
          <<"allocation">> => #{
            <<"$ref">> => <<"#/definitions/Allocation">>
          }
        }
      } ]
    },
    <<"PaymentStarted">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/InvoiceChange">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"payment">> ],
        <<"properties">> => #{
          <<"payment">> => #{
            <<"$ref">> => <<"#/definitions/Payment">>
          }
        }
      } ]
    },
    <<"PaymentStatus">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"status">> ],
      <<"properties">> => #{
        <<"status">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Статус платежа">>,
          <<"enum">> => [ <<"pending">>, <<"processed">>, <<"captured">>, <<"cancelled">>, <<"refunded">>, <<"failed">> ]
        },
        <<"error">> => #{
          <<"$ref">> => <<"#/definitions/PaymentError">>
        }
      }
    },
    <<"PaymentStatusChanged">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/InvoiceChange">>
      }, #{
        <<"$ref">> => <<"#/definitions/PaymentStatus">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"paymentID">> ],
        <<"properties">> => #{
          <<"paymentID">> => #{
            <<"type">> => <<"string">>
          }
        }
      } ]
    },
    <<"PaymentTerminal">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/PaymentMethod">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"providers">> ],
        <<"properties">> => #{
          <<"providers">> => #{
            <<"type">> => <<"array">>,
            <<"description">> => <<"Список провайдеров">>,
            <<"items">> => #{
              <<"type">> => <<"string">>,
              <<"example">> => <<"EUROSET">>,
              <<"description">> => <<"Провайдер терминальной сети.\n\nНабор провайдеров, доступных для проведения платежей, можно узнать, вызвав\nсоответствующую [операцию](#operation/getInvoicePaymentMethods) после создания инвойса.\n\nДополнительные детали провайдера можно узнать, вызвав [справочную операцию](#operation/getServiceProviderByID).\n">>
            }
          }
        }
      } ]
    },
    <<"PaymentTerminalData">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/PaymentTool">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"provider">> ],
        <<"properties">> => #{
          <<"provider">> => #{
            <<"type">> => <<"string">>,
            <<"example">> => <<"EUROSET">>,
            <<"description">> => <<"Провайдер терминальной сети.\n\nНабор провайдеров, доступных для проведения платежей, можно узнать, вызвав\nсоответствующую [операцию](#operation/getInvoicePaymentMethods) после создания инвойса.\n\nДополнительные детали провайдера можно узнать, вызвав [справочную операцию](#operation/getServiceProviderByID).\n">>
          },
          <<"metadata">> => #{
            <<"type">> => <<"object">>,
            <<"example">> => #{
              <<"type">> => <<"BankAccountRUS">>,
              <<"accountNumber">> => <<"40817810500000000035">>,
              <<"bankBIC">> => <<"044525716">>
            },
            <<"description">> => <<"Произвольные метаданные, дополнительно описывающие данный платёжный\nинструмент.\n">>,
            <<"properties">> => #{ }
          }
        },
        <<"description">> => <<"Платежный терминал">>
      } ]
    },
    <<"PaymentTerminalDetails">> => #{
      <<"required">> => [ <<"provider">> ],
      <<"properties">> => #{
        <<"provider">> => #{
          <<"type">> => <<"string">>,
          <<"example">> => <<"EUROSET">>,
          <<"description">> => <<"Провайдер терминальной сети.\n\nНабор провайдеров, доступных для проведения платежей, можно узнать, вызвав\nсоответствующую [операцию](#operation/getInvoicePaymentMethods) после создания инвойса.\n\nДополнительные детали провайдера можно узнать, вызвав [справочную операцию](#operation/getServiceProviderByID).\n">>
        }
      }
    },
    <<"PaymentTerminalProvider">> => #{
      <<"type">> => <<"string">>,
      <<"description">> => <<"Провайдер терминальной сети.\n\nНабор провайдеров, доступных для проведения платежей, можно узнать, вызвав\nсоответствующую [операцию](#operation/getInvoicePaymentMethods) после создания инвойса.\n\nДополнительные детали провайдера можно узнать, вызвав [справочную операцию](#operation/getServiceProviderByID).\n">>,
      <<"example">> => <<"EUROSET">>
    },
    <<"PaymentTerminalReceipt">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/UserInteraction">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"dueDate">>, <<"shortPaymentID">> ],
        <<"properties">> => #{
          <<"shortPaymentID">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Номер счета для оплаты через платежный терминал">>
          },
          <<"dueDate">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Дата и время окончания действия счета">>
          }
        }
      } ]
    },
    <<"PaymentTerms">> => #{
      <<"type">> => <<"object">>,
      <<"properties">> => #{
        <<"currencies">> => #{
          <<"type">> => <<"array">>,
          <<"items">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Валюта, символьный код согласно [ISO 4217](http://www.iso.org/iso/home/standards/currency_codes.htm).">>,
            <<"pattern">> => <<"^[A-Z]{3}$">>
          }
        },
        <<"categories">> => #{
          <<"type">> => <<"array">>,
          <<"items">> => #{
            <<"type">> => <<"integer">>,
            <<"format">> => <<"int32">>,
            <<"description">> => <<"Идентификаторы доступных категорий">>
          }
        }
      },
      <<"example">> => #{
        <<"categories">> => [ 0, 0 ],
        <<"currencies">> => [ <<"currencies">>, <<"currencies">> ]
      }
    },
    <<"PaymentTool">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"paymentToolType">> ],
      <<"discriminator">> => <<"paymentToolType">>,
      <<"properties">> => #{
        <<"paymentToolType">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Тип платежного средства">>,
          <<"enum">> => [ <<"CardData">>, <<"PaymentTerminalData">>, <<"DigitalWalletData">>, <<"TokenizedCardData">>, <<"CryptoWalletData">>, <<"MobileCommerceData">> ]
        }
      },
      <<"example">> => #{
        <<"paymentToolType">> => <<"CardData">>
      },
      <<"x-discriminator-is-enum">> => true
    },
    <<"PaymentToolDetails">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"detailsType">> ],
      <<"discriminator">> => <<"detailsType">>,
      <<"properties">> => #{
        <<"detailsType">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Тип информации о платежном средстве">>
        }
      },
      <<"description">> => <<"Детали платежного средства">>,
      <<"example">> => #{
        <<"detailsType">> => <<"detailsType">>
      }
    },
    <<"PaymentToolDetailsBankCard">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/PaymentToolDetails">>
      }, #{
        <<"$ref">> => <<"#/definitions/BankCardDetails">>
      } ]
    },
    <<"PaymentToolDetailsCryptoWallet">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/PaymentToolDetails">>
      }, #{
        <<"$ref">> => <<"#/definitions/CryptoWalletDetails">>
      } ]
    },
    <<"PaymentToolDetailsDigitalWallet">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/PaymentToolDetails">>
      }, #{
        <<"$ref">> => <<"#/definitions/DigitalWalletDetails">>
      } ]
    },
    <<"PaymentToolDetailsMobileCommerce">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/PaymentToolDetails">>
      }, #{
        <<"$ref">> => <<"#/definitions/MobileCommerceDetails">>
      } ]
    },
    <<"PaymentToolDetailsPaymentTerminal">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/PaymentToolDetails">>
      }, #{
        <<"$ref">> => <<"#/definitions/PaymentTerminalDetails">>
      } ]
    },
    <<"Payout">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"amount">>, <<"createdAt">>, <<"currency">>, <<"id">>, <<"payoutToolDetails">>, <<"shopID">> ],
      <<"properties">> => #{
        <<"id">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Идентификатор выплаты">>
        },
        <<"shopID">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Идентификатор магазина">>
        },
        <<"createdAt">> => #{
          <<"type">> => <<"string">>,
          <<"format">> => <<"date-time">>,
          <<"description">> => <<"Дата и время создания">>
        },
        <<"cancellationDetails">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Детали отмены выплаты">>,
          <<"maxLength">> => 1000
        },
        <<"amount">> => #{
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int64">>,
          <<"description">> => <<"Сумма выплаты в минорных денежных\nединицах, например в копейках в случае указания российских рублей в\nкачестве валюты.\n">>,
          <<"minimum">> => 1
        },
        <<"fee">> => #{
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int64">>,
          <<"description">> => <<"Комиссия системы, в минорных денежных единицах">>,
          <<"minimum">> => 0
        },
        <<"currency">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Валюта, символьный код согласно [ISO 4217](http://www.iso.org/iso/home/standards/currency_codes.htm).">>,
          <<"pattern">> => <<"^[A-Z]{3}$">>
        },
        <<"payoutToolDetails">> => #{
          <<"$ref">> => <<"#/definitions/PayoutToolDetails">>
        },
        <<"status">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Статус выплаты">>
        }
      },
      <<"example">> => #{
        <<"createdAt">> => <<"2000-01-23T04:56:07.000+00:00">>,
        <<"amount">> => 1,
        <<"payoutToolDetails">> => #{
          <<"detailsType">> => <<"detailsType">>
        },
        <<"cancellationDetails">> => <<"cancellationDetails">>,
        <<"fee">> => 0,
        <<"currency">> => <<"currency">>,
        <<"id">> => <<"id">>,
        <<"shopID">> => <<"shopID">>,
        <<"status">> => <<"status">>
      }
    },
    <<"PayoutID">> => #{
      <<"type">> => <<"string">>,
      <<"minLength">> => 1,
      <<"maxLength">> => 40,
      <<"description">> => <<"Идентификатор выплаты">>
    },
    <<"PayoutParams">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"amount">>, <<"currency">>, <<"payoutToolID">>, <<"shopID">> ],
      <<"properties">> => #{
        <<"id">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Идентификатор выплаты">>,
          <<"minLength">> => 1,
          <<"maxLength">> => 40
        },
        <<"shopID">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Идентификатор магазина">>
        },
        <<"partyID">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Уникальный в рамках платформы идентификатор участника.">>,
          <<"minLength">> => 1,
          <<"maxLength">> => 40
        },
        <<"payoutToolID">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Идентификатор инструмента выплаты">>
        },
        <<"amount">> => #{
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int64">>,
          <<"description">> => <<"Сумма выплаты в минорных денежных\nединицах, например в копейках в случае указания российских рублей в\nкачестве валюты.\n">>,
          <<"minimum">> => 1
        },
        <<"currency">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Валюта, символьный код согласно [ISO 4217](http://www.iso.org/iso/home/standards/currency_codes.htm).">>,
          <<"pattern">> => <<"^[A-Z]{3}$">>
        }
      },
      <<"example">> => #{
        <<"amount">> => 1,
        <<"currency">> => <<"currency">>,
        <<"id">> => <<"id">>,
        <<"shopID">> => <<"shopID">>,
        <<"partyID">> => <<"partyID">>,
        <<"payoutToolID">> => <<"payoutToolID">>
      }
    },
    <<"PayoutTool">> => #{
      <<"allOf">> => [ #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"id">> ],
        <<"properties">> => #{
          <<"id">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Идентификатор средства вывода">>
          }
        }
      }, #{
        <<"$ref">> => <<"#/definitions/PayoutToolParams">>
      } ],
      <<"description">> => <<"Средство вывода">>
    },
    <<"PayoutToolDetails">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"detailsType">> ],
      <<"discriminator">> => <<"detailsType">>,
      <<"properties">> => #{
        <<"detailsType">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Тип средства вывода">>
        }
      },
      <<"description">> => <<"Данные средства вывода">>,
      <<"example">> => #{
        <<"detailsType">> => <<"detailsType">>
      }
    },
    <<"PayoutToolDetailsBankAccount">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/PayoutToolDetails">>
      }, #{
        <<"$ref">> => <<"#/definitions/BankAccount">>
      } ]
    },
    <<"PayoutToolDetailsInternationalBankAccount">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/PayoutToolDetails">>
      }, #{
        <<"$ref">> => <<"#/definitions/InternationalBankAccount">>
      } ]
    },
    <<"PayoutToolDetailsPaymentInstitutionAccount">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/PayoutToolDetails">>
      }, #{
        <<"$ref">> => <<"#/definitions/PaymentInstitutionAccount">>
      } ]
    },
    <<"PayoutToolDetailsWalletInfo">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/PayoutToolDetails">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"walletID">> ],
        <<"properties">> => #{
          <<"walletID">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Идентификатор кошелька">>,
            <<"minLength">> => 1,
            <<"maxLength">> => 40
          }
        }
      } ]
    },
    <<"PayoutToolParams">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"currency">>, <<"details">> ],
      <<"properties">> => #{
        <<"currency">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Валюта, в которой производится вывод">>
        },
        <<"details">> => #{
          <<"$ref">> => <<"#/definitions/PayoutToolDetails">>
        }
      }
    },
    <<"PowerOfAttorney">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/RepresentativeDocument">>
      }, #{
        <<"$ref">> => <<"#/definitions/LegalAgreement">>
      } ]
    },
    <<"PrivateEntity">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/Contractor">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"entityType">> ],
        <<"discriminator">> => <<"entityType">>,
        <<"properties">> => #{
          <<"entityType">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Тип физ. лица">>,
            <<"enum">> => [ <<"RussianPrivateEntity">> ]
          }
        }
      } ],
      <<"description">> => <<"Физическое лицо">>
    },
    <<"ProcessingDeadline">> => #{
      <<"type">> => <<"string">>,
      <<"minLength">> => 1,
      <<"maxLength">> => 40,
      <<"description">> => <<"Максимальное время обработки платежа">>,
      <<"example">> => <<"30m">>
    },
    <<"QrCodeDisplayRequest">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/UserInteraction">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"qrCode">> ],
        <<"properties">> => #{
          <<"qrCode">> => #{
            <<"type">> => <<"string">>,
            <<"format">> => <<"binary">>,
            <<"description">> => <<"Содержимое QR-кода, записанное в виде потока байт">>
          }
        }
      } ]
    },
    <<"RealmMode">> => #{
      <<"type">> => <<"string">>,
      <<"description">> => <<"Режим рабочего окружения платежной организации">>,
      <<"enum">> => [ <<"test">>, <<"live">> ]
    },
    <<"Reason">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"reason">> ],
      <<"properties">> => #{
        <<"reason">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Причина совершения операции">>,
          <<"maxLength">> => 1000
        }
      },
      <<"example">> => #{
        <<"reason">> => <<"reason">>
      }
    },
    <<"RecurrentPayer">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/Payer">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"contactInfo">>, <<"recurrentParentPayment">> ],
        <<"properties">> => #{
          <<"contactInfo">> => #{
            <<"$ref">> => <<"#/definitions/ContactInfo">>
          },
          <<"recurrentParentPayment">> => #{
            <<"$ref">> => <<"#/definitions/PaymentRecurrentParent">>
          },
          <<"paymentToolDetails">> => #{
            <<"$ref">> => <<"#/definitions/PaymentToolDetails">>
          }
        }
      } ],
      <<"description">> => <<"Многоразовое платежное средство на основе другого платежа">>
    },
    <<"Redirect">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/UserInteraction">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"request">> ],
        <<"properties">> => #{
          <<"request">> => #{
            <<"$ref">> => <<"#/definitions/BrowserRequest">>
          }
        }
      } ]
    },
    <<"Refund">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"amount">>, <<"createdAt">>, <<"currency">>, <<"id">>, <<"status">> ],
      <<"properties">> => #{
        <<"id">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Идентификатор возврата">>
        },
        <<"externalID">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Уникальный в рамках платформы идентификатор сущности для данного участника.\n\nИспользуется для обеспечения идемпотентности запроса.\n">>,
          <<"minLength">> => 1,
          <<"maxLength">> => 40
        },
        <<"createdAt">> => #{
          <<"type">> => <<"string">>,
          <<"format">> => <<"date-time">>,
          <<"description">> => <<"Дата и время осуществления">>
        },
        <<"amount">> => #{
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int64">>,
          <<"description">> => <<"Сумма возврата, в минорных денежных единицах, например в копейках в случае указания российских рублей в качестве валюты.\n">>,
          <<"minimum">> => 1
        },
        <<"currency">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Валюта, символьный код согласно [ISO 4217](http://www.iso.org/iso/home/standards/currency_codes.htm).">>,
          <<"pattern">> => <<"^[A-Z]{3}$">>
        },
        <<"reason">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Причина осуществления возврата">>
        },
        <<"cart">> => #{
          <<"type">> => <<"array">>,
          <<"description">> => <<"Итоговая корзина предоставляемых товаров и услуг, которая должна формироваться из корзины инвойса исключением позиций, по которым производился возврат. Сумма корзины должна совпадать с суммой платежа за вычетом суммы возврата.\n">>,
          <<"items">> => #{
            <<"$ref">> => <<"#/definitions/InvoiceLine">>
          },
          <<"maxItems">> => 100,
          <<"minItems">> => 1
        },
        <<"allocation">> => #{
          <<"type">> => <<"array">>,
          <<"description">> => <<"Итоговое распределение денежных средств, которое должно формироваться из распределения инвойса исключением позиций, по которым производится возврат.\n">>,
          <<"items">> => #{
            <<"$ref">> => <<"#/definitions/AllocationTransaction">>
          },
          <<"maxItems">> => 100,
          <<"minItems">> => 1
        },
        <<"status">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Статус возврата">>,
          <<"enum">> => [ <<"pending">>, <<"succeeded">>, <<"failed">> ]
        },
        <<"error">> => #{
          <<"$ref">> => <<"#/definitions/Refund_error">>
        }
      },
      <<"example">> => #{
        <<"createdAt">> => <<"2000-01-23T04:56:07.000+00:00">>,
        <<"reason">> => <<"reason">>,
        <<"amount">> => 1,
        <<"allocation">> => [ #{
          <<"allocationBodyType">> => <<"AllocationBodyAmount">>,
          <<"cart">> => <<"">>,
          <<"target">> => #{
            <<"allocationTargetType">> => <<"AllocationTargetShop">>
          }
        }, #{
          <<"allocationBodyType">> => <<"AllocationBodyAmount">>,
          <<"cart">> => <<"">>,
          <<"target">> => #{
            <<"allocationTargetType">> => <<"AllocationTargetShop">>
          }
        }, #{
          <<"allocationBodyType">> => <<"AllocationBodyAmount">>,
          <<"cart">> => <<"">>,
          <<"target">> => #{
            <<"allocationTargetType">> => <<"AllocationTargetShop">>
          }
        }, #{
          <<"allocationBodyType">> => <<"AllocationBodyAmount">>,
          <<"cart">> => <<"">>,
          <<"target">> => #{
            <<"allocationTargetType">> => <<"AllocationTargetShop">>
          }
        }, #{
          <<"allocationBodyType">> => <<"AllocationBodyAmount">>,
          <<"cart">> => <<"">>,
          <<"target">> => #{
            <<"allocationTargetType">> => <<"AllocationTargetShop">>
          }
        }, #{
          <<"allocationBodyType">> => <<"AllocationBodyAmount">>,
          <<"cart">> => <<"">>,
          <<"target">> => #{
            <<"allocationTargetType">> => <<"AllocationTargetShop">>
          }
        }, #{
          <<"allocationBodyType">> => <<"AllocationBodyAmount">>,
          <<"cart">> => <<"">>,
          <<"target">> => #{
            <<"allocationTargetType">> => <<"AllocationTargetShop">>
          }
        }, #{
          <<"allocationBodyType">> => <<"AllocationBodyAmount">>,
          <<"cart">> => <<"">>,
          <<"target">> => #{
            <<"allocationTargetType">> => <<"AllocationTargetShop">>
          }
        }, #{
          <<"allocationBodyType">> => <<"AllocationBodyAmount">>,
          <<"cart">> => <<"">>,
          <<"target">> => #{
            <<"allocationTargetType">> => <<"AllocationTargetShop">>
          }
        }, #{
          <<"allocationBodyType">> => <<"AllocationBodyAmount">>,
          <<"cart">> => <<"">>,
          <<"target">> => #{
            <<"allocationTargetType">> => <<"AllocationTargetShop">>
          }
        } ],
        <<"externalID">> => <<"externalID">>,
        <<"currency">> => <<"currency">>,
        <<"id">> => <<"id">>,
        <<"error">> => #{
          <<"code">> => <<"code">>,
          <<"message">> => <<"message">>
        },
        <<"cart">> => [ #{
          <<"product">> => <<"product">>,
          <<"quantity">> => 1,
          <<"cost">> => 1,
          <<"price">> => 1,
          <<"taxMode">> => #{
            <<"type">> => <<"InvoiceLineTaxVAT">>
          }
        }, #{
          <<"product">> => <<"product">>,
          <<"quantity">> => 1,
          <<"cost">> => 1,
          <<"price">> => 1,
          <<"taxMode">> => #{
            <<"type">> => <<"InvoiceLineTaxVAT">>
          }
        }, #{
          <<"product">> => <<"product">>,
          <<"quantity">> => 1,
          <<"cost">> => 1,
          <<"price">> => 1,
          <<"taxMode">> => #{
            <<"type">> => <<"InvoiceLineTaxVAT">>
          }
        }, #{
          <<"product">> => <<"product">>,
          <<"quantity">> => 1,
          <<"cost">> => 1,
          <<"price">> => 1,
          <<"taxMode">> => #{
            <<"type">> => <<"InvoiceLineTaxVAT">>
          }
        }, #{
          <<"product">> => <<"product">>,
          <<"quantity">> => 1,
          <<"cost">> => 1,
          <<"price">> => 1,
          <<"taxMode">> => #{
            <<"type">> => <<"InvoiceLineTaxVAT">>
          }
        }, #{
          <<"product">> => <<"product">>,
          <<"quantity">> => 1,
          <<"cost">> => 1,
          <<"price">> => 1,
          <<"taxMode">> => #{
            <<"type">> => <<"InvoiceLineTaxVAT">>
          }
        }, #{
          <<"product">> => <<"product">>,
          <<"quantity">> => 1,
          <<"cost">> => 1,
          <<"price">> => 1,
          <<"taxMode">> => #{
            <<"type">> => <<"InvoiceLineTaxVAT">>
          }
        }, #{
          <<"product">> => <<"product">>,
          <<"quantity">> => 1,
          <<"cost">> => 1,
          <<"price">> => 1,
          <<"taxMode">> => #{
            <<"type">> => <<"InvoiceLineTaxVAT">>
          }
        }, #{
          <<"product">> => <<"product">>,
          <<"quantity">> => 1,
          <<"cost">> => 1,
          <<"price">> => 1,
          <<"taxMode">> => #{
            <<"type">> => <<"InvoiceLineTaxVAT">>
          }
        }, #{
          <<"product">> => <<"product">>,
          <<"quantity">> => 1,
          <<"cost">> => 1,
          <<"price">> => 1,
          <<"taxMode">> => #{
            <<"type">> => <<"InvoiceLineTaxVAT">>
          }
        } ],
        <<"status">> => <<"pending">>
      }
    },
    <<"RefundParams">> => #{
      <<"type">> => <<"object">>,
      <<"properties">> => #{
        <<"externalID">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Уникальный в рамках платформы идентификатор сущности для данного участника.\n\nИспользуется для обеспечения идемпотентности запроса.\n">>,
          <<"minLength">> => 1,
          <<"maxLength">> => 40
        },
        <<"amount">> => #{
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int64">>,
          <<"description">> => <<"Сумма возврата, в минорных денежных единицах,\nнапример в копейках в случае указания российских рублей в качестве\nвалюты.\n">>,
          <<"minimum">> => 1
        },
        <<"currency">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Валюта, символьный код согласно [ISO 4217](http://www.iso.org/iso/home/standards/currency_codes.htm).">>,
          <<"pattern">> => <<"^[A-Z]{3}$">>
        },
        <<"reason">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Причина совершения возврата">>,
          <<"maxLength">> => 1000
        },
        <<"cart">> => #{
          <<"type">> => <<"array">>,
          <<"description">> => <<"Итоговая корзина предоставляемых товаров и услуг, которая должна формироваться из корзины инвойса исключением позиций, по которым производится возврат. Сумма корзины должна совпадать с суммой платежа за вычетом суммы осуществляемого возврата.\n">>,
          <<"items">> => #{
            <<"$ref">> => <<"#/definitions/InvoiceLine">>
          },
          <<"maxItems">> => 100,
          <<"minItems">> => 1
        },
        <<"allocation">> => #{
          <<"type">> => <<"array">>,
          <<"description">> => <<"Распределение денежных средств, которое должно формироваться из позиций, по которым производится возврат. Сумма всех транзакций распределения должна совпадать с суммой возврата.\n">>,
          <<"items">> => #{
            <<"$ref">> => <<"#/definitions/AllocationTransaction">>
          },
          <<"maxItems">> => 100,
          <<"minItems">> => 1
        }
      },
      <<"example">> => #{
        <<"reason">> => <<"reason">>,
        <<"amount">> => 1,
        <<"allocation">> => [ #{
          <<"allocationBodyType">> => <<"AllocationBodyAmount">>,
          <<"cart">> => <<"">>,
          <<"target">> => #{
            <<"allocationTargetType">> => <<"AllocationTargetShop">>
          }
        }, #{
          <<"allocationBodyType">> => <<"AllocationBodyAmount">>,
          <<"cart">> => <<"">>,
          <<"target">> => #{
            <<"allocationTargetType">> => <<"AllocationTargetShop">>
          }
        }, #{
          <<"allocationBodyType">> => <<"AllocationBodyAmount">>,
          <<"cart">> => <<"">>,
          <<"target">> => #{
            <<"allocationTargetType">> => <<"AllocationTargetShop">>
          }
        }, #{
          <<"allocationBodyType">> => <<"AllocationBodyAmount">>,
          <<"cart">> => <<"">>,
          <<"target">> => #{
            <<"allocationTargetType">> => <<"AllocationTargetShop">>
          }
        }, #{
          <<"allocationBodyType">> => <<"AllocationBodyAmount">>,
          <<"cart">> => <<"">>,
          <<"target">> => #{
            <<"allocationTargetType">> => <<"AllocationTargetShop">>
          }
        }, #{
          <<"allocationBodyType">> => <<"AllocationBodyAmount">>,
          <<"cart">> => <<"">>,
          <<"target">> => #{
            <<"allocationTargetType">> => <<"AllocationTargetShop">>
          }
        }, #{
          <<"allocationBodyType">> => <<"AllocationBodyAmount">>,
          <<"cart">> => <<"">>,
          <<"target">> => #{
            <<"allocationTargetType">> => <<"AllocationTargetShop">>
          }
        }, #{
          <<"allocationBodyType">> => <<"AllocationBodyAmount">>,
          <<"cart">> => <<"">>,
          <<"target">> => #{
            <<"allocationTargetType">> => <<"AllocationTargetShop">>
          }
        }, #{
          <<"allocationBodyType">> => <<"AllocationBodyAmount">>,
          <<"cart">> => <<"">>,
          <<"target">> => #{
            <<"allocationTargetType">> => <<"AllocationTargetShop">>
          }
        }, #{
          <<"allocationBodyType">> => <<"AllocationBodyAmount">>,
          <<"cart">> => <<"">>,
          <<"target">> => #{
            <<"allocationTargetType">> => <<"AllocationTargetShop">>
          }
        } ],
        <<"externalID">> => <<"externalID">>,
        <<"currency">> => <<"currency">>,
        <<"cart">> => [ #{
          <<"product">> => <<"product">>,
          <<"quantity">> => 1,
          <<"cost">> => 1,
          <<"price">> => 1,
          <<"taxMode">> => #{
            <<"type">> => <<"InvoiceLineTaxVAT">>
          }
        }, #{
          <<"product">> => <<"product">>,
          <<"quantity">> => 1,
          <<"cost">> => 1,
          <<"price">> => 1,
          <<"taxMode">> => #{
            <<"type">> => <<"InvoiceLineTaxVAT">>
          }
        }, #{
          <<"product">> => <<"product">>,
          <<"quantity">> => 1,
          <<"cost">> => 1,
          <<"price">> => 1,
          <<"taxMode">> => #{
            <<"type">> => <<"InvoiceLineTaxVAT">>
          }
        }, #{
          <<"product">> => <<"product">>,
          <<"quantity">> => 1,
          <<"cost">> => 1,
          <<"price">> => 1,
          <<"taxMode">> => #{
            <<"type">> => <<"InvoiceLineTaxVAT">>
          }
        }, #{
          <<"product">> => <<"product">>,
          <<"quantity">> => 1,
          <<"cost">> => 1,
          <<"price">> => 1,
          <<"taxMode">> => #{
            <<"type">> => <<"InvoiceLineTaxVAT">>
          }
        }, #{
          <<"product">> => <<"product">>,
          <<"quantity">> => 1,
          <<"cost">> => 1,
          <<"price">> => 1,
          <<"taxMode">> => #{
            <<"type">> => <<"InvoiceLineTaxVAT">>
          }
        }, #{
          <<"product">> => <<"product">>,
          <<"quantity">> => 1,
          <<"cost">> => 1,
          <<"price">> => 1,
          <<"taxMode">> => #{
            <<"type">> => <<"InvoiceLineTaxVAT">>
          }
        }, #{
          <<"product">> => <<"product">>,
          <<"quantity">> => 1,
          <<"cost">> => 1,
          <<"price">> => 1,
          <<"taxMode">> => #{
            <<"type">> => <<"InvoiceLineTaxVAT">>
          }
        }, #{
          <<"product">> => <<"product">>,
          <<"quantity">> => 1,
          <<"cost">> => 1,
          <<"price">> => 1,
          <<"taxMode">> => #{
            <<"type">> => <<"InvoiceLineTaxVAT">>
          }
        }, #{
          <<"product">> => <<"product">>,
          <<"quantity">> => 1,
          <<"cost">> => 1,
          <<"price">> => 1,
          <<"taxMode">> => #{
            <<"type">> => <<"InvoiceLineTaxVAT">>
          }
        } ]
      }
    },
    <<"RefundSearchResult">> => #{
      <<"allOf">> => [ #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"invoiceID">>, <<"paymentID">> ],
        <<"properties">> => #{
          <<"invoiceID">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Идентификатор инвойса">>
          },
          <<"paymentID">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Идентификатор платежа">>
          }
        }
      }, #{
        <<"$ref">> => <<"#/definitions/Refund">>
      } ]
    },
    <<"RefundStarted">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/InvoiceChange">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"paymentID">>, <<"refund">> ],
        <<"properties">> => #{
          <<"paymentID">> => #{
            <<"type">> => <<"string">>
          },
          <<"refund">> => #{
            <<"$ref">> => <<"#/definitions/Refund">>
          }
        }
      } ]
    },
    <<"RefundStatus">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"status">> ],
      <<"properties">> => #{
        <<"status">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Статус возврата">>,
          <<"enum">> => [ <<"pending">>, <<"succeeded">>, <<"failed">> ]
        },
        <<"error">> => #{
          <<"$ref">> => <<"#/definitions/Refund_error">>
        }
      }
    },
    <<"RefundStatusChanged">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/InvoiceChange">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"paymentID">>, <<"refundID">> ],
        <<"properties">> => #{
          <<"paymentID">> => #{
            <<"type">> => <<"string">>
          },
          <<"refundID">> => #{
            <<"type">> => <<"string">>
          }
        }
      }, #{
        <<"$ref">> => <<"#/definitions/RefundStatus">>
      } ]
    },
    <<"RegisteredUser">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/Contractor">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"email">> ],
        <<"properties">> => #{
          <<"email">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Электронная почта, идентифицирующая пользователя">>
          }
        }
      } ],
      <<"description">> => <<"Зарегистрированный пользователь системы">>
    },
    <<"ReportingPreferences">> => #{
      <<"type">> => <<"object">>,
      <<"properties">> => #{
        <<"serviceAcceptanceActPreferences">> => #{
          <<"$ref">> => <<"#/definitions/ServiceAcceptanceActPreferences">>
        }
      },
      <<"description">> => <<"Настройки выгрузки автоматической отчетности">>,
      <<"example">> => #{
        <<"serviceAcceptanceActPreferences">> => #{
          <<"scheduleID">> => 6,
          <<"signer">> => #{
            <<"document">> => #{
              <<"representativeDocumentType">> => <<"ArticlesOfAssociation">>
            },
            <<"fullName">> => <<"fullName">>,
            <<"position">> => <<"position">>
          }
        }
      }
    },
    <<"ReportLink">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"url">> ],
      <<"properties">> => #{
        <<"url">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"URL файла">>
        }
      }
    },
    <<"ReportParams">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"fromTime">>, <<"reportType">>, <<"toTime">> ],
      <<"properties">> => #{
        <<"reportType">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Тип отчета">>,
          <<"enum">> => [ <<"paymentRegistry">> ]
        },
        <<"fromTime">> => #{
          <<"type">> => <<"string">>,
          <<"format">> => <<"date-time">>,
          <<"description">> => <<"Начало временного отрезка">>
        },
        <<"toTime">> => #{
          <<"type">> => <<"string">>,
          <<"format">> => <<"date-time">>,
          <<"description">> => <<"Конец временного отрезка">>
        }
      }
    },
    <<"Representative">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"document">>, <<"fullName">>, <<"position">> ],
      <<"properties">> => #{
        <<"position">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Наименование должности ЕИО/представителя">>
        },
        <<"fullName">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"ФИО ЕИО/представителя">>
        },
        <<"document">> => #{
          <<"$ref">> => <<"#/definitions/RepresentativeDocument">>
        }
      },
      <<"description">> => <<"ЕИО/Представитель">>,
      <<"example">> => #{
        <<"document">> => #{
          <<"representativeDocumentType">> => <<"ArticlesOfAssociation">>
        },
        <<"fullName">> => <<"fullName">>,
        <<"position">> => <<"position">>
      }
    },
    <<"RepresentativeDocument">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"representativeDocumentType">> ],
      <<"discriminator">> => <<"representativeDocumentType">>,
      <<"properties">> => #{
        <<"representativeDocumentType">> => #{
          <<"type">> => <<"string">>,
          <<"enum">> => [ <<"ArticlesOfAssociation">>, <<"PowerOfAttorney">> ]
        }
      },
      <<"description">> => <<"Документ, на основании которого действует ЕИО/представитель">>,
      <<"example">> => #{
        <<"representativeDocumentType">> => <<"ArticlesOfAssociation">>
      },
      <<"x-discriminator-is-enum">> => true
    },
    <<"RussianLegalEntity">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/LegalEntity">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"actualAddress">>, <<"bankAccount">>, <<"inn">>, <<"postAddress">>, <<"registeredName">>, <<"registeredNumber">>, <<"representativeDocument">>, <<"representativeFullName">>, <<"representativePosition">> ],
        <<"properties">> => #{
          <<"registeredName">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Зарегистрированное наименование юридического лица\n">>,
            <<"maxLength">> => 100
          },
          <<"registeredNumber">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Регистрационный номер,\n[ОГРН](https://ru.wikipedia.org/wiki/Основной_государственный_регистрационный_номер) или\n[ОГРНИП](https://ru.wikipedia.org/wiki/Основной_государственный_регистрационный_номер_индивидуального_предпринимателя)\n">>,
            <<"pattern">> => <<"^(\\d{13}|\\d{15})$">>
          },
          <<"inn">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"[ИНН](https://ru.wikipedia.org/wiki/Идентификационный_номер_налогоплательщика)\n">>,
            <<"pattern">> => <<"^(\\d{10}|\\d{12})$">>
          },
          <<"actualAddress">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Почтовый адрес места нахождения\n">>,
            <<"maxLength">> => 1000
          },
          <<"postAddress">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Почтовый адрес для отправки корреспонденции\n">>,
            <<"maxLength">> => 1000
          },
          <<"representativePosition">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Наименование должности\n[ЕИО](https://ru.wikipedia.org/wiki/Исполнительный_орган_общества) или его представителя\n">>,
            <<"maxLength">> => 100
          },
          <<"representativeFullName">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"ФИО [ЕИО](https://ru.wikipedia.org/wiki/Исполнительный_орган_общества) или его представителя\n">>,
            <<"maxLength">> => 100
          },
          <<"representativeDocument">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Идентификационные данные документа, на основании которого действует\n[ЕИО](https://ru.wikipedia.org/wiki/Исполнительный_орган_общества) или его представитель\n">>,
            <<"maxLength">> => 1000
          },
          <<"bankAccount">> => #{
            <<"$ref">> => <<"#/definitions/BankAccount">>
          }
        }
      } ],
      <<"description">> => <<"Юридическое лицо, ведущее деятельность под юрисдикцией РФ">>
    },
    <<"RussianPrivateEntity">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/PrivateEntity">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"contactInfo">>, <<"firstName">>, <<"middleName">>, <<"secondName">> ],
        <<"properties">> => #{
          <<"firstName">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Имя">>,
            <<"maxLength">> => 200
          },
          <<"secondName">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Фамилия">>,
            <<"maxLength">> => 200
          },
          <<"middleName">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Отчество">>,
            <<"maxLength">> => 200
          },
          <<"contactInfo">> => #{
            <<"$ref">> => <<"#/definitions/ContactInfo">>
          }
        }
      } ],
      <<"description">> => <<"Физическое лицо под юрисдикцией РФ">>
    },
    <<"SamsungPay">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/TokenizedCardData">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"referenceID">>, <<"serviceID">> ],
        <<"properties">> => #{
          <<"serviceID">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Идентификатор сервиса в Samsung Pay">>
          },
          <<"referenceID">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Идентификатор токена в Samsung Pay">>
          }
        },
        <<"description">> => <<"Платежные данные Samsung Pay">>
      } ]
    },
    <<"Schedule">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"name">>, <<"scheduleID">> ],
      <<"properties">> => #{
        <<"scheduleID">> => #{
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int32">>
        },
        <<"name">> => #{
          <<"type">> => <<"string">>,
          <<"maxLength">> => 100
        },
        <<"description">> => #{
          <<"type">> => <<"string">>,
          <<"maxLength">> => 1000
        }
      },
      <<"description">> => <<"Расписание">>,
      <<"example">> => #{
        <<"name">> => <<"name">>,
        <<"description">> => <<"description">>,
        <<"scheduleID">> => 0
      }
    },
    <<"ServiceAcceptanceActPreferences">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"scheduleID">>, <<"signer">> ],
      <<"properties">> => #{
        <<"scheduleID">> => #{
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int32">>,
          <<"description">> => <<"Идентификатор расписания выгрузок">>
        },
        <<"signer">> => #{
          <<"$ref">> => <<"#/definitions/Representative">>
        }
      },
      <<"description">> => <<"Настройки выгрузки актов">>,
      <<"example">> => #{
        <<"scheduleID">> => 6,
        <<"signer">> => #{
          <<"document">> => #{
            <<"representativeDocumentType">> => <<"ArticlesOfAssociation">>
          },
          <<"fullName">> => <<"fullName">>,
          <<"position">> => <<"position">>
        }
      }
    },
    <<"ServiceProvider">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"id">> ],
      <<"properties">> => #{
        <<"id">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Идентификатор провайдера в системе">>,
          <<"maxLength">> => 100
        },
        <<"brandName">> => #{
          <<"type">> => <<"string">>,
          <<"example">> => <<"Nubank">>,
          <<"description">> => <<"Название провайдера, под которым он известен широкой публике">>,
          <<"maxLength">> => 100
        },
        <<"category">> => #{
          <<"type">> => <<"string">>,
          <<"example">> => <<"onlinebanking">>,
          <<"description">> => <<"Категория провайдера.\nМожет использоваться для задач презентации, например для группировки\nдоступных методов оплаты по категории их провайдеров, если таковая известна.\n">>,
          <<"maxLength">> => 100
        },
        <<"metadata">> => #{
          <<"type">> => <<"object">>,
          <<"example">> => #{
            <<"dev.vality.checkout">> => #{
              <<"brandLogo">> => #{
                <<"banner">> => <<"/assets/brands/paypal.svg">>
              },
              <<"localization">> => #{
                <<"name">> => #{
                  <<"ja_JP">> => <<"ヱヴァンゲリヲン">>
                }
              }
            }
          },
          <<"description">> => <<"Произвольные, разделённые по пространствам имён метаданные, дополнительно\nописывающие данного провайдера для различных потребителей.\n">>,
          <<"properties">> => #{ }
        }
      },
      <<"description">> => <<"Провайдер платёжных сервисов.\n\nСторонняя организация, которая предоставляет платёжные услуги, например обслуживает\nсистему электронных кошельков или платёжных терминалов.\n">>,
      <<"example">> => #{
        <<"brandName">> => <<"Nubank">>,
        <<"metadata">> => #{
          <<"dev.vality.checkout">> => #{
            <<"brandLogo">> => #{
              <<"banner">> => <<"/assets/brands/paypal.svg">>
            },
            <<"localization">> => #{
              <<"name">> => #{
                <<"ja_JP">> => <<"ヱヴァンゲリヲン">>
              }
            }
          }
        },
        <<"id">> => <<"id">>,
        <<"category">> => <<"onlinebanking">>
      }
    },
    <<"Shop">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"categoryID">>, <<"contractID">>, <<"createdAt">>, <<"details">>, <<"id">>, <<"isBlocked">>, <<"isSuspended">>, <<"location">> ],
      <<"properties">> => #{
        <<"id">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Идентификатор магазина">>
        },
        <<"createdAt">> => #{
          <<"type">> => <<"string">>,
          <<"format">> => <<"date-time">>,
          <<"description">> => <<"Дата и время создания">>
        },
        <<"isBlocked">> => #{
          <<"type">> => <<"boolean">>,
          <<"description">> => <<"Заблокирован ли магазин?">>
        },
        <<"isSuspended">> => #{
          <<"type">> => <<"boolean">>,
          <<"description">> => <<"Приостановлены ли операции в рамках магазина?">>
        },
        <<"currency">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Валюта, символьный код согласно [ISO 4217](http://www.iso.org/iso/home/standards/currency_codes.htm).">>,
          <<"pattern">> => <<"^[A-Z]{3}$">>
        },
        <<"categoryID">> => #{
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int32">>,
          <<"description">> => <<"Идентификатор категории товаров и услуг, предлагаемых в этом магазине\n">>
        },
        <<"location">> => #{
          <<"$ref">> => <<"#/definitions/ShopLocation">>
        },
        <<"details">> => #{
          <<"$ref">> => <<"#/definitions/ShopDetails">>
        },
        <<"contractID">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Идентификатор договора, на основании которого производится обслуживание\nмагазина\n">>
        },
        <<"payoutToolID">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Идентификатор средства вывода в рамках контракта, используемое в процессе\nвывода по магазину\n">>
        },
        <<"scheduleID">> => #{
          <<"type">> => <<"integer">>,
          <<"format">> => <<"int32">>,
          <<"description">> => <<"Идентификатор расписания выводов">>
        }
      },
      <<"description">> => <<"Данные магазина">>,
      <<"example">> => #{
        <<"createdAt">> => <<"2000-01-23T04:56:07.000+00:00">>,
        <<"isSuspended">> => true,
        <<"isBlocked">> => true,
        <<"contractID">> => <<"contractID">>,
        <<"currency">> => <<"currency">>,
        <<"location">> => #{
          <<"locationType">> => <<"locationType">>
        },
        <<"details">> => #{
          <<"name">> => <<"name">>,
          <<"description">> => <<"description">>
        },
        <<"id">> => <<"id">>,
        <<"categoryID">> => 0,
        <<"scheduleID">> => 6,
        <<"payoutToolID">> => <<"payoutToolID">>
      }
    },
    <<"ShopDetails">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"name">> ],
      <<"properties">> => #{
        <<"name">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Название магазина">>,
          <<"maxLength">> => 100
        },
        <<"description">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Краткое описание">>,
          <<"maxLength">> => 1000
        }
      },
      <<"example">> => #{
        <<"name">> => <<"name">>,
        <<"description">> => <<"description">>
      }
    },
    <<"ShopLocation">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"locationType">> ],
      <<"discriminator">> => <<"locationType">>,
      <<"properties">> => #{
        <<"locationType">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Тип местоположения">>
        }
      },
      <<"description">> => <<"Местоположение магазина, по которому можно его найти">>,
      <<"example">> => #{
        <<"locationType">> => <<"locationType">>
      }
    },
    <<"ShopLocationUrl">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/ShopLocation">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"url">> ],
        <<"properties">> => #{
          <<"url">> => #{
            <<"type">> => <<"string">>,
            <<"format">> => <<"uri">>,
            <<"description">> => <<"URL сайта магазина">>,
            <<"maxLength">> => 1000
          }
        }
      } ],
      <<"description">> => <<"Местоположение в Интернете">>
    },
    <<"SubError">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"code">> ],
      <<"properties">> => #{
        <<"code">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Детализация кода ошибки">>
        },
        <<"subError">> => #{
          <<"$ref">> => <<"#/definitions/SubError">>
        }
      },
      <<"description">> => <<"Детализация описания ошибки\n">>,
      <<"example">> => #{
        <<"code">> => <<"code">>
      }
    },
    <<"TokenizedCardData">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/PaymentTool">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"provider">> ],
        <<"discriminator">> => <<"provider">>,
        <<"properties">> => #{
          <<"provider">> => #{
            <<"type">> => <<"string">>,
            <<"enum">> => [ <<"ApplePay">>, <<"GooglePay">>, <<"SamsungPay">>, <<"YandexPay">> ]
          }
        },
        <<"description">> => <<"Токенизированная банковская карта">>
      } ]
    },
    <<"TradeBloc">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"id">>, <<"name">> ],
      <<"properties">> => #{
        <<"id">> => #{
          <<"type">> => <<"string">>
        },
        <<"name">> => #{
          <<"type">> => <<"string">>,
          <<"maxLength">> => 200
        },
        <<"description">> => #{
          <<"type">> => <<"string">>,
          <<"maxLength">> => 1000
        }
      },
      <<"description">> => <<"Торговый Блок">>,
      <<"example">> => #{
        <<"name">> => <<"name">>,
        <<"description">> => <<"description">>,
        <<"id">> => <<"id">>
      }
    },
    <<"TransactionInfo">> => #{
      <<"type">> => <<"object">>,
      <<"properties">> => #{
        <<"rrn">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Retrieval Reference Number">>,
          <<"pattern">> => <<"^[a-zA-Z0-9]{4,20}$">>
        },
        <<"approvalCode">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Authorization Approval Code">>
        }
      },
      <<"description">> => <<"Информация о транзакции">>,
      <<"example">> => #{
        <<"approvalCode">> => <<"approvalCode">>,
        <<"rrn">> => <<"rrn">>
      }
    },
    <<"UserInteraction">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"interactionType">> ],
      <<"discriminator">> => <<"interactionType">>,
      <<"properties">> => #{
        <<"interactionType">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Тип взаимодействия с пользователем">>
        }
      }
    },
    <<"UserInteractionForm">> => #{
      <<"type">> => <<"array">>,
      <<"description">> => <<"Форма для отправки средствами браузера">>,
      <<"items">> => #{
        <<"$ref">> => <<"#/definitions/UserInteractionForm_inner">>
      }
    },
    <<"Webhook">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"scope">>, <<"url">> ],
      <<"properties">> => #{
        <<"id">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Идентификатор webhook'а\n">>,
          <<"readOnly">> => true
        },
        <<"active">> => #{
          <<"type">> => <<"boolean">>,
          <<"description">> => <<"Включена ли в данный момент доставка оповещений?\n">>,
          <<"readOnly">> => true
        },
        <<"scope">> => #{
          <<"$ref">> => <<"#/definitions/WebhookScope">>
        },
        <<"partyID">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Уникальный в рамках платформы идентификатор участника.">>,
          <<"minLength">> => 1,
          <<"maxLength">> => 40
        },
        <<"url">> => #{
          <<"type">> => <<"string">>,
          <<"format">> => <<"http-url">>,
          <<"description">> => <<"URL, на который будут поступать оповещения о произошедших событиях\n">>,
          <<"maxLength">> => 1000
        },
        <<"publicKey">> => #{
          <<"type">> => <<"string">>,
          <<"format">> => <<"hexadecimal">>,
          <<"example">> => <<"MIGJAoGBAM1fmNUvezts3yglTdhXuqG7OhHxQtDFA+Ss//YuUGjw5ossDbEMoS+SIFuYZ/UL9Xg0rEHNRSbmf48OK+mz0FobEtbji8MADayzGfFopXsfRFa7MVy3Uhu5jBDpLsN3DyJapAkK0TAYINlZXxVjDwxRNheTvC+xub5WNdiwc28fAgMBAAE=">>,
          <<"description">> => <<"Содержимое публичного ключа, служащего для проверки авторитативности\nприходящих на `url` оповещений\n">>,
          <<"readOnly">> => true
        }
      },
      <<"example">> => #{
        <<"scope">> => #{
          <<"topic">> => <<"InvoicesTopic">>
        },
        <<"active">> => true,
        <<"id">> => <<"id">>,
        <<"publicKey">> => <<"MIGJAoGBAM1fmNUvezts3yglTdhXuqG7OhHxQtDFA+Ss//YuUGjw5ossDbEMoS+SIFuYZ/UL9Xg0rEHNRSbmf48OK+mz0FobEtbji8MADayzGfFopXsfRFa7MVy3Uhu5jBDpLsN3DyJapAkK0TAYINlZXxVjDwxRNheTvC+xub5WNdiwc28fAgMBAAE=">>,
        <<"partyID">> => <<"partyID">>,
        <<"url">> => <<"url">>
      }
    },
    <<"WebhookScope">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"topic">> ],
      <<"discriminator">> => <<"topic">>,
      <<"properties">> => #{
        <<"topic">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Предмет оповещений">>,
          <<"enum">> => [ <<"InvoicesTopic">>, <<"CustomersTopic">> ]
        }
      },
      <<"description">> => <<"Область охвата webhook'а, ограничивающая набор типов событий, по которым\nследует отправлять оповещения\n">>,
      <<"example">> => #{
        <<"topic">> => <<"InvoicesTopic">>
      },
      <<"x-discriminator-is-enum">> => true
    },
    <<"YandexPay">> => #{
      <<"allOf">> => [ #{
        <<"$ref">> => <<"#/definitions/TokenizedCardData">>
      }, #{
        <<"type">> => <<"object">>,
        <<"required">> => [ <<"gatewayMerchantID">>, <<"paymentToken">> ],
        <<"properties">> => #{
          <<"gatewayMerchantID">> => #{
            <<"type">> => <<"string">>,
            <<"description">> => <<"Идентификатор мерчанта в системе">>
          },
          <<"paymentToken">> => #{
            <<"type">> => <<"object">>,
            <<"description">> => <<"Совокупность открытых и зашифрованных платежных данных">>,
            <<"properties">> => #{ }
          }
        },
        <<"description">> => <<"Платежные данные Yandex Pay">>
      } ]
    },
    <<"inline_response_200">> => #{
      <<"type">> => <<"object">>,
      <<"properties">> => #{
        <<"continuationToken">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Токен, сигнализирующий о том, что в ответе передана только часть данных.\nДля получения следующей части нужно повторно обратиться к сервису, указав тот-же набор условий и полученый токен.\nЕсли токена нет, получена последняя часть данных.\n">>
        },
        <<"result">> => #{
          <<"type">> => <<"array">>,
          <<"items">> => #{
            <<"$ref">> => <<"#/definitions/Invoice">>
          }
        }
      },
      <<"example">> => #{
        <<"result">> => [ #{
          <<"bankAccount">> => #{
            <<"accountType">> => <<"InvoiceRussianBankAccount">>
          },
          <<"reason">> => <<"reason">>,
          <<"amount">> => 1,
          <<"product">> => <<"product">>,
          <<"allocation">> => <<"">>,
          <<"metadata">> => <<"{}">>,
          <<"dueDate">> => <<"2000-01-23T04:56:07.000+00:00">>,
          <<"externalID">> => <<"externalID">>,
          <<"description">> => <<"description">>,
          <<"clientInfo">> => #{
            <<"trustLevel">> => <<"wellKnown">>
          },
          <<"cart">> => <<"">>,
          <<"createdAt">> => <<"2000-01-23T04:56:07.000+00:00">>,
          <<"currency">> => <<"currency">>,
          <<"id">> => <<"id">>,
          <<"shopID">> => <<"shopID">>,
          <<"invoiceTemplateID">> => <<"invoiceTemplateID">>,
          <<"status">> => <<"unpaid">>
        }, #{
          <<"bankAccount">> => #{
            <<"accountType">> => <<"InvoiceRussianBankAccount">>
          },
          <<"reason">> => <<"reason">>,
          <<"amount">> => 1,
          <<"product">> => <<"product">>,
          <<"allocation">> => <<"">>,
          <<"metadata">> => <<"{}">>,
          <<"dueDate">> => <<"2000-01-23T04:56:07.000+00:00">>,
          <<"externalID">> => <<"externalID">>,
          <<"description">> => <<"description">>,
          <<"clientInfo">> => #{
            <<"trustLevel">> => <<"wellKnown">>
          },
          <<"cart">> => <<"">>,
          <<"createdAt">> => <<"2000-01-23T04:56:07.000+00:00">>,
          <<"currency">> => <<"currency">>,
          <<"id">> => <<"id">>,
          <<"shopID">> => <<"shopID">>,
          <<"invoiceTemplateID">> => <<"invoiceTemplateID">>,
          <<"status">> => <<"unpaid">>
        } ],
        <<"continuationToken">> => <<"continuationToken">>
      }
    },
    <<"inline_response_200_1">> => #{
      <<"type">> => <<"object">>,
      <<"properties">> => #{
        <<"continuationToken">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Токен, сигнализирующий о том, что в ответе передана только часть данных.\nДля получения следующей части нужно повторно обратиться к сервису, указав тот-же набор условий и полученый токен.\nЕсли токена нет, получена последняя часть данных.\n">>
        },
        <<"result">> => #{
          <<"type">> => <<"array">>,
          <<"items">> => #{
            <<"$ref">> => <<"#/definitions/PaymentSearchResult">>
          }
        }
      },
      <<"example">> => #{
        <<"result">> => [ <<"">>, <<"">> ],
        <<"continuationToken">> => <<"continuationToken">>
      }
    },
    <<"inline_response_200_2">> => #{
      <<"type">> => <<"object">>,
      <<"properties">> => #{
        <<"totalCount">> => #{
          <<"type">> => <<"integer">>
        },
        <<"result">> => #{
          <<"type">> => <<"array">>,
          <<"items">> => #{
            <<"$ref">> => <<"#/definitions/Payout">>
          }
        }
      },
      <<"example">> => #{
        <<"result">> => [ #{
          <<"createdAt">> => <<"2000-01-23T04:56:07.000+00:00">>,
          <<"amount">> => 1,
          <<"payoutToolDetails">> => #{
            <<"detailsType">> => <<"detailsType">>
          },
          <<"cancellationDetails">> => <<"cancellationDetails">>,
          <<"fee">> => 0,
          <<"currency">> => <<"currency">>,
          <<"id">> => <<"id">>,
          <<"shopID">> => <<"shopID">>,
          <<"status">> => <<"status">>
        }, #{
          <<"createdAt">> => <<"2000-01-23T04:56:07.000+00:00">>,
          <<"amount">> => 1,
          <<"payoutToolDetails">> => #{
            <<"detailsType">> => <<"detailsType">>
          },
          <<"cancellationDetails">> => <<"cancellationDetails">>,
          <<"fee">> => 0,
          <<"currency">> => <<"currency">>,
          <<"id">> => <<"id">>,
          <<"shopID">> => <<"shopID">>,
          <<"status">> => <<"status">>
        } ],
        <<"totalCount">> => 0
      }
    },
    <<"inline_response_200_3">> => #{
      <<"type">> => <<"object">>,
      <<"properties">> => #{
        <<"totalCount">> => #{
          <<"type">> => <<"integer">>
        },
        <<"result">> => #{
          <<"type">> => <<"array">>,
          <<"items">> => #{
            <<"$ref">> => <<"#/definitions/RefundSearchResult">>
          }
        }
      },
      <<"example">> => #{
        <<"result">> => [ <<"">>, <<"">> ],
        <<"totalCount">> => 0
      }
    },
    <<"inline_response_400">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"code">>, <<"message">> ],
      <<"properties">> => #{
        <<"code">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"[Код ошибки](#tag/Error-Codes)\n">>,
          <<"enum">> => [ <<"operationNotPermitted">>, <<"invalidPartyID">>, <<"invalidShopID">>, <<"invalidPartyStatus">>, <<"invalidShopStatus">>, <<"invalidRequest">>, <<"invalidDeadline">>, <<"ambiguousPartyID">> ]
        },
        <<"message">> => #{
          <<"type">> => <<"string">>,
          <<"example">> => <<"Operation not permitted">>,
          <<"description">> => <<"Человекочитаемое описание ошибки">>
        }
      }
    },
    <<"inline_response_400_1">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"code">>, <<"message">> ],
      <<"properties">> => #{
        <<"code">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"[Код ошибки](#tag/Error-Codes)\n">>,
          <<"enum">> => [ <<"invalidPartyStatus">>, <<"invalidShopStatus">>, <<"invalidRequest">>, <<"invalidDeadline">> ]
        },
        <<"message">> => #{
          <<"type">> => <<"string">>,
          <<"example">> => <<"Invalid party status">>,
          <<"description">> => <<"Человекочитаемое описание ошибки">>
        }
      }
    },
    <<"inline_response_400_2">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"code">>, <<"message">> ],
      <<"properties">> => #{
        <<"code">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"[Код ошибки](#tag/Error-Codes)\n">>,
          <<"enum">> => [ <<"invalidPaymentResource">>, <<"operationNotPermitted">>, <<"invalidPartyStatus">>, <<"invalidShopStatus">>, <<"invalidPaymentToolToken">>, <<"invalidPaymentSession">>, <<"invalidRequest">>, <<"invalidDeadline">> ]
        },
        <<"message">> => #{
          <<"type">> => <<"string">>,
          <<"example">> => <<"Invalid payment resource">>,
          <<"description">> => <<"Человекочитаемое описание ошибки">>
        }
      }
    },
    <<"inline_response_400_3">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"code">>, <<"message">> ],
      <<"properties">> => #{
        <<"code">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"[Код ошибки](#tag/Error-Codes)\n">>,
          <<"enum">> => [ <<"invalidPartyID">>, <<"invalidRequest">>, <<"invalidDeadline">>, <<"invalidShopID">>, <<"invalidPartyStatus">>, <<"invalidShopStatus">>, <<"invalidInvoiceCart">>, <<"ambiguousPartyID">> ]
        },
        <<"message">> => #{
          <<"type">> => <<"string">>,
          <<"example">> => <<"Lifetime cannot be zero">>,
          <<"description">> => <<"Человекочитаемое описание ошибки">>
        }
      }
    },
    <<"inline_response_400_4">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"code">>, <<"message">> ],
      <<"properties">> => #{
        <<"code">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"[Код ошибки](#tag/Error-Codes)\n">>,
          <<"enum">> => [ <<"invalidPartyStatus">>, <<"invalidShopStatus">>, <<"invalidInvoiceCart">>, <<"invalidRequest">>, <<"invalidDeadline">> ]
        },
        <<"message">> => #{
          <<"type">> => <<"string">>,
          <<"example">> => <<"Invalid party status">>,
          <<"description">> => <<"Человекочитаемое описание ошибки">>
        }
      }
    },
    <<"inline_response_400_5">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"code">>, <<"message">> ],
      <<"properties">> => #{
        <<"code">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"[Код ошибки](#tag/Error-Codes)\n">>,
          <<"enum">> => [ <<"invalidPartyStatus">>, <<"invalidShopStatus">>, <<"invalidRequest">>, <<"invalidDeadline">>, <<"invoiceTermsViolated">> ]
        },
        <<"message">> => #{
          <<"type">> => <<"string">>,
          <<"example">> => <<"Invalid party status">>,
          <<"description">> => <<"Человекочитаемое описание ошибки">>
        }
      }
    },
    <<"inline_response_400_6">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"code">>, <<"message">> ],
      <<"properties">> => #{
        <<"code">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"[Код ошибки](#tag/Error-Codes)\n">>,
          <<"enum">> => [ <<"invalidPartyID">>, <<"invalidShopID">>, <<"invalidRequest">>, <<"invalidDeadline">>, <<"invalidPartyStatus">>, <<"invalidShopStatus">>, <<"invalidInvoiceCart">>, <<"invalidAllocation">>, <<"allocationNotPermitted">>, <<"invalidInvoiceCost">>, <<"invoiceTermsViolated">>, <<"ambiguousPartyID">> ]
        },
        <<"message">> => #{
          <<"type">> => <<"string">>,
          <<"example">> => <<"Shop not found or inaccessible">>,
          <<"description">> => <<"Человекочитаемое описание ошибки">>
        }
      }
    },
    <<"inline_response_400_7">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"code">>, <<"message">> ],
      <<"properties">> => #{
        <<"code">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"[Код ошибки](#tag/Error-Codes)\n">>,
          <<"enum">> => [ <<"invalidInvoiceStatus">>, <<"invalidPartyStatus">>, <<"invalidShopStatus">>, <<"invalidRequest">>, <<"invalidDeadline">> ]
        },
        <<"message">> => #{
          <<"type">> => <<"string">>,
          <<"example">> => <<"Invalid invoice status">>,
          <<"description">> => <<"Человекочитаемое описание ошибки">>
        }
      }
    },
    <<"inline_response_400_8">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"code">>, <<"message">> ],
      <<"properties">> => #{
        <<"code">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"[Код ошибки](#tag/Error-Codes)\n">>,
          <<"enum">> => [ <<"invalidInvoiceStatus">>, <<"invoicePaymentPending">>, <<"invalidRequest">>, <<"invalidDeadline">>, <<"invalidPartyStatus">>, <<"invalidShopStatus">>, <<"invalidContractStatus">>, <<"invalidPaymentToolToken">>, <<"invalidPaymentSession">>, <<"invalidProcessingDeadline">>, <<"invalidRecurrentParent">>, <<"operationNotPermitted">> ]
        },
        <<"message">> => #{
          <<"type">> => <<"string">>,
          <<"example">> => <<"Invalid invoice status">>,
          <<"description">> => <<"Человекочитаемое описание ошибки">>
        }
      }
    },
    <<"inline_response_400_9">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"code">>, <<"message">> ],
      <<"properties">> => #{
        <<"code">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"[Код ошибки](#tag/Error-Codes)\n">>,
          <<"enum">> => [ <<"invalidPaymentStatus">>, <<"operationNotPermitted">>, <<"invalidPartyStatus">>, <<"invalidShopStatus">>, <<"invalidRequest">>, <<"invalidDeadline">> ]
        },
        <<"message">> => #{
          <<"type">> => <<"string">>,
          <<"example">> => <<"Invalid payment status">>,
          <<"description">> => <<"Человекочитаемое описание ошибки">>
        }
      }
    },
    <<"inline_response_400_10">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"code">>, <<"message">> ],
      <<"properties">> => #{
        <<"code">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"[Код ошибки](#tag/Error-Codes)\n">>,
          <<"enum">> => [ <<"invalidPaymentStatus">>, <<"operationNotPermitted">>, <<"invalidPartyStatus">>, <<"invalidShopStatus">>, <<"invalidRequest">>, <<"invalidDeadline">>, <<"invalidInvoiceCart">>, <<"invalidAllocation">>, <<"allocationNotPermitted">>, <<"inconsistentCaptureCurrency">>, <<"amountExceededCaptureBalance">> ]
        },
        <<"message">> => #{
          <<"type">> => <<"string">>,
          <<"example">> => <<"Invalid payment status">>,
          <<"description">> => <<"Человекочитаемое описание ошибки">>
        }
      }
    },
    <<"inline_response_400_11">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"code">>, <<"message">> ],
      <<"properties">> => #{
        <<"code">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"[Код ошибки](#tag/Error-Codes)\n">>,
          <<"enum">> => [ <<"invalidPartyStatus">>, <<"invalidShopStatus">>, <<"invalidContractStatus">>, <<"invalidInvoiceCart">>, <<"invalidAllocation">>, <<"allocationNotPermitted">>, <<"operationNotPermitted">>, <<"invalidPaymentStatus">>, <<"insufficentAccountBalance">>, <<"invoicePaymentAmountExceeded">>, <<"inconsistentRefundCurrency">>, <<"invalidRequest">>, <<"invalidDeadline">>, <<"chargebackInProgress">>, <<"refundCartConflict">> ]
        },
        <<"message">> => #{
          <<"type">> => <<"string">>,
          <<"example">> => <<"Operation not permitted">>,
          <<"description">> => <<"Человекочитаемое описание ошибки">>
        }
      }
    },
    <<"inline_response_400_12">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"code">>, <<"message">> ],
      <<"properties">> => #{
        <<"code">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"[Код ошибки](#tag/Error-Codes)\n">>,
          <<"enum">> => [ <<"invalidInvoiceStatus">>, <<"invoicePaymentPending">>, <<"invalidPartyStatus">>, <<"invalidShopStatus">>, <<"invalidRequest">>, <<"invalidDeadline">> ]
        },
        <<"message">> => #{
          <<"type">> => <<"string">>,
          <<"example">> => <<"Invalid invoice status">>,
          <<"description">> => <<"Человекочитаемое описание ошибки">>
        }
      }
    },
    <<"inline_response_400_13">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"code">>, <<"message">> ],
      <<"properties">> => #{
        <<"code">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"[Код ошибки](#tag/Error-Codes)\n">>,
          <<"enum">> => [ <<"invalidPartyID">>, <<"invalidPayoutTool">>, <<"invalidCash">>, <<"invalidRequest">>, <<"invalidDeadline">>, <<"ambiguousPartyID">> ]
        },
        <<"message">> => #{
          <<"type">> => <<"string">>,
          <<"example">> => <<"invalid payout id">>,
          <<"description">> => <<"Человекочитаемое описание ошибки">>
        }
      }
    },
    <<"inline_response_400_14">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"code">>, <<"message">> ],
      <<"properties">> => #{
        <<"code">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"[Код ошибки](#tag/Error-Codes)\n">>,
          <<"enum">> => [ <<"invalidPartyID">>, <<"invalidShopID">>, <<"invalidRequest">>, <<"invalidDeadline">>, <<"ambiguousPartyID">> ]
        },
        <<"message">> => #{
          <<"type">> => <<"string">>,
          <<"example">> => <<"Shop not found or inaccessible">>,
          <<"description">> => <<"Человекочитаемое описание ошибки">>
        }
      }
    },
    <<"inline_response_429">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"message">> ],
      <<"properties">> => #{
        <<"message">> => #{
          <<"type">> => <<"string">>,
          <<"example">> => <<"Webhook limit exceeded">>,
          <<"description">> => <<"Человекочитаемое описание ошибки">>
        }
      }
    },
    <<"AllocationFee_target">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"allocationTargetType">> ],
      <<"properties">> => #{
        <<"allocationTargetType">> => #{
          <<"type">> => <<"string">>,
          <<"enum">> => [ <<"AllocationTargetShop">> ]
        }
      },
      <<"description">> => <<"Назначение транзакции">>
    },
    <<"BankCard_tokenProviderData">> => #{
      <<"type">> => <<"object">>
    },
    <<"Payer_sessionInfo">> => #{
      <<"type">> => <<"object">>,
      <<"properties">> => #{
        <<"redirectUrl">> => #{
          <<"type">> => <<"string">>,
          <<"format">> => <<"uri-template">>,
          <<"description">> => <<"URL ресурса, на который нужно перенаправить плательщика по завершении\nс ним взаимодействия в браузере, например проведения предавторизации платежа\nпо протоколу 3D Secure 2.0 и выше, в том случае, если подобное взаимодействие\nпотребуется.\n">>,
          <<"maxLength">> => 2000
        }
      },
      <<"description">> => <<"Данные текущей сессии плательщика">>,
      <<"example">> => #{
        <<"redirectUrl">> => <<"redirectUrl">>
      }
    },
    <<"Refund_error">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"code">>, <<"message">> ],
      <<"properties">> => #{
        <<"code">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Код ошибки, пригодный для обработки автоматическими системами">>
        },
        <<"message">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Описание ошибки, пригодное для восприятия человеком">>
        }
      },
      <<"description">> => <<"Данные ошибки, возникшей в процессе проведения возврата, в случае если\nвозврат был неуспешен\n">>,
      <<"example">> => #{
        <<"code">> => <<"code">>,
        <<"message">> => <<"message">>
      }
    },
    <<"UserInteractionForm_inner">> => #{
      <<"type">> => <<"object">>,
      <<"required">> => [ <<"key">>, <<"template">> ],
      <<"properties">> => #{
        <<"key">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Значение ключа элемента формы, которую необходимо отправить средствами\nбраузера\n">>
        },
        <<"template">> => #{
          <<"type">> => <<"string">>,
          <<"description">> => <<"Шаблон значения элемента формы\nШаблон представлен согласно стандарту\n[RFC6570](https://tools.ietf.org/html/rfc6570).\n">>
        }
      }
    }
  },
  <<"parameters">> => #{
    <<"requestID">> => #{
      <<"name">> => <<"X-Request-ID">>,
      <<"in">> => <<"header">>,
      <<"description">> => <<"Уникальный идентификатор запроса к системе">>,
      <<"required">> => true,
      <<"type">> => <<"string">>,
      <<"maxLength">> => 32,
      <<"minLength">> => 1
    },
    <<"shopID">> => #{
      <<"name">> => <<"shopID">>,
      <<"in">> => <<"path">>,
      <<"description">> => <<"Идентификатор магазина">>,
      <<"required">> => true,
      <<"type">> => <<"string">>,
      <<"maxLength">> => 40,
      <<"minLength">> => 1
    },
    <<"invoiceTemplateID">> => #{
      <<"name">> => <<"invoiceTemplateID">>,
      <<"in">> => <<"path">>,
      <<"description">> => <<"Идентификатор шаблона инвойса">>,
      <<"required">> => true,
      <<"type">> => <<"string">>,
      <<"maxLength">> => 40,
      <<"minLength">> => 1
    },
    <<"paymentID">> => #{
      <<"name">> => <<"paymentID">>,
      <<"in">> => <<"path">>,
      <<"description">> => <<"Идентификатор платежа в рамках инвойса">>,
      <<"required">> => true,
      <<"type">> => <<"string">>,
      <<"maxLength">> => 40,
      <<"minLength">> => 1
    },
    <<"refundID">> => #{
      <<"name">> => <<"refundID">>,
      <<"in">> => <<"path">>,
      <<"description">> => <<"Идентификатор возврата в рамках платежа">>,
      <<"required">> => true,
      <<"type">> => <<"string">>,
      <<"maxLength">> => 40,
      <<"minLength">> => 1
    },
    <<"chargebackID">> => #{
      <<"name">> => <<"chargebackID">>,
      <<"in">> => <<"path">>,
      <<"description">> => <<"Идентификатор возвратного платежа в рамках платежа">>,
      <<"required">> => true,
      <<"type">> => <<"string">>,
      <<"maxLength">> => 40,
      <<"minLength">> => 1
    },
    <<"contractID">> => #{
      <<"name">> => <<"contractID">>,
      <<"in">> => <<"path">>,
      <<"description">> => <<"Идентификатор договора">>,
      <<"required">> => true,
      <<"type">> => <<"string">>,
      <<"maxLength">> => 40,
      <<"minLength">> => 1
    },
    <<"residence">> => #{
      <<"name">> => <<"residence">>,
      <<"in">> => <<"query">>,
      <<"description">> => <<"Резиденция, alpha-3 код по стандарту [ISO 3166-1](https://en.wikipedia.org/wiki/ISO_3166-1)">>,
      <<"required">> => false,
      <<"type">> => <<"string">>,
      <<"pattern">> => <<"^[A-Z]{3}$">>
    },
    <<"customerID">> => #{
      <<"name">> => <<"customerID">>,
      <<"in">> => <<"path">>,
      <<"description">> => <<"Идентификатор кастомера">>,
      <<"required">> => true,
      <<"type">> => <<"string">>,
      <<"maxLength">> => 40,
      <<"minLength">> => 1
    },
    <<"customerBindingID">> => #{
      <<"name">> => <<"customerBindingID">>,
      <<"in">> => <<"path">>,
      <<"description">> => <<"Идентификатор привязки к кастомера">>,
      <<"required">> => true,
      <<"type">> => <<"string">>,
      <<"maxLength">> => 40,
      <<"minLength">> => 1
    },
    <<"webhookID">> => #{
      <<"name">> => <<"webhookID">>,
      <<"in">> => <<"path">>,
      <<"description">> => <<"Идентификатор webhook'а">>,
      <<"required">> => true,
      <<"type">> => <<"string">>,
      <<"maxLength">> => 40,
      <<"minLength">> => 1
    },
    <<"adjustmentID">> => #{
      <<"name">> => <<"adjustmentID">>,
      <<"in">> => <<"path">>,
      <<"description">> => <<"Идентификатор поправки к договору">>,
      <<"required">> => true,
      <<"type">> => <<"string">>,
      <<"maxLength">> => 40,
      <<"minLength">> => 1
    },
    <<"payoutToolID">> => #{
      <<"name">> => <<"payoutToolID">>,
      <<"in">> => <<"path">>,
      <<"description">> => <<"Идентификатор средства вывода">>,
      <<"required">> => true,
      <<"type">> => <<"string">>,
      <<"maxLength">> => 40,
      <<"minLength">> => 1
    },
    <<"payoutID">> => #{
      <<"name">> => <<"payoutID">>,
      <<"in">> => <<"path">>,
      <<"description">> => <<"Идентификатор вывода">>,
      <<"required">> => true,
      <<"type">> => <<"string">>,
      <<"maxLength">> => 40,
      <<"minLength">> => 1
    },
    <<"invoiceID">> => #{
      <<"name">> => <<"invoiceID">>,
      <<"in">> => <<"path">>,
      <<"description">> => <<"Идентификатор инвойса">>,
      <<"required">> => true,
      <<"type">> => <<"string">>,
      <<"maxLength">> => 40,
      <<"minLength">> => 1
    },
    <<"paymentInstitutionID">> => #{
      <<"name">> => <<"paymentInstitutionID">>,
      <<"in">> => <<"path">>,
      <<"description">> => <<"Payment institution reference">>,
      <<"required">> => true,
      <<"type">> => <<"integer">>,
      <<"format">> => <<"int32">>
    },
    <<"serviceProviderID">> => #{
      <<"name">> => <<"serviceProviderID">>,
      <<"in">> => <<"path">>,
      <<"description">> => <<"Идентификатор провайдера платёжных сервисов в системе">>,
      <<"required">> => true,
      <<"type">> => <<"string">>,
      <<"maxLength">> => 100,
      <<"minLength">> => 1
    },
    <<"fromTime">> => #{
      <<"name">> => <<"fromTime">>,
      <<"in">> => <<"query">>,
      <<"description">> => <<"Начало временного отрезка">>,
      <<"required">> => true,
      <<"type">> => <<"string">>,
      <<"format">> => <<"date-time">>
    },
    <<"toTime">> => #{
      <<"name">> => <<"toTime">>,
      <<"in">> => <<"query">>,
      <<"description">> => <<"Конец временного отрезка">>,
      <<"required">> => true,
      <<"type">> => <<"string">>,
      <<"format">> => <<"date-time">>
    },
    <<"limit">> => #{
      <<"name">> => <<"limit">>,
      <<"in">> => <<"query">>,
      <<"description">> => <<"Лимит выборки">>,
      <<"required">> => true,
      <<"type">> => <<"integer">>,
      <<"maximum">> => 1000,
      <<"minimum">> => 1,
      <<"format">> => <<"int32">>
    },
    <<"offset">> => #{
      <<"name">> => <<"offset">>,
      <<"in">> => <<"query">>,
      <<"description">> => <<"Смещение выборки">>,
      <<"required">> => false,
      <<"type">> => <<"integer">>,
      <<"minimum">> => 0
    },
    <<"deadline">> => #{
      <<"name">> => <<"X-Request-Deadline">>,
      <<"in">> => <<"header">>,
      <<"description">> => <<"Максимальное время обработки запроса">>,
      <<"required">> => false,
      <<"type">> => <<"string">>,
      <<"maxLength">> => 40,
      <<"minLength">> => 1
    },
    <<"partyID">> => #{
      <<"name">> => <<"partyID">>,
      <<"in">> => <<"path">>,
      <<"description">> => <<"Уникальный в рамках системы идентификатор участника.">>,
      <<"required">> => true,
      <<"type">> => <<"string">>
    },
    <<"countryID">> => #{
      <<"name">> => <<"countryID">>,
      <<"in">> => <<"path">>,
      <<"description">> => <<"Alpha-3 код страны по стандарту [ISO 3166-1](https://en.wikipedia.org/wiki/ISO_3166-1)">>,
      <<"required">> => true,
      <<"type">> => <<"string">>,
      <<"pattern">> => <<"^[A-Z]{3}$">>
    },
    <<"tradeBlocID">> => #{
      <<"name">> => <<"tradeBlocID">>,
      <<"in">> => <<"path">>,
      <<"description">> => <<"Идентификатор торгового блока">>,
      <<"required">> => true,
      <<"type">> => <<"string">>
    }
  },
  <<"responses">> => #{
    <<"NotFound">> => #{
      <<"description">> => <<"Заданный ресурс не найден">>,
      <<"schema">> => #{
        <<"$ref">> => <<"#/definitions/GeneralError">>
      }
    },
    <<"Unauthorized">> => #{
      <<"description">> => <<"Ошибка авторизации">>
    },
    <<"DefaultLogicError">> => #{
      <<"description">> => <<"Неверные данные">>,
      <<"schema">> => #{
        <<"$ref">> => <<"#/definitions/DefaultLogicError">>
      }
    },
    <<"ExternalIDConflict">> => #{
      <<"description">> => <<"Переданное значение `externalID` уже использовалось вами ранее с другими параметрами запроса">>,
      <<"schema">> => #{
        <<"$ref">> => <<"#/definitions/ExternalIDConflictError">>
      }
    }
  }
}.

-ifdef(TEST).
-include_lib("eunit/include/eunit.hrl").

-define(SCHEMA,
  <<"{\"definitions\": {
       \"Pet\": {
         \"type\":          \"object\",
         \"discriminator\": \"petType\",
         \"properties\": {
            \"name\":    {\"type\": \"string\"},
            \"petType\": {\"type\": \"string\"}
         },
         \"required\": [\"name\", \"petType\"]
       },
       \"Cat\": {
         \"description\": \"A representation of a cat\",
         \"allOf\": [
           {\"$ref\": \"#/definitions/Pet\"},
           {
             \"type\":       \"object\",
             \"properties\": {
               \"huntingSkill\": {
                 \"type\":        \"string\",
                 \"description\": \"The measured skill for hunting\",
                 \"default\":     \"lazy\",
                 \"enum\":        [\"clueless\", \"lazy\", \"adventurous\", \"aggressive\"]
               }
             },
             \"required\": [\"huntingSkill\"]
           }
         ]
       },
       \"Dog\": {
         \"description\": \"A representation of a dog\",
         \"allOf\": [
           {\"$ref\": \"#/definitions/Pet\"},
           {
             \"type\":       \"object\",
             \"properties\": {
               \"packSize\": {
                 \"type\":        \"integer\",
                 \"format\":      \"int32\",
                 \"description\": \"the size of the pack the dog is from\",
                 \"default\":     0,
                 \"minimum\":     0
               }
             }
           }
         ],
         \"required\": [\"packSize\"]
       },
       \"Person\": {
         \"type\":          \"object\",
         \"discriminator\": \"personType\",
         \"properties\": {
           \"name\": {\"type\": \"string\"},
           \"sex\": {
             \"type\": \"string\",
             \"enum\": [\"male\", \"female\"]
           },
           \"personType\": {\"type\": \"string\"}
         },
         \"required\": [\"name\", \"sex\", \"personType\"]
       },
       \"WildMix\": {
         \"allOf\": [
           {\"$ref\": \"#/definitions/Pet\"},
           {\"$ref\": \"#/definitions/Person\"}
         ],
       },
       \"Dummy\": {
         \"type\":          \"object\",
         \"discriminator\": \"dummyType\",
         \"properties\": {
           \"name\":      {\"type\": \"string\"},
           \"dummyType\": {\"type\": \"string\"}
         },
         \"required\": [\"name\", \"dummyType\"]
       }
     }}">>).

get_enum(Parent, Discr, Schema) ->
    lists:sort(deep_get([?DEFINITIONS, Parent, <<"properties">>, Discr, <<"enum">>], Schema)).

deep_get([K], M) ->
    maps:get(K, M);
deep_get([K | Ks], M) ->
    deep_get(Ks, maps:get(K, M)).

-spec test() -> _.
-spec enumerate_discriminator_children_test() -> _.
enumerate_discriminator_children_test() ->
    Schema      = jsx:decode(?SCHEMA, [return_maps]),
    FixedSchema = enumerate_discriminator_children(Schema),
    ?assertEqual(lists:sort([<<"Dog">>, <<"Cat">>, <<"WildMix">>]), get_enum(<<"Pet">>, <<"petType">>, FixedSchema)),
    ?assertEqual([<<"WildMix">>], get_enum(<<"Person">>,  <<"personType">>, FixedSchema)),
    ?assertEqual([],              get_enum(<<"Dummy">>,   <<"dummyType">>,  FixedSchema)).

-spec get_test() -> _.
get_test() ->
    ?assertEqual(
       enumerate_discriminator_children(maps:with([?DEFINITIONS], get_raw())),
       ?MODULE:get()
    ).
-endif.
